[
  {
    "imgs": [
      "Bilious Skulldweller",
      "Virulent Sliver"
    ],
    "q": "Why did they decide to use <span class=\"autocard\">Bilious Skulldweller</span> and not bring back <span class=\"autocard\">Virulent Sliver</span>?",
    "a": "A few reasons, not entirely to do with the rules, but it's still a question that's been asked a few times. Poisonous is a triggered ability, while toxic is a static ability that applies as the creature is dealing damage to the opponent. Also, by its English definition, \"poisonous\" is when you eat or ingest a toxin, which isn't what's happening when the Skulldweller deals damage to you - you're not eating it, it's biting you. \"Venomous\" would be the word you're looking for if the toxin was being injected into you when it bites you, so calling the ability \"poisonous\" isn't technically correct."
  },
  {
    "imgs": [
      "Nimraiser Paladin",
      "Prosthetic Injector"
    ],
    "q": "If I equip my <span class=\"autocard\">Nimraiser Paladin</span> with a <span class=\"autocard\">Prosthetic Injector</span> and attack my opponent with it, how many poison counters will they get?",
    "a": "They'll get a total of three poison counters. Since the Paladin has toxic 1 and toxic 2, both will apply when the Paladin deals combat damage to the opponent, and they'll end up getting a total of three poison counters from the Paladin."
  },
  {
    "imgs": [
      "Anoint with Affliction",
      "The Seedcore",
      "Feed the Infection"
    ],
    "q": "What does it mean to be <span class=\"autocard\">Anoint with Affliction</span>?",
    "a": "Corrupted is a new ability word - it doesn't have any rules meaning. Corrupted gives you a small bonus if an opponent has at least three poison counters. For example, <span class=\"autocard\">The Seedcore</span>'s last ability can be activated if an opponent has three or more poison counters, while a card like <span class=\"autocard\">Feed the Infection</span> will also cause your opponent to lose life if they have three or more poison counters."
  },
  {
    "imgs": [
      "Watchful Blisterzoa",
      "Trawler Drake",
      "Tamiyo's Immobilizer"
    ],
    "q": "What does an <span class=\"autocard\">Watchful Blisterzoa</span> do?",
    "a": "By itself? Nothing. Oil counters don't have any innate abilities tied to them. But there are a few cards in <i>All Will Be One</i> that use them. Some cards, like <span class=\"autocard\">Trawler Drake</span>, start with some oil counters, and can get more to become more effective. The Drake becomes bigger, for example. Some will start with oil counters, but you'll use them to activate some ability, like <span class=\"autocard\">Tamiyo's Immobilizer</span>. Just read the card and it will explain how that card uses oil counters."
  },
  {
    "imgs": [
      "Branchblight Stalker",
      "Impede Momentum"
    ],
    "q": "If my <span class=\"autocard\">Branchblight Stalker</span> has both a +1/+1 counter and a stun counter from <span class=\"autocard\">Impede Momentum</span> on it, and I proliferate, can I choose to just proliferate just the +1/+1 counter and not the stun counter?",
    "a": "You cannot. You choose the permanents or players that you want to proliferate the counter on, but you don't get to choose which counters are added - you add a copy of each type of counter on it. So if you choose the Stalker, you'll be adding both a +1/+1 counter and a stun counter to it - you can't just add a +1/+1 counter and not a stun counter."
  },
  {
    "imgs": [
      "All Will Be One",
      "Kaya, Intangible Slayer"
    ],
    "q": "I have <span class=\"autocard\">All Will Be One</span> in play. If I cast a planeswalker like <span class=\"autocard\">Kaya, Intangible Slayer</span>, will All Will Be One trigger and let me deal 6 damage?",
    "a": "It will! Entering the battlefield with counters counts as putting counters on a permanent. Since Kaya enters the battlefield with six loyalty counters, All Will Be One will trigger and you'll be able to deal 6 damage to the target."
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines"
    ],
    "q": "If my opponent and I both control an <span class=\"autocard\">Elesh Norn, Mother of Machines</span>, what happens to our triggered abilities?",
    "a": "Nobody gets any enter the battlefield triggers! Because you and your opponent both control an Elesh Norn, permanents entering the battlefield won't cause abilities to trigger. Since enter the battlefield abilities can't trigger, Elesh Norn's other static ability won't do anything, and nobody will get enter the battlefield triggers."
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines",
      "Koth, Fire of Resistance"
    ],
    "q": "If my opponent controls <span class=\"autocard\">Elesh Norn, Mother of Machines</span>, does that mean planeswalkers I cast (like <span class=\"autocard\">Koth, Fire of Resistance</span>) won't enter with any loyalty counters on it?",
    "a": "Nope, your Koth enters with 4 loyalty like normal. A planeswalker entering with loyalty counters is a replacement effect, not a triggered ability, so Elesh Norn won't care about it. Your Koth will enter with its normal amount of loyalty counters."
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines",
      "Dress Down"
    ],
    "q": "My opponent controls <span class=\"autocard\">Elesh Norn, Mother of Machines</span>. If I cast <span class=\"autocard\">Dress Down</span>, will I draw a card when Dress Down enters, or will Elesh Norn stop it from triggering?",
    "a": "You'll get to draw a card. After Dress Down enters the battlefield, we check to see if anything should be triggering from Dress Down entering the battlefield. Since Dress Down is on the battlefield, creatures don't have any abilities, including your opponent's Elesh Norn, and Elesh Norn won't stop your triggered abilities from triggering. So you'll be able to draw a card from Dress Down's enter the battlefield trigger."
  },
  {
    "imgs": [
      "Geth, Thane of Contracts",
      "Fleshbag Marauder"
    ],
    "q": "I control <span class=\"autocard\">Geth, Thane of Contracts</span>. If I return a <span class=\"autocard\">Fleshbag Marauder</span>, can I sacrifice the Marauder to its enter the battlefield trigger before it dies due to having a toughness of 0?",
    "a": "No you cannot. While you can return the Marauder with Geth's ability, before the Marauder's trigger can go on the stack, we check state-based actions. The Marauder is a 2/0, and it goes to exile (because of Geth's effect), then we put the Marauder's trigger on the stack. When the Marauder's trigger resolves, you'll have to sacrifice a different creature to the trigger."
  },
  {
    "imgs": [
      "Capricious Hellraiser"
    ],
    "q": "What happens if I only have two cards in my graveyard when <span class=\"autocard\">Capricious Hellraiser</span> enters the battlefield?",
    "a": "Better odds for you. If you don't have three cards in your graveyard when the Hellraiser's triggered ability resolves, you'll do as much as possible and you'll exile all of the cards in your graveyard. Then you'll choose a noncreature nonland card among those two exiled cards and you can cast a copy of it. Only having two cards in your graveyard means you have a better chance of casting a copy of the spell you want."
  },
  {
    "imgs": [
      "Armored Scrapgorger"
    ],
    "q": "All graveyards are empty, and I tap and attack with an <span class=\"autocard\">Armored Scrapgorger</span>. Do I still get to put an oil counter on the Scrapgorger?",
    "a": "You do not get an oil counter. The Scrapgorger's ability targets a card in the graveyard. If there aren't any cards in the graveyards, there's no legal target for the trigger, so it's removed from the stack and will not resolve. The Scrapgorger will not get an oil counter."
  },
  {
    "imgs": [
      "White Sun's Twilight"
    ],
    "q": "If I cast <span class=\"autocard\">White Sun's Twilight</span> with X=5, whose creatures are destroyed?",
    "a": "All creatures will be destroyed (except the tokens created by the resolving Twilight). So not only will your opponent's creatures end up destroyed, but your other creatures will also be destroyed by the Twilight."
  },
  {
    "imgs": [
      "Thrun, Breaker of Silence",
      "Assassin's Trophy"
    ],
    "q": "Can my opponent target and destroy my <span class=\"autocard\">Thrun, Breaker of Silence</span> with an <span class=\"autocard\">Assassin's Trophy</span>?",
    "a": "Yep, they can do that. Assassin's Trophy is a green and black spell. Since it's green, it can't be a nongreen spell (even though it's also a black spell), it can target and destroy Thrun. But your opponent should keep in mind that Thrun is indestructible on your turn, so they shouldn't try to cast Assassin's Trophy on your turn if they want Thrun to die."
  },
  {
    "imgs": [
      "Graaz, Unstoppable Juggernaut",
      "Ovinize"
    ],
    "q": "I have a <span class=\"autocard\">Graaz, Unstoppable Juggernaut</span> and some other creatures in play. My opponent casts <span class=\"autocard\">Ovinize</span> targeting Graaz. What happens to my other creatures?",
    "a": "Surprisingly, they're still 5/3 Juggernauts, and this comes down to everyone's favorite Magic rules topic, layers! \nWe have a rule that says if an effect begins to apply in one layer, it will continue to apply in later layers, even if its source loses the ability in a later layer. The last ability of Graaz affects the subtypes of your creatures and it affects their power and toughness, so the ability applies in layer 4 and in layer 7. The removing abilities part of Ovinize applies in layer 6. Since Graaz's ability starts to apply in layer 4, it will continue to apply in layer 7, even though it loses its abilities in layer 6, so your other creatures will still be 5/3 Juggernauts. However, since Graaz lost its other abilities, they will not be forced to attack, and they can be blocked by Walls."
  },
  {
    "imgs": [
      "Nahiri, the Unforgiving"
    ],
    "q": "If I activate <span class=\"autocard\">Nahiri, the Unforgiving</span>'s first +1 targeting an opponent's creature in a multiplayer game, do I also get to choose which player that creature attacks?",
    "a": "Nope, you don't get to make that choice. Nahiri just says the creature has to attack a player if able. You don't get to choose which player that creature attacks, so that'll be the controller of the creature that decides who the creature attacks (and it may be you!)"
  },
  {
    "imgs": [
      "Synthesis Pod"
    ],
    "q": "Can I activate the ability of <span class=\"autocard\">Synthesis Pod</span> and exile a card from my graveyard to activate the ability?",
    "a": "No you cannot. The ability requires a spell you control, and \"spells\" only exist on the stack, not in your graveyard or any other zone. If you want to activate the Pod's ability, you need to exile a spell you control that's currently on the stack (and has not resolved yet) to the Pod's ability."
  },
  {
    "imgs": [
      "Synthesis Pod",
      "Bring the Ending"
    ],
    "q": "Could my opponent respond to <span class=\"autocard\">Synthesis Pod</span>'s ability by countering the spell I want to exile with <span class=\"autocard\">Bring the Ending</span>?",
    "a": "Nope. You exile the spell as part of the cost of activating the Pod's ability. Since the spell is exiled as a cost, by the time your opponent gets priority, the spell has already been exiled and they can't try to counter the spell before it's exiled to the Pod."
  },
  {
    "imgs": [
      "Phyrexian Obliterator"
    ],
    "q": "Can I use the <i>New Phyrexia</i> version of <span class=\"autocard\">Phyrexian Obliterator</span> in a Standard tournament?",
    "a": "Sure. As of the set's release, Phyrexian Obliterator will be legal in Standard, and you can use any version of the card. If you have a few older copies from <i>New Phyrexia</i> (or <i>Masters 25</i>), feel free to use those in your next Standard tournament instead of using the version from <i>Phyrexia: All Will Be One</i>."
  },
  {
    "imgs": [],
    "q": "I heard something about how cards from <i>Phyrexia: All Will Be One</i> will be legal earlier than other sets. Is that true?",
    "a": "Yep, it's true. It used to be that the prerelease happened, but then those cards wouldn't be legal in constructed formats until the following Friday, when the set was officially released. But per <a href=\"https://wpn.wizards.com/en/news/format-legality-shifts-prerelease-one\">a recent WPN announcement</a>, that's changing. Now, the cards will be legal as of the prerelease, so those cards you opened at the prerelease last weekend can be played now, instead of having to wait until this upcoming Friday."
  }
]