[
  {
    "imgs": [
      "murder",
      "Archfiend of the Dross"
    ],
    "q": "If I <span class=\"autocard\">murder</span> my opponent's <span class=\"autocard\">Archfiend of the Dross</span> while the Archfiend's upkeep trigger is on the stack, does my opponent lose the game when that trigger resolves?",
    "a": "If the Archfiend has one or more oil counters when it died, then no, the game will use last known information to determine how many counters it had."
  },
  {
    "imgs": [
      "Bilious Skulldweller",
      "Aspirant's Ascent"
    ],
    "q": "My 3/3 Phyrexian Beast token just got blocked by my opponent's <span class=\"autocard\">Bilious Skulldweller</span>. If I target my token with <span class=\"autocard\">Aspirant's Ascent</span>, can I make it unblocked so it doesn't die to deathtouch?",
    "a": "You can not. Once a creature is blocked, giving it flying will not make it suddenly unblocked."
  },
  {
    "imgs": [
      "Conduit of Worlds"
    ],
    "q": "If I just cast <span class=\"autocard\">Conduit of Worlds</span>, can I use its tap ability to cast a creature card from my graveyard?",
    "a": "You can not. Conduit of Worlds sees that you cast it earlier this turn, so you can't use its tap ability to cast a card from your graveyard this turn."
  },
  {
    "imgs": [
      "Drivnod, Carnage Dominus",
      "Disciple of the Vault",
      "Zenith Chronicler",
      "Akki Raider",
      "Carth the Lion",
      "Femeref Enchantress"
    ],
    "q": "I currently control <span class=\"autocard\">Drivnod, Carnage Dominus</span>, <span class=\"autocard\">Disciple of the Vault</span>, and <span class=\"autocard\">Zenith Chronicler</span>. If the Chronicler dies in combat, does the Disciple trigger once or twice?",
    "a": "It triggers twice. Drivnod gains you an extra trigger for abilities that are looking for permanents going to the graveyard, so long as they were also creatures at that time. The same is true for <span class=\"autocard\">Akki Raider</span>, <span class=\"autocard\">Carth the Lion</span>, or <span class=\"autocard\">Femeref Enchantress</span>."
  },
  {
    "imgs": [
      "Juri, Master of the Revue",
      "Drivnod, Carnage Dominus"
    ],
    "q": "I was told <span class=\"autocard\">Juri, Master of the Revue</span> doesn't work with <span class=\"autocard\">Drivnod, Carnage Dominus</span>, is this true?",
    "a": "Juri's second ability does work with Drivnod. You might think Juri's first ability would work based on the last question and answer, but it doesn't. Drivnod is looking for abilities that trigger when a permanent (that either is or happens to be a creature) goes to the graveyard from the battlefield. Juri's first ability doesn't do that, it's looking for when you sacrifice a permanent."
  },
  {
    "imgs": [
      "Asceticism",
      "The Eternal Wanderer"
    ],
    "q": "I currently control no creatures and my opponent controls <span class=\"autocard\">Asceticism</span> and five 3/3 Phyrexian Beast tokens. Can I activate my <span class=\"autocard\">The Eternal Wanderer</span>'s last ability? And if I do, how does it work?",
    "a": "You can! This ability doesn't target, so you can activate it just fine. It will work in the same way as if your opponent did not have Asceticism. You choose one Phyrexian Beast token and the opponent must sacrifice the rest."
  },
  {
    "imgs": [
      "Evolving Adaptive",
      "White Sun's Zenith"
    ],
    "q": "I control <span class=\"autocard\">Evolving Adaptive</span> (it has only one oil counter) and cast <span class=\"autocard\">White Sun's Zenith</span> with X equal to ten. How big will my Adaptive be after all its triggers resolve?",
    "a": "It will be a 2/2 and have only two oil counters. When the Zenith resolves, the Adaptive will trigger ten times. But as each trigger tries to resolve, it will check again to see if Adaptive is smaller than the Cat token that made this trigger. By the time the second trigger tries to resolve, the Adaptive is too big, and the other nine triggers will fail to resolve."
  },
  {
    "imgs": [
      "Jace, the Perfected Mind",
      "Defiler of Dreams"
    ],
    "q": "If I cast <span class=\"autocard\">Jace, the Perfected Mind</span> while I control a <span class=\"autocard\">Defiler of Dreams</span>, can I cast Jace for <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/U.png\" class=\"mana\"> and 2 life, and still have him enter the battlefield with five loyalty counters?",
    "a": "Yes, you can. The compleated ability only looks to see if you paid the Phyrexian mana bubble with life, not if you paid life at all to cast the planeswalker, for it to be reduced in loyalty."
  },
  {
    "imgs": [
      "Koth, Fire of Resistance",
      "Kor Firewalker"
    ],
    "q": "My opponent has <span class=\"autocard\">Koth, Fire of Resistance</span>'s emblem. If he plays a mountain, can he use the emblem to kill my <span class=\"autocard\">Kor Firewalker</span>?",
    "a": "Yes, he can. Emblems do not have a color, so the source is colorless."
  },
  {
    "imgs": [
      "Minor Misstep",
      "Black Sun's Twilight"
    ],
    "q": "Can I use <span class=\"autocard\">Minor Misstep</span> to counter <span class=\"autocard\">Black Sun's Twilight</span> no matter how much mana was paid into X?",
    "a": "X in mana costs of spells on the stack is equal to what was chosen as its value, so only if this spell was cast with a X of zero could you counter it with Minor Misstep."
  },
  {
    "imgs": [
      "Phyrexian Obliterator",
      "Bilious Skulldweller"
    ],
    "q": "If I block <span class=\"autocard\">Phyrexian Obliterator</span> with a <span class=\"autocard\">Bilious Skulldweller</span>, can I sacrifice the Skulldweller to the Obliterator's ability?",
    "a": "You can not. Skulldweller will be in the graveyard before Obliterator's trigger is even put on the stack, let alone resolves."
  },
  {
    "imgs": [
      "Soulless Jailer",
      "Gravecrawler"
    ],
    "q": "Does my <span class=\"autocard\">Soulless Jailer</span> stop my opponent from casting the <span class=\"autocard\">Gravecrawler</span> from their graveyard?",
    "a": "Sadly, it does not stop the Gravecrawler. Part of casting a spell is moving it to the stack. Then, when a permanent spell resolves, it enters the battlefield from the stack."
  },
  {
    "imgs": [
      "Hexplate Wallbreaker"
    ],
    "q": "I have two <span class=\"autocard\">Hexplate Wallbreaker</span>s attached to the same 2/2 Rebel token. If I attack with it during my first attack step, do I gain two more attack steps this turn?",
    "a": "You do get the two extra combat phases. The important note here is, your attacking creatures will only untap during the first declare attackers step, not during the second or third declare attackers steps. So the third combat phase will most likely only be useful to creatures you control with vigilance."
  },
  {
    "imgs": [
      "Torsten Von Ursus",
      "Welcoming Vampire",
      "Tangleweave Armor"
    ],
    "q": "My commander is <span class=\"autocard\">Torsten Von Ursus</span> and I currently control <span class=\"autocard\">Welcoming Vampire</span>. If I cast <span class=\"autocard\">Tangleweave Armor</span>, do I draw a card from the Vampire seeing the Germ token?",
    "a": "You do. The Germ token enters the battlefield as a 0/0 and then gets Tangleweave attached to it, making it a 6/6. Welcoming Vampire only cares that it entered the battlefield small, it makes no difference that the Germ is huge by the time the Vampire's trigger resolves."
  },
  {
    "imgs": [
      "Vishgraz, the Doomhive"
    ],
    "q": "My opponent attacked me with <span class=\"autocard\">Vishgraz, the Doomhive</span> and one Mite token with toxic 1. I block Vishgraz with a 3/3 Beast token and I currently have no poison counters. I think Vishgraz dies and my opponent thinks it lives. Who is right?",
    "a": "Vishgraz will survive this combat. Vishgraz simultaneously takes 3 damage and gets +1/+1 from the Mite giving you a poison counter. State based actions check to find a 4/4 Vishgraz with 3 damage marked on it."
  },
  {
    "imgs": [
      "Thalia, Guardian of Thraben",
      "Wurmquake",
      "Mana Leak"
    ],
    "q": "Does my opponent's <span class=\"autocard\">Thalia, Guardian of Thraben</span> make my <span class=\"autocard\">Wurmquake</span> tokens bigger?",
    "a": "Yes, she does. The Wurmquake will make bigger tokens for similar abilities that increase the cost of the spell. There are other effects that don't work, like <span class=\"autocard\">Mana Leak</span>, as this doesn't increase the cost of the spell."
  },
  {
    "imgs": [
      "Atraxa, Grand Unifier",
      "Phyrexian Rebirth",
      "All Is Dust"
    ],
    "q": "<span class=\"autocard\">Atraxa, Grand Unifier</span> lists eight card types. Most people seem excited by battle, but what I find weird is it doesn't list tribal. Is tribal no longer a card type? Can Atraxa grab both a <span class=\"autocard\">Phyrexian Rebirth</span> and a <span class=\"autocard\">All Is Dust</span>?",
    "a": "Do not fear, tribal is still a card type, and yes, Atraxa can grab both a sorcery and tribal sorcery at the same time. Reminder text (<i>found inside brackets and italicized</i>) is not hard rules text, but gives the most likely scenario. Had Atraxa been in a Commander product, I would assume the reminder text would include tribal, but as Standard will likely not have tribal anytime soon, it was left out of the reminder text."
  },
  {
    "imgs": [
      "Basilica Skullbomb",
      "Bilious Skulldweller",
      "Murder"
    ],
    "q": "I sacrifice my <span class=\"autocard\">Basilica Skullbomb</span> targeting my <span class=\"autocard\">Bilious Skulldweller</span> and my opponent responds by <span class=\"autocard\">Murder</span>ing my Skulldweller. Do I still get to draw a card from the Skullbomb?",
    "a": "You do not. The only target the Skullbomb's ability had is gone, so the ability fails to resolve, no creature gets +2/+2 and flying, and you don't get to draw a card."
  },
  {
    "imgs": [
      "Bladehold War-Whip",
      "Lizard Blades",
      "Astor, Bearer of Blades"
    ],
    "q": "Does <span class=\"autocard\">Bladehold War-Whip</span> make it cheaper for me to equip my <span class=\"autocard\">Lizard Blades</span> to the 2/2 Rebel token I have?",
    "a": "Most of the time, no. Lizard Blades doesn't intrinsically have an equip ability, it has a reconfigure ability, and the War-Whip doesn't reduce the reconfigure cost. However, if you gave Lizard Blades an equip ability, say with <span class=\"autocard\">Astor, Bearer of Blades</span>, then War-Whip could reduce that cost."
  },
  {
    "imgs": [
      "Ezuri, Stalker of Spheres"
    ],
    "q": "If I cast <span class=\"autocard\">Ezuri, Stalker of Spheres</span> and pay for his enter the battlefield trigger, in which order do I draw cards and proliferate twice?",
    "a": "You will complete both proliferates and then draw two cards. Each proliferate happens with no priority passes between players, so there is no time to resolve the draw trigger from the first proliferate without first completing the second proliferate."
  }
]