[
  {
    "imgs": [
      "Archfiend of the Dross"
    ],
    "q": "I attack with <span class=\"autocard\">Archfiend of the Dross</span>. My opponent blocks with two 3/3 flyers. Will my opponent lose any life from their flyers dying?",
    "a": "Yep, they'll lose a total of 4 life. The Archfiend will see the opponent's 3/3s dying at the same time as itself and it will trigger for them. Since two creatures your opponent controlled died, the Archfiend will trigger twice and they'll lose a total of 4 life.<br>"
  },
  {
    "imgs": [
      "Evolving Adaptive",
      "Magmatic Sprinter"
    ],
    "q": "If I have a 2/2 <span class=\"autocard\">Evolving Adaptive</span> and cast <span class=\"autocard\">Magmatic Sprinter</span>, how big can I made the Adaptive?",
    "a": "You can make it into a 5/5. When the Sprinter enters, we have two enter the battlefield triggers that need to go on the stack - the trigger from the Adaptive to put an oil counter on it since the Sprinter has a higher power than the Adaptive, and the trigger from the Sprinter to put two oil counters on a target creature you control. You control both triggers, so you'll choose the order they're put on the stack. You can choose to resolve the Adaptive's trigger first, adding an oil counter to it and making it a 3/3, then resolve the Sprinter's trigger trigger and add two more oil counters to the Adaptive, making the Adaptive into a 5/5.<br>"
  },
  {
    "imgs": [
      "Hulking Metamorph",
      "Cephalopod Sentry"
    ],
    "q": "If I cast <span class=\"autocard\">Hulking Metamorph</span> for its prototype cost and I choose to copy <span class=\"autocard\">Cephalopod Sentry</span>, what's the power and toughness of the Metamorph?",
    "a": "It's a 3/3. Since the Metamorph defines its power and toughness when it copies a creature, the Metamorph Sentry is a 3/3. It won't even copy the ability of the original Sentry that defines its power and toughness, so no matter how many artifacts you control, the copy will always be a 3/3.<br>"
  },
  {
    "imgs": [
      "Unctus's Retrofitter",
      "Prophetic Prism",
      "Blue Sun's Twilight"
    ],
    "q": "I cast <span class=\"autocard\">Unctus's Retrofitter</span>, making my <span class=\"autocard\">Prophetic Prism</span> into a 4/4 creature. On their turn, my opponent casts <span class=\"autocard\">Blue Sun's Twilight</span> and gains control of the Retrofitter. Is my Prism still a creature?",
    "a": "Yep, it's still a creature. The Prism is a creature for as long as the Retrofitter remains on the battlefield, not for as long as you control the Retrofitter. Changing controllers doesn't count as anything entering or leaving the battlefield, so the Prism will still be a 4/4 creature since the Retrofitter hasn't left the battlefield.<br>"
  },
  {
    "imgs": [
      "King Macar, the Gold-Cursed",
      "Assault Suit"
    ],
    "q": "I control a tapped <span class=\"autocard\">King Macar, the Gold-Cursed</span>. I equip him with an <span class=\"autocard\">Assault Suit</span>. If I give control of my King Macar to my opponent on their turn, who will control King Macar's <i>inspired</i> trigger?",
    "a": "Your opponent will control the trigger. We resolve the effects of the triggered ability in the order listed on the card. First, your opponent will gain control of King Macar. Then you untap the creature. Since your opponent controls King Macar when it untaps, your opponent will control its <i>inspired</i> trigger and your opponent will choose a creature to exile, not you.<br>"
  },
  {
    "imgs": [
      "Sun Droplet"
    ],
    "q": "I control a <span class=\"autocard\">Sun Droplet</span> with ten counters on it. Can I choose to remove all ten counters during my upkeep and gain 10 life?",
    "a": "No you may not. When the Droplet's trigger resolves during your upkeep, you can remove a single counter from it to gain 1 life. You can't choose to remove multiple counters with the same trigger. But since it does trigger at the beginning of each upkeep (not just your own upkeep), you can slowly remove the counters and gain 1 life each upkeep. You just can't remove all of the counters at the same time.<br>"
  },
  {
    "imgs": [
      "Anointed Procession",
      "Blot Out the Sky"
    ],
    "q": "I have an <span class=\"autocard\">Anointed Procession</span> in play. If I cast <span class=\"autocard\">Blot Out the Sky</span> with X=7, how many tokens will I end up with?",
    "a": "You get fourteen tokens. When we resolve Blot Out the Sky, we create the tokens first, then we destroy all other noncreature, nonland permanents if X was 6 or greater. The Procession is still on the battlefield when you create the tokens, so instead of creating seven Inklings, you create fourteen Inklings, then the Procession (and all other noncreature nonland permanents) are destroyed.<br>"
  },
  {
    "imgs": [
      "Approach of the Second Sun",
      "God-Eternal Kefnet"
    ],
    "q": "I've already cast one <span class=\"autocard\">Approach of the Second Sun</span> this game. Now I have a <span class=\"autocard\">God-Eternal Kefnet</span> in play, and I draw the Approach on my turn. If I cast the copy with Kefnet's trigger, will I win the game?",
    "a": "You will! The copy is being cast from your hand (since that's where the original card is), and you've already cast one Approach earlier in the game, which means you've fulfilled the victory condition for the Approach. It doesn't matter that the Approach that's currently resolving is a copy of the Approach - since the copy was cast from your hand, it will count and you'll win the game.<br>"
  },
  {
    "imgs": [
      "Kor Firewalker",
      "Stonehewer Giant",
      "Embercleave"
    ],
    "q": "I have a <span class=\"autocard\">Kor Firewalker</span> and a <span class=\"autocard\">Stonehewer Giant</span> in play. If I activate the Giant's ability, can I search for an <span class=\"autocard\">Embercleave</span> and attach it to the Firewalker?",
    "a": "No you may not. One of the benefits of protection is that it can't have permanents of that type attached to it. When you're choosing what creature to attach Embercleave to, the Firewalker isn't a legal choice since it has protection from red, so you'll have to choose a different creature (one without protection, like the Giant) to attach Embercleave to.<br>"
  },
  {
    "imgs": [
      "Storm the Festival",
      "Aether Gust"
    ],
    "q": "I cast <span class=\"autocard\">Storm the Festival</span> for its flashback cost, but my opponent responds with <span class=\"autocard\">Aether Gust</span> targeting it. Where does Storm the Festival end up?",
    "a": "It ends up in exile. If a spell cast via flashback would leave the stack for any reason, it's exiled instead of going anywhere else. While the Gust would try to put your Storm the Festival into your library, the replacement effect from flashback will apply and Storm the Festival ends up in exile, not back in your library.<br>"
  },
  {
    "imgs": [
      "Saryth, the Viper's Fang",
      "Ob Nixilis, the Adversary"
    ],
    "q": "I control <span class=\"autocard\">Saryth, the Viper's Fang</span> and a 1/1 Devil token from <span class=\"autocard\">Ob Nixilis, the Adversary</span>. I tap and attack with my Devil token, and it dies in combat. Will the damage from its dies trigger destroy the damaged creature since it had deathtouch?",
    "a": "Yes it will! Since the Devil token was tapped when it died, it had deathtouch, meaning the damage from its triggered ability is from a source with deathtouch. If you target a creature with the Devil's dies trigger, the damaged creature will be destroyed since it was damaged by a source with deathtouch.<br>"
  },
  {
    "imgs": [
      "Frantic Search",
      "Devastation Tide"
    ],
    "q": "On my opponent's turn, I cast the last card in my hand - <span class=\"autocard\">Frantic Search</span>. The first card I draw off of the Search is <span class=\"autocard\">Devastation Tide</span>. Can I cast the Tide for its miracle cost before I have to discard it?",
    "a": "You won't be able to cast it. While the miracle ability of the Tide will trigger, we have to finish resolving the Search before that miracle trigger can go on the stack. You'll have to discard the Tide before the miracle trigger can go on the stack, and since the Tide is no longer in your hand, you won't be able to cast it when the miracle trigger resolves.<br>"
  },
  {
    "imgs": [
      "Marisi, Breaker of the Coil",
      "Fight Rigging"
    ],
    "q": "My opponent controls a <span class=\"autocard\">Marisi, Breaker of the Coil</span>. I control <span class=\"autocard\">Fight Rigging</span> and a creature with power 6. If I target that creature with the Rigging's ability, will I be able to play the exiled card?",
    "a": "You could play it if it's a land, but you couldn't cast it if it's a spell. Fight Rigging's trigger resolves during the beginning of combat step, and the beginning of combat step is part of the combat phase. Since we're in the combat phase, your opponent's Marisi will stop you from casting spells, and that includes the spell that's exiled to the hideaway trigger. But if the exiled card was a land, you'd be able to play the land, since Marisi doesn't stop you from playing a land, only casting a spell during the combat phase.<br>"
  },
  {
    "imgs": [
      "Questing Beast",
      "Maze of Ith"
    ],
    "q": "I attack with <span class=\"autocard\">Questing Beast</span>, but my opponent uses the ability of <span class=\"autocard\">Maze of Ith</span> on it. What happens?",
    "a": "A waste of a Maze of Ith activation. Maze of Ith doesn't remove the creature from combat, it just prevents all combat damage that would be dealt to it and by it. But one of the Beast's many abilities is that combat damage that would be dealt by creatures you control can't be prevented. Using Maze of Ith on the attacking Questing Beast is pretty pointless, since its damage can't be prevented and it will still deal combat damage like normal.<br>"
  },
  {
    "imgs": [
      "Roar of Resistance"
    ],
    "q": "If I have a <span class=\"autocard\">Roar of Resistance</span> in play and I attack, can I pay <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"> and give my creatures +6/+0 for the turn?",
    "a": "No you cannot. The Roar has a triggered ability, not an activated ability. When the trigger resolves, you can choose to pay <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"> once to pump your creatures. You can't choose to pay more, so you'll only be able to pay once per trigger to give the creatures +2/+0.<br>"
  },
  {
    "imgs": [
      "Go-Shintai of Life's Origin",
      "Kaheera, the Orphanguard"
    ],
    "q": "If the only creature in my deck is <span class=\"autocard\">Go-Shintai of Life's Origin</span>, can I use <span class=\"autocard\">Kaheera, the Orphanguard</span> as my companion?",
    "a": "Nope, Go-Shintai violates Kaheera's companion restriction. All creature cards that are a part of your starting deck have to be a Cat, Elemental, Nightmare, Dinosaur, or Beast. Go-Shintai technically doesn't have a creature type (\"Shrine\" is an enchantment type, not a creature type). Since Go-Shintai doesn't have any of the listed types, it violates the restriction and Kaheera can't be the companion for that deck.<br>"
  },
  {
    "imgs": [
      "Raggadragga, Goreguts Boss",
      "Simian Spirit Guide"
    ],
    "q": "Will <span class=\"autocard\">Raggadragga, Goreguts Boss</span> give +2/+2 to a <span class=\"autocard\">Simian Spirit Guide</span>?",
    "a": "Sure. The Spirit Guide has a mana ability. It can only be activated if the Spirit Guide is in your hand, but it's still a mana ability, so Raggadragga will give the Spirit Guide +2/+2 if it ends up on the battlefield.<br>"
  },
  {
    "imgs": [
      "Karona, False God",
      "Consuming Fervor"
    ],
    "q": "I control a <span class=\"autocard\">Karona, False God</span>. If I enchant it with <span class=\"autocard\">Consuming Fervor</span>, will it ever get a -1/-1 counter from the Fervor?",
    "a": "It will not. The Fervor gives a triggered ability to the creature that triggers at the beginning of its controller's upkeep. But that will never happen with Karona - at the beginning of each opponent's upkeep, they'll gain control of Karona. It will never start the active player's upkeep under their control (barring extra turn effects), so the ability given to it by the Fervor will never trigger and Karona will not get a -1/-1 counter.<br>"
  },
  {
    "imgs": [
      "The First Sliver",
      "Reflex Sliver"
    ],
    "q": "I cast <span class=\"autocard\">The First Sliver</span> from my command zone, and with its cascade trigger, I cast <span class=\"autocard\">Reflex Sliver</span>. Will my Reflex Sliver also cascade because of The First Sliver?",
    "a": "It will not. The First Sliver has to be on the battlefield to give your other sliver spells cascade. In this case, when we're resolving The First Sliver's cascade trigger, The First Sliver is still on the stack, not on the battlefield. The Reflex Sliver will not cascade here, since it doesn't have cascade from The First Sliver.<br>"
  },
  {
    "imgs": [
      "Encroaching Mycosynth",
      "Mairsil, the Pretender"
    ],
    "q": "I have an <span class=\"autocard\">Encroaching Mycosynth</span> in play. I've been using <span class=\"autocard\">Mairsil, the Pretender</span> to exile planeswalker cards from my hand since they are artifacts thanks to the Mycosynth. Can Mairsil activate multiple loyalty abilities each turn?",
    "a": "You cannot - you can only activate one loyalty ability of Mairsil each turn. The restriction on using loyalty abilities is built into the rules for loyalty abilities, not into the rules for planeswalkers. If you exiled multiple planeswalkers with cage counters, Mairsil would have loyalty abilities from all of them, but Mairsil can only activate one loyalty ability per turn, not one loyalty ability for each planeswalker exiled with a cage counter (and also only during one of your main phases when the stack is empty). So while the Mycosynth will let you exile planeswalker cards to Mairsil's enter the battlefield trigger, Mairsil can still only activate one loyalty ability per turn, not one loyalty ability of each planeswalker card exiled with a cage counter on it.<br>"
  }
]