[
  {
    "imgs": [
      "Botanical Brawler",
      "Converter Beast"
    ],
    "q": "If I control <span class=\"autocard\">Botanical Brawler</span> and I <span class=\"autocard\">Converter Beast</span>, does that trigger the Brawler's ability?",
    "a": "Yup! The Incubator token enters with the counters already on it, but a permanent entering with counters also triggers abilities that trigger when counters are put on a permanent. Also note that Botanical Brawler triggers on counters being put on a <i>permanent</i>, rather than a creature, which is important because the Incubator token is not a creature. <br>"
  },
  {
    "imgs": [
      "Converter Beast",
      "Doubling Season"
    ],
    "q": "If I incubate with <span class=\"autocard\">Converter Beast</span> while I control <span class=\"autocard\">Doubling Season</span>, what happens?",
    "a": "Doubling Season's first effect clearly applies to you creating the Incubator tokens, so you create two tokens that each want to enter with five counters on them. For similar reasons as in the previous question, Doubling Season's second ability recognizes that counters are being put on the tokens as they're entering the battlefield, so it doubles the number of counters as well, and you end up with two Incubator tokens that enter with ten +1/+1 counters on them. <br>"
  },
  {
    "imgs": [
      "Elvish Vatkeeper"
    ],
    "q": "Can I target an Incubator token repeatedly with <span class=\"autocard\">Elvish Vatkeeper</span>'s activated ability to repeatedly double the counters on it?",
    "a": "That would be awesome, but unfortunately it doesn't work. Once the Incubator token has transformed, it becomes a Phyrexian token, so it is no longer a legal target for additional activations of Elvish Vatkeeper's ability. If you let the first activation resolve, you can't even activate the ability a second time. If you hold priority between activations and activate the ability twice, the second ability fails to resolve because its only target has become illegal.<br>"
  },
  {
    "imgs": [
      "Halsin, Emerald Archdruid",
      "Corruption of Towashi"
    ],
    "q": "If I use <span class=\"autocard\">Halsin, Emerald Archdruid</span>'s ability to turn an Incubator token into a Bear, does that trigger <span class=\"autocard\">Corruption of Towashi</span>'s second ability?",
    "a": "No. To \"transform\" means that a double-faced permanent turns from front-face-up to back-face-up or vice versa. Halsin's ability changes the characteristics of the Incubator token into the characteristics of a creature — an artifact creature with subtypes Incubator and Bear to be precise — but the token is still front-face-up, so it has not actually transformed in the sense that matters to Corruption of Towashi. <br>"
  },
  {
    "imgs": [
      "Brimaz, Blight of Oreskos"
    ],
    "q": "If I control <span class=\"autocard\">Brimaz, Blight of Oreskos</span> and multiple Phyrexians died during my turn, do I get to proliferate that many times with Brimaz's end step trigger?",
    "a": "No, Brimaz's ability only triggers once at the beginning of the end step, and it checks whether some number of Phyrexians have died this turn, which is a yes-or-no question. Two or more Phyrexians dying doesn't change the answer to \"more yes\", so you still only proliferate once. <br>"
  },
  {
    "imgs": [
      "Promise of Loyalty",
      "Argothian Enchantress"
    ],
    "q": "Can <span class=\"autocard\">Promise of Loyalty</span> put a vow counter on a <span class=\"autocard\">Argothian Enchantress</span>?",
    "a": "Sure. Since its rules text doesn't use the word \"target\", Promise of Loyalty doesn't target anything, let alone the creatures that have vow counters put on them, so having shroud doesn't stop a creature from being affected by Promise of Loyalty. <br>"
  },
  {
    "imgs": [
      "Rankle and Torbran"
    ],
    "q": "Does the last mode of <span class=\"autocard\">Rankle and Torbran</span>'s ability affect the damage that Rankle and Torbran is dealing itself?",
    "a": "No, that would require unsafe amounts of time travel. The ability is triggered by R&amp;T dealing damage, and replacement effects can only change events that happen after the replacement effect has been created, so it won't retroactively change the damage that R&amp;T dealt. However, since R&amp;T has first strike, there will be a second combat damage step in which creatures without first strike and creatures with double strike deal their combat damage. The replacement effect from R&amp;T's last mode will happily apply to the damage that's dealt in that step. <br>"
  },
  {
    "imgs": [
      "Gimbal, Gremlin Prodigy",
      "Elemental Bond"
    ],
    "q": "I control <span class=\"autocard\">Gimbal, Gremlin Prodigy</span> and <span class=\"autocard\">Elemental Bond</span> as well as five artifacts with different names. When Gimbal's ability makes the Gremlin token at the end of the turn, does that trigger Elemental Bond?",
    "a": "It does not. Gimbal's ability creates the token as a 0/0 creature, and then it puts some number of +1/+1 counters on it in a separate event. At the moment it entered the battlefield, the Gremlin token's power was 0, so it wasn't big enough to trigger Elemental Bond's ability. <br>"
  },
  {
    "imgs": [
      "Phyrexian Rebirth",
      "Regenerate"
    ],
    "q": "If I cast <span class=\"autocard\">Phyrexian Rebirth</span> and my opponent <span class=\"autocard\">Regenerate</span> one of their creatures, does that creature still count towards the X for Phyrexian Rebirth?",
    "a": "No. A creature that regenerates has its destruction replaced by an entirely different event that does not cause the creature to be destroyed. Since the creature wasn't destroyed at all, it was not destroyed \"this way\", so it doesn't count towards X. <br>"
  },
  {
    "imgs": [
      "Crashing Footfalls",
      "Halo Forager"
    ],
    "q": "Can I cast <span class=\"autocard\">Crashing Footfalls</span> off of <span class=\"autocard\">Halo Forager</span>'s enter-the-battlefield ability? The release notes say that the reflexive trigger triggers if I pay mana, which implies that it doesn't work if X is 0.",
    "a": "Yes, it still works when X is 0. The release notes offer additional explanations on how cards work, but sometimes the wording is more aimed at being understandable in most situations than at being precisely correct in all sitatuations. During the resolution of Halo Forager's ability, you choose an X, and then you choose whether to pay <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\">. Paying that cost triggers the reflexive trigger that lets you target a card in a graveyard and cast it. If X is 0, the cost becomes <img src=\"/ci-reader/images/symbols/0.png\" class=\"mana\">, which is a cost that you pay simply by acknowledging that you're paying it.<br>"
  },
  {
    "imgs": [
      "Halo Forager",
      "Village Rites"
    ],
    "q": "I just cast <span class=\"autocard\">Halo Forager</span> and its enter-the-battlefield ability is on the stack, and I have <span class=\"autocard\">Village Rites</span> in my hand. Can I cast Village Rites in response to Halo Forager's ability, sacrificing the Halo Forager, and then cast Village Rites again from my graveyard using Halo Forager's ability?",
    "a": "Yes, that's perfectly legal. The reason for this is that Halo Forager's enter-the-battlefield ability itself does not require a target. The ability goes on the stack without a target, and you respond to it with the Village Rites from your hand. Sacrificing Halo Forager does not counter its ability, so the ability still resolves. When it resolves, you choose X=1 and pay <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\">, which triggers the reflexive trigger. At that time, Village Rites is in your graveyard, so you can target it with the reflexive trigger. <br>"
  },
  {
    "imgs": [
      "Archon of Cruelty",
      "Surge of Salvation"
    ],
    "q": "My opponent targets me with <span class=\"autocard\">Archon of Cruelty</span>'s ability, and I respond with <span class=\"autocard\">Surge of Salvation</span>. Does my opponent still draw a card and gain life from Archon's ability?",
    "a": "Nope. You were the only target of the ability and you have become an illegal target, so the ability doesn't resolve and none of its effects happen. <br>"
  },
  {
    "imgs": [
      "Blast-Furnace Hellkite",
      "Invasion of Tarkir"
    ],
    "q": "I control <span class=\"autocard\">Blast-Furnace Hellkite</span> and I attack a <span class=\"autocard\">Invasion of Tarkir</span>. Do the creatures attacking the battle have double strike?",
    "a": "No. The battle is being protected by your opponent, but the battle is not your opponent. Blast-Furnace Hellkite's effect only applies to creatures that are attacking your opponent. It does not apply to creatures that attack a planeswalker or a battle. <br>"
  },
  {
    "imgs": [
      "Nezumi Freewheeler",
      "Murder",
      "Hideous Fleshwheeler"
    ],
    "q": "My opponent just paid the cost to transform their <span class=\"autocard\">Nezumi Freewheeler</span>. Can I <span class=\"autocard\">Murder</span> it in response to stop the triggered ability from <span class=\"autocard\">Hideous Fleshwheeler</span>?",
    "a": "Absolutely. Nezumi Freewheeler doesn't transform immediately. It only transforms when its activated ability resolves. If you Murder it in response to the ability, there's nothing there to transform when the ability resolves, and the triggered ability of the back face doesn't get the chance to trigger. <br>"
  },
  {
    "imgs": [
      "Quintorius, Loremaster",
      "Portal to Phyrexia"
    ],
    "q": "If <span class=\"autocard\">Quintorius, Loremaster</span> has exiled <span class=\"autocard\">Portal to Phyrexia</span>, can I use Quintorius's ability to cast the Portal on my opponent's turn?",
    "a": "No. Quintorius's ability specifies a duration of <i>this turn</i>, which means that it's creating a continuous effect that allows you to cast the card from an unusual place, but that permission does not allow you to cast it at an unusual time. You still have to follow the normal timing rules for the spell, and since Portal to Phyrexia is an artifact, you can only cast it during your own turn. <br>"
  },
  {
    "imgs": [
      "Hoarding Broodlord",
      "Abandon Reason"
    ],
    "q": "Does <span class=\"autocard\">Hoarding Broodlord</span>'s convoke effect apply to <span class=\"autocard\">Abandon Reason</span> spells?",
    "a": "Absolutely. You discard the madness card into exile, and then you get to cast it from exile for its madness cost. Since you are casting it from exile, Hoarding Broodlord gives it convoke. Also, since convoke just gives you another method for paying the spell's total cost, it applies when you're casting the spell for an alternative cost such as its madness cost. <br>"
  },
  {
    "imgs": [
      "Scrollshift",
      "Belenon War Anthem",
      "Invasion of Belenon"
    ],
    "q": "If I <span class=\"autocard\">Scrollshift</span> a <span class=\"autocard\">Belenon War Anthem</span>, does it come back as Belenon War Anthem or as <span class=\"autocard\">Invasion of Belenon</span>?",
    "a": "By default a permanent enters with its front face up, and since Scrollshift doesn't specify otherwise, Belenon War Anthem comes back with its front face up, as Invasion of Belenon. <br>"
  },
  {
    "imgs": [
      "Creeping Tar Pit",
      "Goro-Goro and Satoru"
    ],
    "q": "My opponent played <span class=\"autocard\">Creeping Tar Pit</span> on their last turn and they control <span class=\"autocard\">Goro-Goro and Satoru</span>. On their current turn, they've animated Creeping Tar Pit and they're attacking me with it. They claim that it'll trigger Goro-Goro and Satoru's ability if it deals damage to me. Is that right?",
    "a": "Not even a little bit. While it's true that Creeping Tar Pit became a creature this turn, Goro-Goro and Satoru are only interested in creatures that entered the battlefield this turn. Creeping Tar Pit was already on the battlefield when this turn began, so it didn't enter the battlefield this turn, so it can't trigger Goro-Goro and Satoru's ability. <br>"
  },
  {
    "imgs": [
      "Wrenn and Realmbreaker",
      "Blood Moon"
    ],
    "q": "I control <span class=\"autocard\">Wrenn and Realmbreaker</span>, and there's also a <span class=\"autocard\">Blood Moon</span> on the battlefield. Do my nonbasic lands still tap for mana of any color?",
    "a": "They sure do, thanks to <a href=\"ooo\">layers</a>! Blood Moon's effect is applied in layer 4, where it makes nonbasic lands into Mountains, which has the side effect of removing all abilities that the lands might have and giving them the intrinsic ability to make red mana. Later, in layer 6, Wrenn and Realmbreaker's effect gives your lands the ability to tap for mana of any color, so they end up having that ability. <br>"
  },
  {
    "imgs": [
      "Teferi Akosa of Zhalfir"
    ],
    "q": "Can I have multiple emblems from <span class=\"autocard\">Teferi Akosa of Zhalfir</span>'s -2 ability?",
    "a": "Absolutely. There is no limit to how many emblems you can get, and the effects from Teferi's emblem are cumulative. For each emblem you control, your Knights get +1/+0 and a separate instance of ward <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\">. <br>"
  }
]