[
  {
    "imgs": [
      "Everybody Lives!"
    ],
    "q": "Can Everybody Lives! prevent me from losing the game due to having 10 or more poison counters?",
    "a": "I'm afraid so. Curse of Clinging Webs has a perfectly normal triggered ability, which means it uses the stack and your opponent can respond to it. As long as they have the necessary mana to activate Reassembling Skeleton's ability, they can do so in response to the Curse's trigger. The Skeleton's ability resolves first and returns it to the battlefield, and then the Curse's ability won't exile the Skeleton because it only looks for the card in the graveyard. You'll still make a Spider token, though, since that part of the ability is not dependent on having exiled the Skeleton."
  },
  {
    "imgs": [
      "Gallifrey Falls // No More"
    ],
    "q": "I don't understand how Gallifrey Falls // No More works. If I cast it fused, won't my creatures die before they phase out?",
    "a": "Absolutely. The attacking player chooses the damage assignment order for the two blockers, but since Mire Triton has deathtouch, the order doesn't matter a whole lot. The attacking player has to assign lethal damage to the first blocker in order before they can assign any damage to the second blocker, but thanks to deathtouch, just 1 damage is considered lethal. Even if they choose to put the 2/2 first in the damage assignment order, they can assign 1 damage to it and 1 damage to the 1/1, resulting in both blockers being destroyed."
  },
  {
    "imgs": [
      "The Ninth Doctor"
    ],
    "q": "When does The Ninth Doctor's trigger go on the stack?",
    "a": "Most likely yes. Extinguish All Hope destroys all creatures that aren't enchantments. Your creature is <i>enchanted</i>, but unless the creature itself also has the word \"enchantment\" in its type line, like <a href=\"http"
  },
  {
    "imgs": [
      "Return the Past",
      "Karvanista, Loyal Lupari // Lupari Shield"
    ],
    "q": "Will Return the Past let me cast an adventure spell from my graveyard like Lupari Shield from my graveyard?",
    "a": "Nope. Wastes are basic lands, but Wastes is not a land type. Myriad Landscape doesn't care if the two lands have the same name, it checks whether the two lands have a land type in common. Wastes have no land types at all, so they can't have a land type in common with each other or with any other land. Note that a single Wastes doesn't even share a land type with itself, so Myriad Landscape can't even get a single Wastes."
  },
  {
    "imgs": [
      "Alistair, the Brigadier"
    ],
    "q": "I control Alistair, the Brigadier, four lands, and four Treasures. When I attack with Alistair, if I sacrifice those Treasures to pay for his triggered ability, will those Treasures count for the bonus that Alistair gives my creatures?",
    "a": "Certainly, provided that the Sliver whose ability you're activating doesn't have summoning sickness. Crypt Sliver gives an activated ability to all Slivers, and the cost to activate that ability is <img src=\"/ci-reader/images/symbols/T.png\" class=\"mana\">, so it's subject to the summoning sickness rule. As long as you've controlled the Sliver you're tapping since your most recent turn began, you can activate this ability, since activated abilities follow the same timing rules as instants."
  },
  {
    "imgs": [
      "RMS Titanic",
      "Assault Suit"
    ],
    "q": "If I crew RMS Titanic and equip it with Assault Suit, what happens if it deals combat damage to a player?",
    "a": "Yup! Regenerating a creature doesn't prevent damage to it or remove it from combat right away. By regenerating your Spiteful Sliver you're simply setting up a replacement effect that will watch and wait for something to happen that would destroy Spiteful Sliver. The game proceeds as usual to the combat damage step where your Spiteful Sliver deals 2 damage to your opponent's 4/4, and your opponent's 4/4 thoroughly beats up your Sliver to the tune of 4 damage. After the damage is dealt, state-based actions take a look, notice that your Sliver has lethal damage marked on it, and attempt to destroy it. This is where the regeneration shield kicks in, and instead of getting destroyed your Sliver is removed from combat and the damage that's marked on it is removed. (It also gets tapped, but it's already tapped, so it doesn't care.) Then, triggered abilities go on the stack, and since Spiteful Sliver <i>was</i> in fact dealt 4 damage, its ability did indeed trigger and goes on the stack."
  },
  {
    "imgs": [
      "Blink"
    ],
    "q": "How exactly does Blink work?",
    "a": "No. You have to apply Spark Double's replacement effect as it's entering the battlefield. Since this effect changes how Spark Double enters the battlefield, it gets applied before Spark Double is on the battlefield. This means that you have to choose something that's already on the battlefield before Spark Double enters the battlefield itself. Since there's nothing to choose, you can't apply the replacement effect, so Spark Double just enters as a 0/0 and dies immediately."
  },
  {
    "imgs": [
      "Weeping Angel",
      "Thijarian Witness"
    ],
    "q": "I attack my opponent with Weeping Angel. After attackers are declared, my opponent casts Thijarian Witness. What happens to my Angel?",
    "a": "Yes to the Endless One, no to the Chalice. Zhulodok's ability looks at the mana value of the spell you're casting, which depends on the mana cost in the top-right corner of the card. The <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> in Endless One's mana cost counts as the value that was chosen for X, so your Endless One has a mana value of 8. On the other hand, Everflowing Chalice's mana cost is <img src=\"/ci-reader/images/symbols/0.png\" class=\"mana\">, so its mana value is always 0 regardless of how often you kick it."
  },
  {
    "imgs": [
      "Amy Pond",
      "Rory Williams"
    ],
    "q": "Since Amy Pond has both Partner With Rory Williams and Doctor's Companion, does that mean I'm allowed to have three commanders?",
    "a": "Not exactly, but partially kind of yes. Zhulodok gives your spell two instances of cascade, which will both trigger and go on the stack as separate abilities. Abstruse Archaic's ability can target one of those two cascade abilities that are on the stack, so you can copy one of them to get a third instance of the cascade ability."
  },
  {
    "imgs": [
      "The War Doctor",
      "Ryan Sinclair"
    ],
    "q": "I have The War Doctor in play. I attack with Ryan Sinclair, and I exile four lands and a nonland card to his trigger. How many counters does The War Doctor get?",
    "a": "You choose! Casting Artisan of Kozilek triggers three separate abilities that all want to go on the stack at the same time. You control all three abilities, so you choose the order in which the three abilities go on the stack."
  },
  {
    "imgs": [
      "Auton Soldier",
      "Clara Oswald",
      "The Seventh Doctor"
    ],
    "q": "I have an Auton Soldier in play that's a copy of an opponent's Clara Oswald. If I attack with the copy Clara Oswald and The Seventh Doctor, do I get the myriad tokens in time to give me more Seventh Doctor triggers?",
    "a": "No. Spark Double only copies the copiable characteristics of your commander. The ability that's granted to it by Agent of the Shadow Thieves is not copied, and \"commanderness\" isn't copied either, so the copy of your commander won't be granted the ability by Agent of the Shadow Thieves in its own right."
  },
  {
    "imgs": [
      "Clara Oswald",
      "The Sixth Doctor"
    ],
    "q": "If I have Clara Oswald in play, will that let The Sixth Doctor's ability trigger twice when I cast a historic spell?",
    "a": "Unlike most other modifications, mutations do become part of the creature's copiable characteristics, so your Spark Double will be a copy of Everquill Phoenix that also has Krenko's Goblin-making ability. It'll also have a +1/+1 counter, of course, but that's probably not the part of this interaction that you were wondering about."
  },
  {
    "imgs": [
      "Atraxi Warden",
      "Cyber Conversion"
    ],
    "q": "I attack my opponent with Atraxi Warden. In response, my opponent casts Cyber Conversion targeting my Warden. What happens to my Warden? Is it still attacking?",
    "a": "Yup, it triggers 21 times! Each individual card draw by each of your opponents triggers Nekusar's ability, so you'll get 21 separate Nekusar triggers that will each deal 1 damage to one of your opponents in packets of 1 damage at a time. This in turn causes Ob Nixilis's ability to trigger 21 separate times."
  },
  {
    "imgs": [
      "Cybership",
      "Krosan Colossus"
    ],
    "q": "I attacked my opponent with a Cybership, and one of the creatures I put onto the battlefield face down is a creature with morph - a Krosan Colossus. Can I turn it face-up?",
    "a": "The Saga has a replacement effect that wants to make it enter the battlefield with one counter. After your opponent applies this replacement effect, two more replacement effects point out that they would like to change this event further. Vorinclex's effect wants to halve the number of counters, and Doubling Season wants to double it. Since these effects want to change how your opponent's permanent is being affected by this event, your opponent chooses which one to apply first. If they choose Vorinclex's effect, \"one lore counter\" becomes \"no lore counters\" because Vorinclex's effect rounds down, and suddenly Doubling Season's effect is no longer applicable, and the modified event happens and the Saga enters without a lore counter. If your opponent chooses Doubling Season's effect first, \"one lore counter\" becomes \"two lore counters\", and then Vorinclex's effect applies and changes it back to \"one lore counter,\" and the Saga enters with one lore counter."
  },
  {
    "imgs": [
      "Dan Lewis",
      "Hijack",
      "Sol Ring"
    ],
    "q": "I have a Dan Lewis in play. I cast Hijack on my opponent's Sol Ring, then use the equip ability from Dan Lewis to attach the Sol Ring to a creature I control. What happens when the turn ends?",
    "a": "It works like any other effect that grants extra turns"
  },
  {
    "imgs": [
      "Ancestral Vision",
      "The Eleventh Doctor",
      "Wibbly-wobbly, Timey-wimey"
    ],
    "q": "Last week, you wrote about how exiling Ancestral Vision to The Eleventh Doctor won't let you cast it. But since the Vision is in exile, could I cast Wibbly-wobbly, Timey-wimey to time travel and add a time counter to it, letting me cast it on my next turn?",
    "a": "I'm afraid so. Frantic Search resolves and you do as much of it as you can. The card draw is impossible, so you ignore it, but discarding cards is not contingent on you having drawn cards, so you still have to discard two cards."
  },
  {
    "imgs": [
      "The Master, Multiplied",
      "Dreadfeast Demon"
    ],
    "q": "The only creatures I control are token copies of The Master, Multiplied and a Dreadfeast Demon. During my end step, do I just get a free Dreadfeast Demon token?",
    "a": "Your Slivers will have to fight. Ezuri's Predation creates one 4/4 Phyrexian Beast token for each of your Slivers, and each of those tokens will fight a different one of your Slivers. The ability does not target, which you can tell from the fact that it doesn't use the word \"target,\" so the fact that your Slivers have hexproof does not stop the fight from happening."
  },
  {
    "imgs": [
      "The Twelfth Doctor",
      "Vislor Turlough"
    ],
    "q": "My commanders are The Twelfth Doctor and Vislor Turlough. If I demonstrate Vislor Turlough, do I get the chance to give the token copy of Vislor to an opponent before the original enters the battlefield?",
    "a": "The game will end in a draw. During the resolution of Commodore Guff's ability, you attempt to draw from an empty library and your opponents get dealt damage that reduces their life totals to 0 or less. After the ability is done resolving, state-based actions are checked and applied simultaneously. Because of what happened during the resolution, you and your opponents all lose the game at the same time, which means that the game ends in a draw."
  },
  {
    "imgs": [
      "Start the TARDIS"
    ],
    "q": "What happens if I cast Start the TARDIS but we're not playing planechase?",
    "a": "Nope, that's a part of the Enchanting Tales, a bonus card found in each pack of <i>Wilds of Eldraine</i>. It's similar to the old-frame artifacts in <i>The Brothers' War</i> or the Multiverse Legends found in packs of <i>March of the Machine</i>. They have unique art and have the expansion code \"WOT\" (as opposed to \"WOE\" for cards in the main set), and they have a different expansion symbol as well. Land Tax isn't a card printed in a Standard-legal set, but you could play it in Vintage, Legacy, or Commander, and if you managed to open it in your Sealed deck or drafted it in a Draft, you could play it there as well."
  },
  {
    "imgs": [
      "River Song",
      "The Stone Brain"
    ],
    "q": "I control River Song. If I search my opponent's library with The Stone Brain, will River Song's last ability trigger?",
    "a": "Nope, not this year. In case you missed the announcement last May, they announced that they're changing how Standard rotates. For much of Standard's history, it's consisted of the last two years of set releases, but now that's expanding to the last three years worth of sets. That means that we won't be getting a normal rotation this fall, so when <i>Wilds of Eldraine</i> becomes Constructed legal, nothing will rotate out of Standard. Next year, in the fall of 2024, we'll rotate Standard like we did in the past, but you'll have an extra year with cards from <i>Innistrad"
  },
  {
    "imgs": [
      "Carpet of Flowers"
    ],
    "q": "If I cast Carpet of Flowers during my first main phase, can I get mana from it during my second main phase?",
    "a": "You can! Carpet of Flowers will trigger during each of your main phases until you've added mana with its ability that turn. If you play it during your first main phase, when you get to your second main phase, because the Carpet hasn't added mana that turn, the Carpet will trigger and you can get mana from its triggered ability."
  },
  {
    "imgs": [
      "Aquatic Alchemist // Bubble Up"
    ],
    "q": "I know you've told this tale before, but can you go over how Adventure cards work?"
  },
  {
    "imgs": [
      "Decadent Dragon // Expensive Taste"
    ],
    "q": "Could I play a Decadent Dragon in my mono-red Commander deck?"
  },
  {
    "imgs": [
      "Embereth Veteran"
    ],
    "q": "What is a Role token?"
  },
  {
    "imgs": [
      "Faunsbane Troll",
      "Twisted Fealty"
    ],
    "q": "Can I just pile up a bunch of Role tokens on one creature? For example, if my Faunsbane Troll has the Monstrous Role token attached to it, and I cast Twisted Fealty and give the Troll the Wicked Role token, will it benefit from both Role tokens?"
  },
  {
    "imgs": [],
    "q": "Does that mean if my opponent puts the Cursed Role token on one of my creatures, I can get rid of it by putting another Role on it?"
  },
  {
    "imgs": [
      "Ashiok's Reaper"
    ],
    "q": "Will a Role token going to the graveyard trigger my Ashiok's Reaper?"
  },
  {
    "imgs": [
      "Rowan, Scion of War"
    ],
    "q": "I activate Rowan, Scion of War's ability after I've lost 3 life. After the ability has resolved, I lose 2 more life. Does that increase the discount of my black and red spells to , or is it stuck at ?"
  },
  {
    "imgs": [
      "Will, Scion of Peace",
      "Intruder Alarm"
    ],
    "q": "I control Will, Scion of Peace, and I've gained 2 life this turn. I activate Will's ability, then cast a creature, which causes Intruder Alarm to trigger and untap Will. If I activate Will's ability again, are my white and/or blue spells discounted by  or ?"
  },
  {
    "imgs": [
      "Three Blind Mice"
    ],
    "q": "If I made a token copy of Three Blind Mice, could it copy itself with its own chapter II or III trigger?"
  },
  {
    "imgs": [
      "Ingenious Prodigy"
    ],
    "q": "My Ingenious Prodigy has five +1/+1 counters on. Can I remove all five counters from it during my upkeep and draw five cards?"
  },
  {
    "imgs": [
      "The Irencrag"
    ],
    "q": "When I turn The Irencrag into Everflame, Heroes' Legacy with its triggered ability, does equipping it to a creature mean that the equipped creature loses all abilities?"
  },
  {
    "imgs": [
      "Lich-Knights' Conquest"
    ],
    "q": "When I resolve Lich-Knights' Conquest, could I sacrifice my artifact creatures and enchantment creatures and return them to the battlefield?"
  },
  {
    "imgs": [
      "Discerning Financier"
    ],
    "q": "I control a Discerning Financier and a Treasure token. Can I activate the Financier's ability, then sacrifice the Treasure token in response and still draw a card?"
  },
  {
    "imgs": [
      "Discerning Financier"
    ],
    "q": "If I was in a game of Two-Headed Giant, could I give my Treasure to my teammate with Discerning Financier and still draw a card?"
  },
  {
    "imgs": [
      "Panharmonicon",
      "Talion, the Kindly Lord"
    ],
    "q": "If I have a Panharmonicon in play, will that let me choose two numbers when Talion, the Kindly Lord enters the battlefield?"
  },
  {
    "imgs": [
      "Nyxborn Courser",
      "A Tale for the Ages"
    ],
    "q": "Does my Nyxborn Courser count as an \"enchanted creature\" and get +2/+2 from A Tale for the Ages?"
  },
  {
    "imgs": [
      "Agatha's Soul Cauldron",
      "Grist, the Hunger Tide"
    ],
    "q": "If I activate Agatha's Soul Cauldron exiling Grist, the Hunger Tide, will my creatures with +1/+1 counters on them have Grist's loyalty abilities?"
  },
  {
    "imgs": [
      "Kellan, the Fae-Blooded // Birthright Boon",
      "Kellan, the Fae-Blooded // Birthright Boon"
    ],
    "q": "My commander is Kellan, the Fae-Blooded. Can I dodge the commander tax by casting Birthright Boon from the command zone and ignoring the commander tax?"
  },
  {
    "imgs": [
      "Land Tax"
    ],
    "q": "I just opened a Land Tax in my Wilds of Eldraine booster pack. Can I play it in Standard?"
  },
  {
    "imgs": [],
    "q": "So once Wilds of Eldraine is Standard-legal, that means Standard rotates and I won't be able to play my cards from Innistrad: Midnight Hunt and Streets of New Capenna anymore, right?"
  },
  {
    "imgs": [
      "Curse of Clinging Webs",
      "Reassembling Skeleton"
    ],
    "q": "I've enchanted my opponent with Curse of Clinging Webs and their Reassembling Skeleton just died. Can they reanimate it before it gets exiled?"
  },
  {
    "imgs": [
      "Mire Triton"
    ],
    "q": "If Mire Triton gets blocked by both a 1/1 and a 2/2 creature, can it kill both of them?"
  },
  {
    "imgs": [
      "Extinguish All Hope"
    ],
    "q": "If I have a creature that's enchanted with an Aura, will it get destroyed by Extinguish All Hope?"
  },
  {
    "imgs": [
      "Myriad Landscape",
      "Wastes"
    ],
    "q": "Can Myriad Landscape get two Wastes?"
  },
  {
    "imgs": [
      "Crypt Sliver"
    ],
    "q": "Can I activate Crypt Sliver's ability on my opponent's turn?"
  },
  {
    "imgs": [
      "Spiteful Sliver",
      "Crypt Sliver"
    ],
    "q": "My opponent is attacking with a 4/4 creature, which I block with my Spiteful Sliver that is a 2/2. I also control Crypt Sliver, and I tap Spiteful Sliver to regenerate itself. Does its \"Whenever this creature is dealt damage\" ability still trigger?"
  },
  {
    "imgs": [
      "Spark Double"
    ],
    "q": "If Spark Double enters the battlefield while no planeswalker or other creature is on the battlefield, can it copy itself and get the +1/+1 counter?"
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Endless One",
      "Everflowing Chalice"
    ],
    "q": "Does Zhulodok, Void Gorger give double-cascade to an Endless One with X=8, or an Everflowing Chalice kicked four times?"
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Abstruse Archaic"
    ],
    "q": "If Zhulodok, Void Gorger gives a spell I cast \"cascade, cascade\", can Abstruse Archaic copy that ability?"
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Artisan of Kozilek"
    ],
    "q": "If I control Zhulodok, Void Gorger and cast Artisan of Kozilek, in what order do the cascade triggers and Artisan's trigger go on the stack?"
  },
  {
    "imgs": [
      "Agent of the Shadow Thieves",
      "Spark Double"
    ],
    "q": "I have Agent of the Shadow Thieves in play and I control my commander. If I use Spark Double to copy my commander, does the copy also have the ability that Agent of the Shadow Thieves gives to my commander?"
  },
  {
    "imgs": [
      "Everquill Phoenix",
      "Krenko, Mob Boss",
      "Spark Double"
    ],
    "q": "Let's say Everquill Phoenix has been mutated on top of Krenko, Mob Boss. What do I get if I copy this creature with Spark Double?"
  },
  {
    "imgs": [
      "Ob Nixilis, Captive Kingpin",
      "Nekusar, the Mindrazer",
      "Wheel of Fortune"
    ],
    "q": "I control Ob Nixilis, Captive Kingpin and Nekusar, the Mindrazer, and I resolve Wheel of Fortune with three opponents. Does Ob Nixilis's ability trigger?"
  },
  {
    "imgs": [
      "Doubling Season",
      "Vorinclex, Monstrous Raider",
      "The Eldest Reborn"
    ],
    "q": "My opponent controls Doubling Season and I control Vorinclex, Monstrous Raider. If my opponent plays The Eldest Reborn, with how many lore counters does it enter the battlefield?"
  },
  {
    "imgs": [
      "Rise of the Eldrazi",
      "Skittering Cicada"
    ],
    "q": "How does the extra turn from Rise of the Eldrazi work in a multiplayer game if I cast it on another player's turn thanks to Skittering Cicada?"
  },
  {
    "imgs": [
      "Omen Machine",
      "Frantic Search"
    ],
    "q": "If Omen Machine is in play, does Frantic Search still make me discard cards?"
  },
  {
    "imgs": [
      "Ezuri's Predation"
    ],
    "q": "I control a bunch of Slivers that all have hexproof, and my opponent casts Ezuri's Predation. What happens?"
  },
  {
    "imgs": [
      "Commodore Guff",
      "Jace, Cunning Castaway"
    ],
    "q": "Let's say I control Commodore Guff and a number of Jace, Cunning Castaway tokens that exceeds my opponents' life totals and the number of cards I have left in my library. What happens if I activate Commodore Guff's -3 ability?"
  }
]