[
  {
    "imgs": [
      "Foray of Orcs",
      "King of the Oathbreakers"
    ],
    "q": "I control a 1/1 Orc Army token. I cast <span class=\"autocard\">Foray of Orcs</span>. If I target my opponent's <span class=\"autocard\">King of the Oathbreakers</span>, will I kill the King or will it phase out?",
    "a": "Their King will die. The Foray spell doesn't target anything. When the spell resolves and you amass Orcs 2, a reflexive trigger will go on the stack, and the reflexive trigger targets the creature that will be dealt the damage. The King's ability will only trigger if it's targeted by a spell, not by an ability, so being targeted by the reflexive trigger of the Foray won't cause the King's ability to trigger. You'll end up dealing 3 damage to their King and the King will die.<br>"
  },
  {
    "imgs": [
      "Shadowfax, Lord of Horses",
      "Run Amok"
    ],
    "q": "If I attack with <span class=\"autocard\">Shadowfax, Lord of Horses</span>, do I get a chance to cast <span class=\"autocard\">Run Amok</span> targeting Shadowfax before its attack trigger resolves?",
    "a": "Yep, you'll get that chance. Shadowfax's attack trigger uses the stack and can be responded to, so before the trigger resolves, you can cast Run Amok since Shadowfax is an attacking creature. When Shadowfax's trigger resolves, since it's now a 7/7, you can put a creature card with power 6 or less from your hand onto the battlefield attacking.<br>"
  },
  {
    "imgs": [
      "Rocco, Street Chef",
      "Arcane Bombardment"
    ],
    "q": "Will <span class=\"autocard\">Rocco, Street Chef</span> trigger for each copy I cast from <span class=\"autocard\">Arcane Bombardment</span>'s triggered ability?",
    "a": "Yep, he will. You're casting all of the copies made by the Bombardment from exile, so Rocco will trigger for each copy that you cast from the Bombardment's trigger. If you cast three spells via the Bombardment's trigger, you get three Rocco triggers.<br>"
  },
  {
    "imgs": [
      "Tazri, Stalwart Survivor",
      "Incubation Druid"
    ],
    "q": "I activate the ability of <span class=\"autocard\">Tazri, Stalwart Survivor</span> and one of the cards I milled is <span class=\"autocard\">Incubation Druid</span>. Can I put the Druid into my hand?",
    "a": "You can! The Druid has two activated abilities. The first one is a mana ability, but the adapt ability is also an activated ability that isn't a mana ability. Since the Druid has at least one activated ability that isn't a mana ability, you'll be able to put it into your hand with Tazri's ability.<br>"
  },
  {
    "imgs": [
      "Sarkhan, Soul Aflame"
    ],
    "q": "I control <span class=\"autocard\">Sarkhan, Soul Aflame</span>. I cast a Dragon, and made Sarkhan a copy of that Dragon with his triggered ability. Will Sarkhan still reduce the cost of my other Dragon spells this turn?",
    "a": "He will not. When Sarkhan copies a Dragon, he loses his normal abilities and becomes a copy of that Dragon (except his name doesn't change and he's still legendary). Since he lost his normal abilities, he no longer has the ability to discount your Dragon spells, so you won't get a discount on your future Dragon spells that turn.<br>"
  },
  {
    "imgs": [
      "Orcish Bowmasters",
      "Carrion Feeder",
      "Opportunity"
    ],
    "q": "I control an <span class=\"autocard\">Orcish Bowmasters</span> and a <span class=\"autocard\">Carrion Feeder</span>. My opponent just cast an <span class=\"autocard\">Opportunity</span> to draw four cards. Do I get a chance to sacrifice my Orc Army token after each Bowmaster trigger resolves to give my Feeder four +1/+1 counters?",
    "a": "Yes you do. Your opponent drew four cards from Opportunity, so that's four Bowmaster triggers. Those triggers resolve one at a time, not all at the same time, and you'll get a chance to interact after each trigger has resolved. Each time a Bowmaster trigger resolves, you'll get an Orc Army token, and you can sacrifice that token to the Feeder before the next Bowmaster trigger resolves (and get a new Orc Army token each time).<br>"
  },
  {
    "imgs": [
      "Odric, Lunarch Marshal",
      "Ulamog, the Infinite Gyre"
    ],
    "q": "I have an <span class=\"autocard\">Odric, Lunarch Marshal</span> and an <span class=\"autocard\">Ulamog, the Infinite Gyre</span> in play. Will Odric give my creatures annihilator 4 when I attack?",
    "a": "Nope. Odric only cares about the abilities listed on Odric. He doesn't care about any other keyword abilities your creatures have. Ulamog is indestructible, so Odric will give your creatures indestructible, but annihilator is not one of the abilities that Odric cares about, so Odric won't give your creatures the annihilator trigger.<br>"
  },
  {
    "imgs": [
      "Pestilent Spirit",
      "Disfigure"
    ],
    "q": "If I have a <span class=\"autocard\">Pestilent Spirit</span> in play, will that let my <span class=\"autocard\">Disfigure</span> kill any creature?",
    "a": "It does not. While Disfigure will have deathtouch because of the Spirit, Disfigure doesn't deal damage - giving a creature -2/-2 is not dealing damage. Since Disfigure doesn't deal damage, having deathtouch won't matter and the creature won't be destroyed.<br>"
  },
  {
    "imgs": [
      "Executioner's Hood",
      "Adaptive Shimmerer"
    ],
    "q": "If I put an <span class=\"autocard\">Executioner's Hood</span> on a colorless creature like <span class=\"autocard\">Adaptive Shimmerer</span>, what can block it?",
    "a": "A creature with intimidate can only be blocked by artifact creatures or creature that share a color with it. Your Shimmerer can only be blocked by artifact creatures. Even if the opponent has a colorless creature as well, it can't block it unless it's an artifact creature, since a colorless creature doesn't share a color with another colorless creature.<br>"
  },
  {
    "imgs": [
      "Ulamog, the Ceaseless Hunger",
      "Keep Safe"
    ],
    "q": "If my opponent casts <span class=\"autocard\">Ulamog, the Ceaseless Hunger</span> and tries to exile two of my lands with its cast trigger, can I counter Ulamog with <span class=\"autocard\">Keep Safe</span>?",
    "a": "No you cannot. Ulamog (the spell) doesn't target anything - its cast trigger targets. Keep Safe can only target a spell that's targeting a permanent you control, it cannot counter an ability. Keep Safe won't help you if your opponent casts Ulamog, since it can't counter Ulamog, nor can it counter Ulamog's triggered ability.<br>"
  },
  {
    "imgs": [
      "Captain Lannery Storm",
      "Ghostly Prison"
    ],
    "q": "I have <span class=\"autocard\">Captain Lannery Storm</span> and one untapped land in play. My opponent controls a <span class=\"autocard\">Ghostly Prison</span>. Can I attack with the Captain, get its Treasure from attacking with it, then sacrifice that Treasure and tap my land to pay for the Ghostly Prison tax?",
    "a": "You cannot. You have to pay for the Prison tax before the Captain becomes an attacking creature (and its ability triggers). You don't have the Treasure yet when you're paying the Prison tax, so you won't be able to attack with the Captain.<br>"
  },
  {
    "imgs": [
      "Retriever Phoenix",
      "Cram Session"
    ],
    "q": "I have three <span class=\"autocard\">Retriever Phoenix</span> in my graveyard, and I cast <span class=\"autocard\">Cram Session</span>. Can I return all three Phoenixes to the battlefield instead of learning?",
    "a": "No, you can only return one Phoenix. Each Phoenix has a replacement effect that replaces learning with returning that Phoenix from the graveyard to the battlefield. Once you replace learning with returning one Phoenix, the other Phoenixes won't apply since you're no longer learning. You'll only be able to return one Phoenix each time you would learn, not all three of them.<br>"
  },
  {
    "imgs": [
      "Augur of Autumn",
      "Lovestruck Beast // Heart's Desire"
    ],
    "q": "I have an <span class=\"autocard\">Augur of Autumn</span> in play, and the top card of my library is <span class=\"autocard\">Lovestruck Beast // Heart's Desire</span>. Assuming I have coven, can I cast the Adventure spell Heart's Desire from the top of my library?",
    "a": "No you may not. The Augur only lets you play lands and cast creature spells from the top of your library with its ability. If you're casting the Adventure side of the Beast, you're no longer casting a creature, you're casting a sorcery spell, which means that the Augur won't let you cast it. You'll be able to cast Lovestruck Beast from the top of your library, but not Heart's Desire.<br>"
  },
  {
    "imgs": [
      "Sheoldred, the Apocalypse",
      "Alhammarret's Archive",
      "Tainted Remedy"
    ],
    "q": "I control <span class=\"autocard\">Sheoldred, the Apocalypse</span> along with an <span class=\"autocard\">Alhammarret's Archive</span>. However, my opponent has anticipated my combo and has a <span class=\"autocard\">Tainted Remedy</span> in play. When I draw a card, how much life will I lose, 2 life or 4 life?",
    "a": "You'll get to choose how much life you want to lose. When you draw a card and Sheoldred's trigger resolves, you would gain 2 life. But we have two replacement effects that want to apply - the Archive wants to double the life gained, and the Remedy wants you to lose that much life instead. You choose the order the replacement effects are applied in. If you apply the Archive first, the life gained would be doubled to 4, and then the Remedy applies after that and you lose 4 life instead. But if you apply the Remedy first, you lose 2 life, and the Archive won't apply anymore since you're no longer gaining life.<br>\nIf it was up to me, I'd choose to lose 2 life instead of losing 4 life.<br>"
  },
  {
    "imgs": [
      "Transmogrant's Crown",
      "Prismari Command"
    ],
    "q": "I have a 2/2 creature equipped with a <span class=\"autocard\">Transmogrant's Crown</span>. If my opponent casts <span class=\"autocard\">Prismari Command</span> choosing to deal 2 damage to my 2/2 and destroy the Crown, will I draw a card?",
    "a": "You will not draw, since the Crown is not attached to the creature when it dies. While the Command will deal 2 damage to the creature first, the creature doesn't die right away - it won't die until we check state-based actions once the Command is done resolving. Before we get to that check, we have to finish resolving the Command, which means we need to destroy the Crown. When the creature finally dies, it doesn't have the Crown attached to it, so the Crown will not trigger.<br>"
  },
  {
    "imgs": [
      "Celestial Archon",
      "Light-Paws, Emperor's Voice"
    ],
    "q": "Could I search for a <span class=\"autocard\">Celestial Archon</span> with <span class=\"autocard\">Light-Paws, Emperor's Voice</span>'s triggered ability?",
    "a": "No you cannot. Light-Paws' trigger only lets you search for an Aura card. A creature with bestow, like the Archon, is not an Aura card while in the library - it's just an enchantment creature. It only becomes an Aura if you're casting it for its bestow cost. Since the Archon is not an Aura in your library, you cannot search for it with Light-Paws' triggered ability.<br>"
  },
  {
    "imgs": [
      "Mind's Desire"
    ],
    "q": "I cast <span class=\"autocard\">Mind's Desire</span> with a storm count of five. Do I really have to shuffle my library between each copy resolving, or can I just shuffle once and then exile that many cards from the top of my library?",
    "a": "One shuffle is fine there. As long as you're not altering the order of your library in-between each copy of the Desire resolving, you can just shuffle one time and exile six cards. It'd be a waste of time if we made you shuffle multiple times because of each copy, so shuffling once is an acceptable shortcut.<br>"
  },
  {
    "imgs": [
      "Prize Pig",
      "Bramble Wurm"
    ],
    "q": "I have a <span class=\"autocard\">Prize Pig</span> in play with zero ribbon counters on it. Then I cast <span class=\"autocard\">Bramble Wurm</span> and gain 5 life. When the Pig's trigger resolve, will I remove three counters from it, or all five counters?",
    "a": "The Pig loses all of the ribbon counters on it. When the Pig's trigger resolves, since you gained 5 life, you'll put five ribbon counters on the Pig. Then, since the Pig has three or more ribbon counters on it, we remove all of those counters and untap the Pig. You don't just remove three of the ribbon counters, the Pig loses all of them, so you won't be able to build up your ribbon counters.<br>"
  },
  {
    "imgs": [
      "Vazi, Keen Negotiator",
      "Puppet Strings"
    ],
    "q": "I control <span class=\"autocard\">Vazi, Keen Negotiator</span>. I've created three Treasures this turn, so I activate Vazi's ability and one of my opponents creates three Treasures. If I activate <span class=\"autocard\">Puppet Strings</span> and untap Vazi, if I activate its ability again, will that opponent creature six Treasures or three?",
    "a": "They'll only create three Treasures. Vazi counts the number of Treasures you've created for its activated ability. But the activated ability is telling the opponent to create the Treasures, not you. While you control Vazi's activated ability, the opponent is creating the Treasure, so activating Vazi's ability a second time that turn won't count the Treasures that were created by Vazi's first activation.<br>"
  },
  {
    "imgs": [
      "Guff Rewrites History",
      "Doomwake Giant"
    ],
    "q": "Can I cast <span class=\"autocard\">Guff Rewrites History</span> targeting an opponent's <span class=\"autocard\">Doomwake Giant</span>?",
    "a": "You cannot. Guff Rewrites History has to target nonland nonenchantment permanents. While the Giant is a creature, it's also an enchantment, which means that the Giant is not a nonenchantment permanent, and it's not a legal target for Guff Rewrites History.<br>"
  }
]