[
  {
    "imgs": [
      "Aquatic Alchemist // Bubble Up"
    ],
    "q": "I know you've told this tale before, but can you go over how <span class=\"autocard\">Aquatic Alchemist // Bubble Up</span> work?",
    "a": "Sure. An Adventure card is a permanent card that has a split text box. The left side has an instant or sorcery spell, and the right side has a normal text box. You can either cast the Alchemist normally, in which case it behaves like any other creature. Or you can cast it via Adventure. If you cast it via Adventure, while it's on the stack, it has its Adventure characteristics instead of its creature characteristics. In this case, you're casting a sorcery spell named Bubble Up with a mana value of 3. When the Adventure spell resolves, instead of going to the graveyard, you put it in exile, and then later on, you can cast the creature card from exile. (If it's exiled this way, you can only cast the creature, you can't cast the instant/sorcery again.)\nNote that it only has the characteristics of the instant or sorcery when it's on the stack and cast via Adventure. Anywhere else, it only has the normal characteristics, so you couldn't cast Bubble Up targeting a normal card with Adventure, since it's not an instant or sorcery card in the graveyard.\n<br>"
  },
  {
    "imgs": [
      "Decadent Dragon // Expensive Taste"
    ],
    "q": "Could I play a <span class=\"autocard\">Decadent Dragon // Expensive Taste</span> in my mono-red Commander deck?",
    "a": "You cannot. The Adventure characteristics also affect the card's color identity. While the Dragon itself is just red, the Adventure part of the card has a black mana symbol in its mana cost, so the color identity of the Dragon is red and black, and cannot be played in a mono-red Commander deck.\n<br>"
  },
  {
    "imgs": [
      "Embereth Veteran"
    ],
    "q": "What is a <span class=\"autocard\">Embereth Veteran</span>?",
    "a": "A Role token is a new type of enchantment token. They're predefined Aura tokens that can be attached to a creature. Six of them are featured in the main set, while a seventh is only available in the Commander decks. Usually, the token is a boon for the creature - it can involve a +1/+1 bonus and gives the enchanted creature an ability.  The Cursed Role token is an exception, since it makes the enchanted creature into a 1/1 creature, so try to put that one on your opponent's creatures.\n<br>"
  },
  {
    "imgs": [
      "Faunsbane Troll",
      "Twisted Fealty"
    ],
    "q": "Can I just pile up a bunch of Role tokens on one creature? For example, if my <span class=\"autocard\">Faunsbane Troll</span> has the Monstrous Role token attached to it, and I cast <span class=\"autocard\">Twisted Fealty</span> and give the Troll the Wicked Role token, will it benefit from both Role tokens?",
    "a": "Unfortunately for you, it can only fill one role for you at a time. If a creature has multiple Role tokens attached to it that are controlled by the same player, you keep the newest Role and the other ones go to the graveyard. In this case, the Troll will lose the Monstrous Role that it originally had and will only have the Wicked Role."
  },
  {
    "imgs": [],
    "q": "Does that mean if my opponent puts the Cursed Role token on one of my creatures, I can get rid of it by putting another Role on it?",
    "a": "Not quite. The Roles have to be controlled by the same player for one of them to go away. While you're free to attach your own Role token to the creature that's enchanted by your opponent's Cursed Role token, since they're controlled by different players, they'll both exist on the creature.\n<br>"
  },
  {
    "imgs": [
      "Ashiok's Reaper"
    ],
    "q": "Will a Role token going to the graveyard trigger my <span class=\"autocard\">Ashiok's Reaper</span>?",
    "a": "Yep, you'll get the trigger. Just like how a token creature will go to the graveyard long enough to trigger any dies abilities, the Role token will go to the graveyard for a brief time before state-based actions cause the Role token to cease to exist, but since it did go to the graveyard, the Reaper's ability will trigger.\n<br>"
  },
  {
    "imgs": [
      "Rowan, Scion of War"
    ],
    "q": "I activate <span class=\"autocard\">Rowan, Scion of War</span>'s ability after I've lost 3 life. After the ability has resolved, I lose 2 more life. Does that increase the discount of my black and red spells to <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">, or is it stuck at <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\">?",
    "a": "Rowan locks in the discount for your spells when the ability resolves. Losing life after Rowan's ability resolves won't increase the discount for your spells. If you want a bigger discount, you want to lose as much life as you can before you resolve Rowan's ability."
  },
  {
    "imgs": [
      "Will, Scion of Peace",
      "Intruder Alarm"
    ],
    "q": "I control <span class=\"autocard\">Will, Scion of Peace</span>, and I've gained 2 life this turn. I activate Will's ability, then cast a creature, which causes <span class=\"autocard\">Intruder Alarm</span> to trigger and untap Will. If I activate Will's ability again, are my white and/or blue spells discounted by <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"> or <img src=\"/ci-reader/images/symbols/4.png\" class=\"mana\">?",
    "a": "They cost <img src=\"/ci-reader/images/symbols/4.png\" class=\"mana\"> less to cast. Since you activated the ability twice, both discounts apply to your spells. You have two effects that say your white and/or blue spells cost <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"> less to cast, so both discounts apply and your white and blue spells cost a total of <img src=\"/ci-reader/images/symbols/4.png\" class=\"mana\"> less to cast.\n<br>"
  },
  {
    "imgs": [
      "Three Blind Mice"
    ],
    "q": "If I made a token copy of <span class=\"autocard\">Three Blind Mice</span>, could it copy itself with its own chapter II or III trigger?",
    "a": "Yep, it can. If the Saga itself is a token, you can target it with the trigger and make a copy of the Saga. That copy will enter with a lore counter, triggering its chapter I trigger, and it will get lore counters like normal. This can get out of hand very fast, since every time you get to chapter II or III with each Three Blind Mice, you can make another token copy of it.\n<br>"
  },
  {
    "imgs": [
      "Ingenious Prodigy"
    ],
    "q": "My <span class=\"autocard\">Ingenious Prodigy</span> has five +1/+1 counters on. Can I remove all five counters from it during my upkeep and draw five cards?",
    "a": "Nope, just one counter. The trigger says you may remove a counter, which is singular, so you can only choose to remove one counter from the Prodigy each time the trigger resolves. Even if it has multiple counters on it, you can still only remove one counter each turn.\n<br>"
  },
  {
    "imgs": [
      "The Irencrag"
    ],
    "q": "When I turn <span class=\"autocard\">The Irencrag</span> into Everflame, Heroes' Legacy with its triggered ability, does equipping it to a creature mean that the equipped creature loses all abilities?",
    "a": "No, you're misreading the card a little bit. The abilities that the equipment has is \"Equipped creature gets +3/+3\" and the equip 3 ability. The Irencrag loses its other abilities, so it no longer has the ability to tap for mana or the trigger to transform into the equipment, but losing all abilities only affects The Irencrag itself, not the creature the equipment becomes attached to.\n<br>"
  },
  {
    "imgs": [
      "Lich-Knights' Conquest"
    ],
    "q": "When I resolve <span class=\"autocard\">Lich-Knights' Conquest</span>, could I sacrifice my artifact creatures and enchantment creatures and return them to the battlefield?",
    "a": "Sure, if you want to use the Conquest as a weird form of blinking a creature, you can. The Conquest doesn't target, you just choose permanents to sacrifice when it resolves, then choose that many creature cards to return based on how many permanents you just sacrificed. You could sacrifice an artifact creature, then choose to return the artifact creature you just sacrificed to the battlefield.\nJust note that you won't be able to return a token creature to the battlefield this way - token creatures aren't cards, and a token that's left the battlefield can't go anywhere else, so you won't be able to sacrifice a token and return that token to the battlefield.\n<br>"
  },
  {
    "imgs": [
      "Discerning Financier"
    ],
    "q": "I control a <span class=\"autocard\">Discerning Financier</span> and a Treasure token. Can I activate the Financier's ability, then sacrifice the Treasure token in response and still draw a card?",
    "a": "You cannot. The Financier's ability only has one target - a target Treasure you control. If that target isn't legal when it goes to resolve, the entire ability does nothing and you won't draw a card. If you want to draw a card, you have to give another player the Treasure.\n<br>"
  },
  {
    "imgs": [
      "Discerning Financier"
    ],
    "q": "If I was in a game of Two-Headed Giant, could I give my Treasure to my teammate with <span class=\"autocard\">Discerning Financier</span> and still draw a card?",
    "a": "Sure. The ability says to choose another player, not an opponent, so you're free to give your Treasure to your teammate. Your teammate will get a mana boost in the form of a Treasure, and you'll get to draw a card.\n<br>"
  },
  {
    "imgs": [
      "Panharmonicon",
      "Talion, the Kindly Lord"
    ],
    "q": "If I have a <span class=\"autocard\">Panharmonicon</span> in play, will that let me choose two numbers when <span class=\"autocard\">Talion, the Kindly Lord</span> enters the battlefield?",
    "a": "Nope, Panharmonicon won't do anything here. Choosing a number for Talion is a replacement effect, not a triggered ability. It doesn't use the word \"when\", \"whenever\", or \"at\". There's no triggered ability here, so you'll still only choose one number as Talion enters, not two numbers.\n<br>"
  },
  {
    "imgs": [
      "Nyxborn Courser",
      "A Tale for the Ages"
    ],
    "q": "Does my <span class=\"autocard\">Nyxborn Courser</span> count as an \"enchanted creature\" and get +2/+2 from <span class=\"autocard\">A Tale for the Ages</span>?",
    "a": "No it does not. There's a difference between being an \"enchanted creature\" and being an \"enchantment creature\". An enchanted creature is a creature that has an Aura attached to it. The Courser doesn't count as an enchanted creature, so it won't get +2/+2 from the Tale unless you attach an Aura to it.\n<br>"
  },
  {
    "imgs": [
      "Agatha's Soul Cauldron",
      "Grist, the Hunger Tide"
    ],
    "q": "If I activate <span class=\"autocard\">Agatha's Soul Cauldron</span> exiling <span class=\"autocard\">Grist, the Hunger Tide</span>, will my creatures with +1/+1 counters on them have Grist's loyalty abilities?",
    "a": "Yes they will! Anywhere except the battlefield, Grist is a creature. When Grist is exiled to the Soul Cauldron's ability, your creatures with +1/+1 counters on the will gain all of Grist's loyalty abilities. Keep in mind a few things though - your creatures start out with zero loyalty counters on them (since they're not planeswalkers), and your creatures can still only activate one loyalty ability per turn, and only during one of your main phases when the stack is empty (since those restrictions are built into the rules for loyalty abilities, not built into the planeswalker type).\n<br>"
  },
  {
    "imgs": [
      "Kellan, the Fae-Blooded // Birthright Boon",
      "Extus, Oriq Overlord"
    ],
    "q": "My commander is <span class=\"autocard\">Kellan, the Fae-Blooded // Birthright Boon</span>. Can I dodge the commander tax by casting <span class=\"autocard\">Kellan, the Fae-Blooded // Birthright Boon</span> from the command zone and ignoring the commander tax?",
    "a": "While you can cast Birthright Boon from the command zone, that doesn't mean you're getting around the commander tax. The commander tax is applied any time you're casting your commander from the command zone, and the entire card is your commander, even if you're casting it via Adventure. (People who play with <span class=\"autocard\">Extus, Oriq Overlord</span> as their commander and want to cast the back face Awaken the Blood Avatar are familiar with this concept.) You're free to cast Birthright Boon by paying <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/W.png\" class=\"mana\"> the first time you're casting it, but the second time will cost you <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/W.png\" class=\"mana\">, since you'll have to pay an additional <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"> since you cast it once from your command zone earlier.\n<br>"
  },
  {
    "imgs": [
      "Land Tax"
    ],
    "q": "I just opened a <span class=\"autocard\">Land Tax</span> in my <i>Wilds of Eldraine</i> booster pack. Can I play it in Standard?",
    "a": "Nope, that's a part of the Enchanting Tales, a bonus card found in each pack of <i>Wilds of Eldraine</i>. It's similar to the old-frame artifacts in <i>The Brothers' War</i> or the Multiverse Legends found in packs of <i>March of the Machine</i>. They have unique art and have the expansion code \"WOT\" (as opposed to \"WOE\" for cards in the main set), and they have a different expansion symbol as well. Land Tax isn't a card printed in a Standard-legal set, but you could play it in Vintage, Legacy, or Commander, and if you managed to open it in your Sealed deck or drafted it in a Draft, you could play it there as well.\n<br>"
  },
  {
    "imgs": [],
    "q": "So once <i>Wilds of Eldraine</i> is Standard-legal, that means Standard rotates and I won't be able to play my cards from <i>Innistrad: Midnight Hunt</i> and <i>Streets of New Capenna</i> anymore, right?",
    "a": "Nope, not this year. In case you missed the announcement last May, they announced that they're changing how Standard rotates. For much of Standard's history, it's consisted of the last two years of set releases, but now that's expanding to the last three years worth of sets. That means that we won't be getting a normal rotation this fall, so when <i>Wilds of Eldraine</i> becomes Constructed legal, nothing will rotate out of Standard. Next year, in the fall of 2024, we'll rotate Standard like we did in the past, but you'll have an extra year with cards from <i>Innistrad: Midnight Hunt</i> to <i>Streets of New Capenna</i>."
  }
]