[
  {
    "imgs": [
      "Helm of Awakening",
      "Everflowing Chalice"
    ],
    "q": "Does <span class=\"autocard\">Helm of Awakening</span> reduce the kicker cost of <span class=\"autocard\">Everflowing Chalice</span>?",
    "a": "Not directly, but the Helm does help a little bit. When you cast the Chalice, you decide how many times to kick it, and then you calculate the total cost, taking into account that the total cost gets reduced by <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"> due to the Helm. For example, if you kick the Chalice twice, the total cost ends up being <img src=\"/ci-reader/images/symbols/4.png\" class=\"mana\"> minus <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\">, so you'll pay <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"> for a Chalice with two counters on it."
  },
  {
    "imgs": [
      "Teferi's Protection",
      "Contagion Engine"
    ],
    "q": "If I use <span class=\"autocard\">Teferi's Protection</span>, can my opponent still kill me with poison counters?",
    "a": "Maybe, depending on how exactly they go about doing that. You do have protection from everything, which means that your opponent can't kill you just by attacking with a bunch of creatures that have infect, since the damage just gets prevented and you won't get any poison counters. However, if you already have at least one poison counter, your opponent could use <span class=\"autocard\">Contagion Engine</span> to give you more poison counters. Proliferate does not target or deal damage to you, or do anything else that protection cares about, so Teferi's Protection doesn't do anything to stop those poison counters."
  },
  {
    "imgs": [
      "Cut In"
    ],
    "q": "I cast <span class=\"autocard\">Cut In</span> targeting an opponent's creature for the damage and my creature for the Role token. In response, my opponent feeds their creature to some sacrifice outlet. Does my creature stil get the Role token?",
    "a": "Yup! When a spell starts to resolve, it checks whether its targets are still legal. If all of its targets have become illegal, the spell fails to resolve and does nothing, but if at least one of its targets is still legal, it resolves and does as much as it can. Cut In still has a legal target, so it resolves and does as much as it can. It fails to deal damage to your opponent's creature, but it still gives your creature the Young Hero Role token."
  },
  {
    "imgs": [
      "Maralen of the Mornsong",
      "Windfall"
    ],
    "q": "I control <span class=\"autocard\">Maralen of the Mornsong</span> and my opponent plays <span class=\"autocard\">Windfall</span>. Do we still draw cards because Windfall has the later timestamp?",
    "a": "No, this interaction is not handled with timestamps. Timestamps are an aspect of the <a href=\"ooo\">layer system</a> that governs how continuous effects interact with each other. In this situation, we have a continuous effect that says players can't draw cards, and a one-shot effect instructing players to draw cards. Such an interaction is handled by one of the golden rules of <b>Magic</b>, which is usually summed up as \"can't\" beats \"can\". Maralen's \"can't\" effect overrides the draw instruction from Windfall, so each player just discards their hand and they don't draw any cards."
  },
  {
    "imgs": [
      "Asmodeus the Archfiend",
      "Maralen of the Mornsong"
    ],
    "q": "What about <span class=\"autocard\">Asmodeus the Archfiend</span>? If I control <span class=\"autocard\">Maralen of the Mornsong</span>, can my opponent's Asmodeus still replace their card draws?",
    "a": "No. An effect needs to be able to happen before the game considers what replacement effects can apply to it. Since Maralen says that the draw can't happen, Asmodeus's replacement effect has no event to apply to."
  },
  {
    "imgs": [
      "Anikthea, Hand of Erebos",
      "Doubling Season"
    ],
    "q": "If I use <span class=\"autocard\">Anikthea, Hand of Erebos</span> to make a token copy of a <span class=\"autocard\">Doubling Season</span> in my graveyard, does Doubling Season token double itself as it enters the battlefield?",
    "a": "No, you'll only create one token. Doubling Season's ability creates a replacement effect which watches the game for a particular event (in this case the creation of some number of tokens) and replaces it partially or completely with another event (in this case doubling the number of tokens being created). In order to do this, a replacement effect has to exist before the event it is replacing happens. A replacement effect can't turn back time or change an event that has already happened. Since the Doubling Season token doesn't exist yet while you're creating it, it can't change the event of its own creation."
  },
  {
    "imgs": [
      "Lava Spike",
      "Lava Spike"
    ],
    "q": "I have three <span class=\"autocard\">Lava Spike</span>s from <i>Modern Masters</i> that say \"target player\" and one <span class=\"autocard\">Lava Spike</span> from <i>Time Spiral Remastered</i> that says \"target player or planeswalker.\" Can I play all four cards in the same deck, and if so, which wording is correct?",
    "a": "Yes, it's perfectly legal to play with different printings of the same card as long as you stick to the limit of at most four copies of the card. Regardless of the rules text that's printed on the card, each card functions according to its Oracle text in <a href=\"http://gatherer.wizards.com\">Gatherer</a>, which says \"target player or planeswalker.\""
  },
  {
    "imgs": [
      "Jaya's Immolating Inferno",
      "Imodane, the Pyrohammer"
    ],
    "q": "If I cast <span class=\"autocard\">Jaya's Immolating Inferno</span> targeting one of my opponent's creatures, does it trigger <span class=\"autocard\">Imodane, the Pyrohammer</span>'s ability?",
    "a": "If the spell resolves and ends up dealing damage to the creature, sure. Imodane's ability doesn't care that the spell could have targeted three creatures. What matters is that it targets only one creature and that it deals damage to it. As long as that condition is met, Imodane's ability triggers."
  },
  {
    "imgs": [
      "Likeness Looter"
    ],
    "q": "If <span class=\"autocard\">Likeness Looter</span> copies a creature and later on copies another creature, does it have the abilities from both creatures?",
    "a": "No. When the <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> ability resolves a second time, Likeness Looter becomes a copy of the second creature, except it also has flying and the <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> ability. As such, it only copies the abilities (and other characteristics) of the second creature, so it forgets the abilities of the first creature."
  },
  {
    "imgs": [
      "Wall of Roots",
      "Agatha's Soul Cauldron"
    ],
    "q": "If I've exiled two <span class=\"autocard\">Wall of Roots</span> with <span class=\"autocard\">Agatha's Soul Cauldron</span>, can a creature with a +1/+1 counter on it activate the Wall's ability twice?",
    "a": "Essentially yes. The creature gets two separate abilities that are identical to each other, but each ability tracks its activation restriction separately, and activating each ability once is practically indistinguishable from activating one ability twice."
  },
  {
    "imgs": [
      "Lich-Knights' Conquest"
    ],
    "q": "I cast <span class=\"autocard\">Lich-Knights' Conquest</span>, and for some reason I want to sacrifice two things but only return one creature card from my graveyard. Can I do that?",
    "a": "Yes, provided that there is only one creature card in your graveyard at the time you get to the second half of resolving Lich-Knights' Conquest. You perform the steps in order and you do as much as possible. If there are at least two creature cards in your graveyard when you get to the \"return\" instruction, you have to choose two of them since the spell doesn't say \"up to that many\". However, if there is only one creature card in your graveyard, you simply return that one card to the battlefield and there is no penalty for failing to return a second card."
  },
  {
    "imgs": [
      "Rowan, Scion of War"
    ],
    "q": "I've lost 5 life this turn and I activate <span class=\"autocard\">Rowan, Scion of War</span>'s ability, then untap her somehow and activate her ability again. Do my black/red spells cost <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\"> or <img src=\"/ci-reader/images/symbols/10.png\" class=\"mana\"> less to cast?",
    "a": "They'll cost <img src=\"/ci-reader/images/symbols/10.png\" class=\"mana\"> less to cast. Each resolution of Rowan's ability creates its own cost-reduction by <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">. When you cast a black and/or red spell later that turn, both reductions are applied, for a total discount of <img src=\"/ci-reader/images/symbols/10.png\" class=\"mana\">."
  },
  {
    "imgs": [
      "Gadwick's First Duel",
      "Johann's Stopgap"
    ],
    "q": "<span class=\"autocard\">Gadwick's First Duel</span>'s chapter III just resolved, and I cast <span class=\"autocard\">Johann's Stopgap</span> with its bargain cost. Does it get copied?",
    "a": "No. The mana value of a spell is derived only from the mana cost printed on the card and has very little to do with how much you paid for it. Johann's Stopgap's mana cost is <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/U.png\" class=\"mana\">, so its mana value is 4, which means you have not cast a spell with mana value 3 or less yet."
  },
  {
    "imgs": [
      "Ashiok, Wicked Manipulator",
      "Asmodeus the Archfiend"
    ],
    "q": "How does <span class=\"autocard\">Ashiok, Wicked Manipulator</span>'s -7 ability count the mana value of cards that were exiled face-down, for example with <span class=\"autocard\">Asmodeus the Archfiend</span>?",
    "a": "It doesn't. A card that's exiled face-down has no characteristics, which means it doesn't have a mana cost, which means that its mana value is 0."
  },
  {
    "imgs": [
      "Heartless Hidetsugu",
      "Havoc Festival"
    ],
    "q": "I've heard that <span class=\"autocard\">Heartless Hidetsugu</span> can kill a Two-Headed Giant team with one activation, but <span class=\"autocard\">Havoc Festival</span> doesn't. What's the difference?",
    "a": "Let's look at Havoc Festival first. It has a triggered ability that triggers at the beginning of each player's upkeep. The team plays a shared turn, so two instances of this ability go on the stack, one for each player. Let's say the team is at 30 life when this happens. The first trigger resolves and asks the game what the player's life total is. The game uses the team's life total, which is 30. The effect halves that to 15, so the player loses 15 life, which reduces their team's life total to 15. Now, the second trigger resolves, and it asks the game for the second player's life total. This trigger sees a life total of 15 and halves that, rounding up, so the second player loses 8 life and the team is left with 7 life."
  },
  {
    "imgs": [
      "Spiteful Hexmage",
      "Cruel Somnophage // Can't Wake Up"
    ],
    "q": "If I put a <span class=\"autocard\">Spiteful Hexmage</span> token on my opponent's <span class=\"autocard\">Cruel Somnophage // Can't Wake Up</span>, is its power/toughness still */* or does it become 1/1?",
    "a": "It becomes 1/1. Cruel Somnophage's characteristic-defining ability is applied in layer 7a, while the effect from the Cursed Role token is applied in layer 7b, so the Cursed Role wins."
  },
  {
    "imgs": [
      "Field of Dreams",
      "Ponder"
    ],
    "q": "I control <span class=\"autocard\">Field of Dreams</span> and my opponent plays <span class=\"autocard\">Ponder</span>. Do I get to see the three cards that my opponent is looking at, and maybe even the fourth card?",
    "a": "No. At each point in time, you only get to see the one card that is the top card of your opponent's library. While your opponent is looking at the top three cards of their library, those cards are still considered to be in the library in their original order even though your opponent is physically holding them in their hand and looking at them. The card that was on top of their library at the time Ponder started to resolve is still the top card of their library, and that's the one card that's known to you. You have no reason to see any of the cards that are in the library below it."
  },
  {
    "imgs": [
      "Jaheira, Friend of the Forest"
    ],
    "q": "If I control <span class=\"autocard\">Jaheira, Friend of the Forest</span> and I have a bunch of creatures with Role tokens on them, can I tap the Role tokens for <img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\">?",
    "a": "Absolutely! They are tokens, so Jaheira gives them the ability to be tapped for green mana. The fact that they're Auras doesn't matter to Jaheira even a little bit. However, since Auras don't usually get tapped, I want to point out a couple of things that might not be obvious. For one, you tap the Aura itself for mana, not the creature it's attached to. Also, you can even tap a Cursed Role token that you have attached to your opponent's creature, since you control the Role even if you don't control the creature it's attached to."
  }
]