[
  {
    "imgs": [
      "Oketra's Monument",
      "Ojer Taq, Deepest Foundation"
    ],
    "q": "If I control <span class=\"autocard\">Oketra's Monument</span> and cast <span class=\"autocard\">Ojer Taq, Deepest Foundation</span>, do I create three Warrior tokens?",
    "a": "No. The triggered ability from Oketra's Monument goes on the stack above Ojer Taq, so it resolves first. This means that Ojer Taq is not on the battlefield yet when you create the token with Oketra's Monument, so the token-tripling ability is not in effect yet."
  },
  {
    "imgs": [
      "Roaming Throne",
      "Maelstrom Wanderer"
    ],
    "q": "If I control <span class=\"autocard\">Roaming Throne</span> naming Elemental, do I get four cascade triggers from <span class=\"autocard\">Maelstrom Wanderer</span>?",
    "a": "No. Roaming Throne only doubles up triggered abilities of <i>creatures</i> you control, which means creatures that are permanents on the battlefield. Cascade triggers when a spell is cast, so it's an ability of a creature spell, not of a creature permanent, which means that Roaming Throne's ability doesn't apply."
  },
  {
    "imgs": [
      "Roaming Throne",
      "Omnath, Locus of Creation"
    ],
    "q": "I still control <span class=\"autocard\">Roaming Throne</span> naming Elemental, and I also control <span class=\"autocard\">Omnath, Locus of Creation</span>. If I play a land, what happens?",
    "a": "Thanks to Roaming Throne, Omnath's <i>landfall</i> ability triggers twice. Each trigger resolves separately, and each one checks how many times that ability has resolved this turn. Since they are the same ability, the second ability to resolve sees that it is the second time it's resolving, so you get 4 life from the first ability and 4 mana from the second ability."
  },
  {
    "imgs": [
      "Swerve",
      "Plasm Capture"
    ],
    "q": "If I <span class=\"autocard\">Swerve</span> <span class=\"autocard\">Plasm Capture</span> to target itself, does Plasm Capture's controller still get mana?",
    "a": "Well, you can't actually make Plasm Capture target itself, since a spell can't target itself. However, while you're choosing the new target for Plasm Capture, Swerve is still resolving, so Swerve is a spell on the stack, which means that you can point Plasm Capture at Swerve instead. Swerve then goes to the graveyard, so when Plasm Capture starts to resolve, it finds that its only target is illegal now, and it fails to resolve. Therefore, none of Plasm Capture's effects happen and its controller does not get mana."
  },
  {
    "imgs": [
      "Imperial Recruiter",
      "Psychosis Crawler"
    ],
    "q": "Can I use <span class=\"autocard\">Imperial Recruiter</span> to fetch a <span class=\"autocard\">Psychosis Crawler</span>?",
    "a": "Maybe, depending on how many cards are in your hand when Imperial Recruiter's ability resolves. Psychosis Crawler has a characteristic-defining ability that defines its power and toughness, and that ability works in every zone including the library. If you have two or fewer cards in your hand at the time Imperial Recruiter's ability resolves, you can find Psychosis Crawler, but if there are more than two cards in your hand, the Crawler is too big to be recruited."
  },
  {
    "imgs": [
      "Ian Chesterton",
      "Serra Paragon"
    ],
    "q": "I control <span class=\"autocard\">Ian Chesterton</span> and <span class=\"autocard\">Serra Paragon</span>, and I use Serra Paragon's ability to cast a Saga from my graveyard. If I replicate the Saga, do the copies gain the \"exile it and you gain 2 life\" triggered ability that the Saga is getting from Serra Paragon?",
    "a": "No, only the original Saga you're casting with Serra Paragon gains that triggered ability. Replicate copies only the copiable characteristics of the original spell, which are only the characteristics that are printed on the card. The added triggered ability that Serra Paragon gives the spell is not part of its copiable characteristics, so the copies don't gain that ability."
  },
  {
    "imgs": [
      "Body of Knowledge",
      "Cephalid Facetaker"
    ],
    "q": "If I copy <span class=\"autocard\">Body of Knowledge</span> with <span class=\"autocard\">Cephalid Facetaker</span>, is the Facetaker a 1/4 or */*?",
    "a": "It's 1/4. Since Cephalid Facetaker's copy effect overwrites its power and toughness, the characteristic-defining ability that defines Body of Knowledge's power and toughness is not getting copied. Without that ability, the Facetaker has no reason for its power and toughness to be anything other than 1/4."
  },
  {
    "imgs": [
      "Incarnation Technique"
    ],
    "q": "Can I use <span class=\"autocard\">Incarnation Technique</span>'s demonstrate ability on an opponent with shroud?",
    "a": "Certainly. The demonstrate ability doesn't target the opponent. You simply choose an opponent, and that opponent copies the spell. Since the opponent is not being targeted by the demonstrate ability or by the spell, shroud does nothing to stop this from happening."
  },
  {
    "imgs": [
      "Circle of Flame",
      "Fire Ants"
    ],
    "q": "Is the damage from <span class=\"autocard\">Circle of Flame</span> combat damage? What about <span class=\"autocard\">Fire Ants</span> if I activate their ability in the combat damage step?",
    "a": "No to both. Combat damage is only the damage that's assigned and dealt by attacking and blocking creatures during the turn-based action that happens at the beginning of the combat damage step. Any damage that's dealt at any other time or for any other reason is noncombat damage, even if it happens to be during the combat phase or even during the combat damage step."
  },
  {
    "imgs": [
      "Pantlaza, Sun-Favored",
      "Choose Your Weapon"
    ],
    "q": "If I control <span class=\"autocard\">Pantlaza, Sun-Favored</span> and play another Dinosaur, can I double its power and toughness with <span class=\"autocard\">Choose Your Weapon</span> in response to Pantlaza's triggered ability so I get a bigger X for the discover effect?",
    "a": "Absolutely. Pantlaza's ability uses the stack, so you can respond to it, and it only determines the value of X at the time the ability resolves. If you double the toughness of the creature in response to the ability, the ability uses the doubled toughness for its X, and you will make an accordingly big discovery."
  },
  {
    "imgs": [
      "The Skullspore Nexus"
    ],
    "q": "I have a 1/1 with three +1/+1 counters on it, and I use <span class=\"autocard\">The Skullspore Nexus</span> to double its power. Does it become a 5/4 or an 8/4?",
    "a": "It'll be 8/4. To double a creature's power, you give it +X/+0, where X is its current power, including any modifications from existings effects and counters. Its current power is 4, so it gets +4/+0 from The Skullspore Nexus, which makes it an 8/4 until end of turn."
  },
  {
    "imgs": [
      "Ojer Axonil, Deepest Might",
      "End the Festivities"
    ],
    "q": "I control <span class=\"autocard\">Ojer Axonil, Deepest Might</span> and cast <span class=\"autocard\">End the Festivities</span>. Does End the Festivities deal 4 damage to my opponent's creatures and planeswalkers because of Ojer Axonil's ability?",
    "a": "No, Ojer Axonil's replacement effect only applies to damage that's dealt to your opponent. Damage that's dealt to creatures or planeswalker your opponent controls gets dealt normally, so they'll only be dealt 1 damage each."
  },
  {
    "imgs": [
      "Caparocti Sunborn",
      "Strionic Resonator"
    ],
    "q": "If I copy <span class=\"autocard\">Caparocti Sunborn</span>'s triggered ability with <span class=\"autocard\">Strionic Resonator</span>, do I have to tap two additional artifacts and/or creatures?",
    "a": "Well, you don't have to, but not doing so would defeat the purpose of copying the ability in the first place. Choosing to tap two artifacts and/or creatures happens during the resolution of the ability, and if you do that, then you discover 3. The copy of the ability and the original ability both ask you independently whether you wish to pay that cost, and if you want to discover twice, you have to pay that cost twice."
  },
  {
    "imgs": [
      "Beregond of the Guard",
      "Rite of Replication"
    ],
    "q": "I control <span class=\"autocard\">Beregond of the Guard</span> and make five copies of it with a kicked <span class=\"autocard\">Rite of Replication</span>. What happens?",
    "a": "Let's go through this carefully. Five token copies of Beregond of the Guard enter the battlefield at the same time, and they all see themselves and each other enter the battlefield. This triggers their triggered abilities some number of times — we'll calculate that number in a moment — but before we put the triggers on the stack, we have to deal with state-based actions. You control too many copies of a legendary permanent, so you choose one to keep and put the others into the graveyard to satisfy the legend rule. Now you put the triggers on the stack, even those that belonged to the Beregonds that you put into the graveyard. The Beregond you already controlled saw five other Humans enter the battlefield, and the new ones each saw themselves and four other Humans enter the battlefield, so you get six times five triggers. This means that there are thirty triggers that go on the stack, and each creature you still control gets +30/+30 and thirty instances of vigilance as a result."
  },
  {
    "imgs": [
      "Ramses, Assassin Lord"
    ],
    "q": "I'm in a Commander game and I control <span class=\"autocard\">Ramses, Assassin Lord</span>, and I attack an opponent with an Assassin. I pump the Assassin so that the attack would be lethal, and in response another opponent kills Ramses. Do I still win the game when the opponent I attacked loses the game?",
    "a": "No, you don't win the game. Ramses's ability is not an attack trigger. The ability is triggered at the time a player loses the game, if an additional condition is met. Since Ramses is no longer on the battlefield at the time your opponent loses the game, its triggered ability is not in effect, so the ability doesn't trigger in the first place. The fact that the additional condition of the player having been attacked by an Assassin you control is true is irrelevant since the ability is not around to care about that condition."
  },
  {
    "imgs": [
      "Blood for Bones",
      "Young Pyromancer"
    ],
    "q": "If I cast <span class=\"autocard\">Blood for Bones</span>, sacrificing <span class=\"autocard\">Young Pyromancer</span> for the additional cost, do I still get an Elemental token?",
    "a": "No. A triggered ability that triggers on casting a spell only checks after you've finished casting the spell, which includes paying the cost. At the time you're done casting Blood for Bones, Young Pyromancer is no longer on the battlefield, so its ability doesn't trigger."
  },
  {
    "imgs": [
      "Lazav, the Multifarious",
      "Thing in the Ice",
      "Awoken Horror"
    ],
    "q": "If <span class=\"autocard\">Lazav, the Multifarious</span> becomes a copy of <span class=\"autocard\">Thing in the Ice</span>, can it transform into <span class=\"autocard\">Awoken Horror</span>?",
    "a": "Nope. Only a transforming double-faced card or a transforming token can transform. Lazav is not one of those, so the instruction to transform it does nothing at all."
  },
  {
    "imgs": [
      "Caustic Caterpillar",
      "Agatha's Soul Cauldron"
    ],
    "q": "If I exile <span class=\"autocard\">Caustic Caterpillar</span> with <span class=\"autocard\">Agatha's Soul Cauldron</span>, can I use the Caterpillar's ability by sacrificing any creature that has a +1/+1 counter on it?",
    "a": "Absolutely. The name \"Caustic Caterpillar\" in Caustic Caterpillar's activated ability means exactly the same as \"this permanent\". This means that your creatures with +1/+1 counters on them have the activated ability \"<img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\">, Sacrifice this permanent: Destroy target artifact or enchantment.\""
  },
  {
    "imgs": [
      "Power Conduit"
    ],
    "q": "Can I use <span class=\"autocard\">Power Conduit</span> to remove a counter from a Saga I control, and if so, does removing a counter re-trigger the previous chapter?",
    "a": "Yes and no. The lore counters are counters, so you can remove a lore counter from a Saga you control to help pay for Power Conduit's activation cost. However, chapter abilities don't trigger on the number of lore counters changing. They trigger specifically when one or more lore counters are put onto the Saga, so removing a counter does not retrigger the earlier chapter."
  },
  {
    "imgs": [
      "Tinker",
      "Blightsteel Colossus",
      "Skyclave Apparition"
    ],
    "q": "I'm playing a cube draft with a friend, and I <span class=\"autocard\">Tinker</span>ed a <span class=\"autocard\">Blightsteel Colossus</span> on turn three. The next turn, my friend casts <span class=\"autocard\">Skyclave Apparition</span> and exiles the Colossus. Several turns later, we realize that Skyclave Apparition can't exile a creature with a mana value that high. Is there any way to fix the situation?",
    "a": "Well, in a casual game, you can do whatever you and your opponent can agree on as a fix, but in a tournament, the only options we have here are \"rewind the game to the point of the error\" or \"leave the game state as it is.\" The Infraction Procedure Guide describes a number of partial fixes to certain kinds of errors, but none of those fixes are applicable here. Since several turns have passed, it's safe to assume that rewinding the game to the point of the error is impossible, so the only option is to leave the game state as it is. Your Colossus remains exiled by the Skyclave Apparition, but at least you'll get a 12/12 token out of it if you manage to kill the Apparition later."
  }
]