[
  {
    "imgs": [
      "Agatha of the Vile Cauldron"
    ],
    "q": "Does <span class=\"autocard\">Agatha of the Vile Cauldron</span> reduce the cost of her own activated ability?",
    "a": "Yes she does! Agatha doesn't exclude herself in the activated ability's discount - it would say \"Activated abilities of <i>other</i> creatures you control...\" for that to be true. So by default, Agatha's activated ability will cost <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\"> to activate since her power is 1, and if you get her up to a power of 4 or greater, then her ability will only cost <img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\"> to activate."
  },
  {
    "imgs": [
      "Hylda of the Icy Crown",
      "Dispatch"
    ],
    "q": "I control <span class=\"autocard\">Hylda of the Icy Crown</span> and currently control three artifacts. If I cast <span class=\"autocard\">Dispatch</span> targeting an opponent's untapped creature, will I get a Hylda trigger?",
    "a": "You will! Dispatch will always tap the targeted creature. The metalcraft bonus is an extra effect that happens if you control three or more artifacts when it resolves. It's not replacing tapping the creature with exiling it instead, you just do both. Normally, tapping the creature before it's exiled won't do anything, but Hylda will see that a spell you controlled tapped an untapped creature an opponent controls, and Hylda will trigger."
  },
  {
    "imgs": [
      "Malcolm, Alluring Scoundrel",
      "Nexus of Fate"
    ],
    "q": "I control a <span class=\"autocard\">Malcolm, Alluring Scoundrel</span> with four chorus counters on it. I attack with it, it deals combat damage to the opponent, and I discard <span class=\"autocard\">Nexus of Fate</span> to Malcolm's trigger. Can I cast the Nexus of Fate?",
    "a": "No, you won't be able to cast it. Nexus of Fate has a replacement effect, so it never ends up in the graveyard - it's shuffled into the library instead of going to the graveyard. Since Nexus of Fate didn't end up in a public zone, we can't perform the second part of Malcolm's effect and you won't be able to cast the discarded Nexus of Fate."
  },
  {
    "imgs": [
      "Nissa, Ascended Animist"
    ],
    "q": "I cast <span class=\"autocard\">Nissa, Ascended Animist</span> and she enters the battlefield with five loyalty counters. If I activate the +1 ability to make a token, is the token a 5/5 or a 6/6?",
    "a": "You create a 6/6 token. The ability will look at the amount of loyalty Nissa has when the activated ability resolves, not how many counters she had before you activated the ability. When the +1 ability resolves, Nissa has six loyalty counters on her, so her ability will make a 6/6 token."
  },
  {
    "imgs": [
      "Deathrite Shaman",
      "Scab-Clan Mauler"
    ],
    "q": "If I activate <span class=\"autocard\">Deathrite Shaman</span>'s second ability, causing my opponent to lose 2 life, then cast <span class=\"autocard\">Scab-Clan Mauler</span>, will my Mauler enter with two +1/+1 counters from bloodthirst?",
    "a": "No it will not. Bloodthirst checks to see if an opponent has been dealt damage this turn. But Deathrite Shaman doesn't deal damage to the opponent - it causes your opponents to lose life. Losing life doesn't count as dealing damage, so the Shaman's activated ability won't turn on your bloodthirst creature."
  },
  {
    "imgs": [
      "Swarm Shambler",
      "Alpine Grizzly",
      "Lightning Strike",
      "Snakeskin Veil"
    ],
    "q": "I have a <span class=\"autocard\">Swarm Shambler</span> and an <span class=\"autocard\">Alpine Grizzly</span> in play. My opponent casts <span class=\"autocard\">Lightning Strike</span> targeting my Alpine Grizzly. If I respond by casting <span class=\"autocard\">Snakeskin Veil</span> on my Alpine Grizzly, will my Swarm Shambler also trigger and give me a token?",
    "a": "No, it won't trigger. For Swarm Shambler to trigger, your Grizzly has to have a +1/+1 counter on it when Lightning Strike is cast. It won't retroactively trigger if the Grizzly gains a +1/+1 counter after being targeted by the Strike. While your Grizzly will survive since it has hexproof, it didn't have a +1/+1 counter on it when the Strike was cast, and Swarm Shambler will not trigger."
  },
  {
    "imgs": [
      "Ulamog, the Ceaseless Hunger",
      "Tishana's Tidebinder"
    ],
    "q": "My opponent casts <span class=\"autocard\">Ulamog, the Ceaseless Hunger</span> and targets two of my permanents with its cast trigger. In response, I cast <span class=\"autocard\">Tishana's Tidebinder</span> and counter Ulamog's cast trigger. Does that cause the Ulamog spell to lose all abilities, making it just a 10/10 without indestructible or the attack trigger once it's on the battlefield?",
    "a": "No it does not. Tishana only removes the abilities if the source of the ability was an artifact, creature, or planeswalker on the battlefield, not if the source of the ability is a spell on the stack (see 109.2 of the <b>Magic</b> Comprehensive Rules). If you're countering Ulamog's cast trigger, Ulamog is a \"creature spell\" at that point, not a \"creature\", so countering the cast trigger won't cause Ulamog to lose its abilities. If you wanted Ulamog to lose its abilities, you'd have to wait for Ulamog to attack, then use the Tidebinder to counter Ulamog's attack trigger."
  },
  {
    "imgs": [
      "Kaldra Compleat",
      "Tishana's Tidebinder"
    ],
    "q": "I control a 0/0 Germ token equipped with <span class=\"autocard\">Kaldra Compleat</span>. I attack with it, and my opponent blocks with a creature. After damage is dealt, with the combat damage trigger from Kaldra Compleat on the stack, my opponent counters the trigger with <span class=\"autocard\">Tishana's Tidebinder</span>. What happens to my Germ token?",
    "a": "Your token ends up as a 5/5 with no other abilities. Kaldra Compleat gives the combat damage trigger to the creature, so the creature is the source of that trigger, not the Equipment. Your opponent is free to counter the trigger with the Tidebinder, but that means that the Germ token is losing its abilities, not the Equipment. The effect from the Tidebinder does have a later timestamp than the Equipment, so the Germ token loses all of the static and triggered abilities given to it by the Equipment. But the Germ token keeps +5/+5 from Kaldra Compleat, so the Germ token ends up as a 5/5 with no other abilities from the Equipment."
  },
  {
    "imgs": [
      "Warp World",
      "Rampaging Ferocidon"
    ],
    "q": "My opponent just cast <span class=\"autocard\">Warp World</span>, and one of the permanents I put onto the battlefield is <span class=\"autocard\">Rampaging Ferocidon</span>. Will the Ferocidon trigger for any of the other creatures that are put onto the battlefield with Warp World?",
    "a": "Yep, it will. The Ferocidon will see other creatures that enter the battlefield at the same time as the Ferocidon, and it will trigger for all of them. This could result in a lot of damage for some or all players."
  },
  {
    "imgs": [
      "Pili-Pala",
      "Norn's Annex"
    ],
    "q": "My opponent and I are both at 1 life. I have an untapped <span class=\"autocard\">Pili-Pala</span> in play with a bunch of Forests, while my opponent controls a <span class=\"autocard\">Norn's Annex</span>. Can I declare an attack with Pili-Pala and also activate its ability to produce one white mana so I can pay the Annex tax?",
    "a": "Yeah, that actually works. When we're declaring attackers, we tap the creatures we're attacking with first, then we worry about paying additional costs to enable the attack, like the Annex. Since Pili-Pala will become tapped first, we can activate Pili-Pala's untap ability, produce one white mana, and then use that mana to pay to allow for Pili-Pala to attack (and Pili-Pala will still be attacking, even though it's now untapped)."
  },
  {
    "imgs": [
      "Mystic Forge",
      "Blistering Firecat"
    ],
    "q": "Can I use <span class=\"autocard\">Mystic Forge</span> to cast a <span class=\"autocard\">Blistering Firecat</span> from the top of my library?",
    "a": "Yes you can. A face down creature spell is colorless, and Mystic Forge lets you cast colorless spells from the top of your library. Even though the Firecat is red when it's in your library, when you decide to cast it face down, it's colorless, and can be cast via the Forge's ability."
  },
  {
    "imgs": [
      "Grafdigger's Cage",
      "Arcane Proxy"
    ],
    "q": "Will <span class=\"autocard\">Grafdigger's Cage</span> stop me from casting the copy made by <span class=\"autocard\">Arcane Proxy</span>?",
    "a": "It will not. Arcane Proxy doesn't cast the copy from the graveyard - you exile the card first, then make a copy of it. Since Arcane Proxy exiles the card before making the copy, the copy is created and cast from exile. Grafdigger's Cage prevents players from casting spells from the graveyard and library, but not from exile, so you'll be able to cast the copy made by Arcane Proxy."
  },
  {
    "imgs": [
      "Leonin Arbiter",
      "Leyline Binding",
      "Boseiju, Who Endures"
    ],
    "q": "My opponent has my <span class=\"autocard\">Leonin Arbiter</span> exiled to their <span class=\"autocard\">Leyline Binding</span>. If I channel <span class=\"autocard\">Boseiju, Who Endures</span> targeting my opponent's Leyline Binding, will they be able to search for a land?",
    "a": "They won't. When Boseiju's ability resolves, the first thing we do is destroy the Binding. Since the Binding left the battlefield, the exiled Arbiter immediately returns to the battlefield. Then your opponent would search their library for a land, but because you now have Leonin Arbiter in play, they won't be able to search. They don't even get the chance to pay <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"> to ignore the Arbiter's effect, since that's only an action they can take when they have priority, and they don't have priority in the middle of Boseiju's ability resolving. Not only did your opponent lose their Binding, they won't be able to search for a land with the second part of Boseiju's effect."
  },
  {
    "imgs": [
      "Twinning Staff",
      "Spellweaver Helix"
    ],
    "q": "How does <span class=\"autocard\">Twinning Staff</span> work with <span class=\"autocard\">Spellweaver Helix</span>? Will I be able to cast two copies of the other exiled card when the Helix's trigger resolves?",
    "a": "No, there's no interaction here. The Staff's static ability only applies if you're copying a spell on the stack. The Helix doesn't copy a spell on the stack - you copy the card in exile, then you can cast the copy. Since you're not copying a spell on the stack, Twinning Staff won't care about that copy and won't give you two copies of the exiled card to cast."
  },
  {
    "imgs": [
      "Lazav, Dimir Mastermind",
      "Counterspell"
    ],
    "q": "My commander <span class=\"autocard\">Lazav, Dimir Mastermind</span> is in play. My opponent casts their commander, but I counter it with a <span class=\"autocard\">Counterspell</span>. Assuming my opponent wants to move their commander to the command zone, can my Lazav still copy it?",
    "a": "Yep, Lazav can still copy your commander. Your opponent's commander will briefly go to the graveyard before they move it to the command zone when state-based actions are checked. Since it did briefly go to the graveyard, your Lazav will trigger and Lazav will be able to copy your opponent's commander (even if it's not in the graveyard anymore)."
  },
  {
    "imgs": [
      "Carrion Feeder",
      "Rot Hulk"
    ],
    "q": "I have a <span class=\"autocard\">Carrion Feeder</span> in play. Can I cast <span class=\"autocard\">Rot Hulk</span>, then sacrifice the Hulk to the Feeder's ability before its enter-the-battlefield trigger goes on the stack and target the Hulk itself with its enter-the-battlefield trigger?",
    "a": "You cannot. After the Hulk has resolved, before you get a chance to do anything else, you have to put the Hulk's trigger on the stack. Since the trigger targets, you have to choose targets for the ability at that point. But since the Hulk is still on the battlefield when you're choosing targets, it's not a legal target for its trigger, and you won't be able to target the Hulk with its own trigger."
  },
  {
    "imgs": [
      "Shaman of Forgotten Ways",
      "Teferi's Protection"
    ],
    "q": "I have no creatures in play, and my opponent just activated the last ability of <span class=\"autocard\">Shaman of Forgotten Ways</span>. Can I save myself by casting <span class=\"autocard\">Teferi's Protection</span>?",
    "a": "Yep, you can save yourself. Teferi's Protection does a lot of things to protect you and your permanents, and one of those thing is making it so your life total can't change. When the ability of the Shaman resolves, it would try to make your life total 0 (since you control no creatures), but because of the Protection, your life total can't change and it will stay where it's at."
  },
  {
    "imgs": [
      "Myojin of Roaring Blades",
      "Cursed Mirror"
    ],
    "q": "My opponent controls a <span class=\"autocard\">Myojin of Roaring Blades</span>. If I cast <span class=\"autocard\">Cursed Mirror</span> and copy it, will my Mirror enter with an indestructible counter?",
    "a": "As long as you cast Cursed Mirror from your hand, yes. If you cast it from your hand, when you choose to copy the Myojin, since it's now entering as the Myojin, the Myojin's own replacement effect will apply and it will enter with an indestructible counter. You can then activate the Myojin's ability and deal 7 damage to up to three targets. But if you don't activate the ability, once the turn ends and it goes back to being a Cursed Mirror, it still has the indestructible counter on it, and Cursed Mirror will be indestructible."
  },
  {
    "imgs": [
      "Extravagant Replication"
    ],
    "q": "If I have two <span class=\"autocard\">Extravagant Replication</span>s in play, can they target and copy each other?",
    "a": "Yep, you can do that. The Replication can't target itself with its own trigger, but it can still target another Replication. If you'd like, you can have the Replications target each other, and then you'll have four copies of the Replication in play."
  },
  {
    "imgs": [
      "Charismatic Conqueror",
      "Diamond Pick-Axe"
    ],
    "q": "My opponent controls a <span class=\"autocard\">Charismatic Conqueror</span>. If I cast an Equipment like <span class=\"autocard\">Diamond Pick-Axe</span>, can I tap it to the Conqueror's trigger but also activate its equip ability afterwards?",
    "a": "Yep, you can do that. The Pick-Axe is an artifact, so the Pick-Axe entering untapped will cause the Conqueror to trigger. When the trigger resolves, you're free to tap the Pick-Axe to prevent your opponent from getting a token. But tapped Equipment still function fine, so even if the Pick-Axe is tapped, you'll still be able to activate the equip ability and attach it to a creature you control."
  }
]