[
  {
    "imgs": [
      "Phyrexian Censor",
      "Stoke the Flames",
      "Invasion of Mercadia",
      "Kyren Flamewright"
    ],
    "q": "My opponent controls a <span class=\"autocard\">Phyrexian Censor</span>. I cast <span class=\"autocard\">Stoke the Flames</span> to finish off my <span class=\"autocard\">Invasion of Mercadia</span>, but my opponent is saying that I can't cast the back face <span class=\"autocard\">Kyren Flamewright</span>. Are they correct?",
    "a": "Your opponent is correct. The Censor stops you from casting more than one non-Phyrexian spell each turn. When you remove the last defense counter from the Invasion, the Invasion is exiled and you can cast the back side of the Invasion. However, since you defeated the battle by casting a spell, when the Invasion is exiled and you try to cast the Flamewright, you can't because of your opponent's Censor, because you've already cast one non-Phyrexian spell that turn. The Invasion stays in exile and you won't be able to cast it transformed."
  },
  {
    "imgs": [
      "Vorinclex, Monstrous Raider",
      "Invasion of Dominaria"
    ],
    "q": "How does <span class=\"autocard\">Vorinclex, Monstrous Raider</span> interact with <span class=\"autocard\">Invasion of Dominaria</span>? Does the interaction change if I have Vorinclex and my opponent plays the battle?",
    "a": "If you control Vorinclex, he will not like your battles. Since your battle is entering the battlefield with defense counters on it, your Vorinclex is going to apply, and your battles are going to enter with twice as many counters on them, making them that much harder to defeat. For example, Invasion of Dominaria will enter with ten defense counters instead of five. But on the other hand, your opponent is going to love your Vorinclex. Their battles are going to enter with half as many counters, making it that much easier for them to defeat. So if you have Vorinclex in play and your opponent plays Invasion of Dominaria, it'll enter with two defense counters instead of five.\nPerhaps you should leave Vorinclex, Monstrous Raider out of your battle deck."
  },
  {
    "imgs": [
      "Atraxa's Fall"
    ],
    "q": "If I destroy my own battle with <span class=\"autocard\">Atraxa's Fall</span>, will that let me cast the back side?",
    "a": "It does not. Destroying a battle doesn't let you cast the back face - removing the last defense counter from the battle will get you the trigger that lets you cast the back side of the battle. The Fall will get rid of the battle, but will not let its controller cast the back face of the battle."
  },
  {
    "imgs": [
      "Zephyr Singer"
    ],
    "q": "I have ten 2/2 Knight creature tokens in play, and I want to cast <span class=\"autocard\">Zephyr Singer</span>. Can I tap all ten Knights to cast the Singer so they'll all get flying counters?",
    "a": "You cannot. You cannot \"overpay\" for your spell. That includes tapping extra creatures for convoke to help pay for the spell. The Singer costs four mana, so you're normally going to be able to tap four of those Knights to pay for the Singer. You're going to need <i>a lot</i> of cost increasers to make the Singer cost ten mana if you wanted to be able to tap all ten Knights to cast the Singer."
  },
  {
    "imgs": [
      "Stormclaw Rager",
      "Deadly Derision"
    ],
    "q": "I activate the ability of <span class=\"autocard\">Stormclaw Rager</span>, but my opponent kills it in response with <span class=\"autocard\">Deadly Derision</span>. Will I still draw a card?",
    "a": "Yep, you still get to draw. The Rager's ability doesn't target itself, so the Rager not being on the battlefield won't matter. While you can't put a counter on the Rager, you still get to draw a card from its ability."
  },
  {
    "imgs": [
      "Zimone and Dina"
    ],
    "q": "I have seven lands in play, along with <span class=\"autocard\">Zimone and Dina</span>. If I activate their ability and put a land onto the battlefield, do I get to repeat the process?",
    "a": "You do! Zimone and Dina won't count the number of lands you control until after you've chosen to put a land onto the battlefield or not. If you put your eighth land onto the battlefield with the ability, Zimone and Dina will see that you control eight or more lands, and you'll repeat the process once."
  },
  {
    "imgs": [
      "Breach the Multiverse",
      "Naru Meha, Master Wizard"
    ],
    "q": "I cast <span class=\"autocard\">Breach the Multiverse</span>, and one of the cards milled is a <span class=\"autocard\">Naru Meha, Master Wizard</span>. If I return Naru Meha, can I target and copy the Breach?",
    "a": "Nope, you can't do that. Naru Meha's trigger can't go on the stack until after the Breach is done resolving and has left the stack. Since the Breach is no longer on the stack by the time we're able to put Naru Meha's trigger on the stack, you won't be able to target and copy the Breach."
  },
  {
    "imgs": [
      "Quintorius, Loremaster"
    ],
    "q": "If my graveyard is empty, will I still get a 3/2 from <span class=\"autocard\">Quintorius, Loremaster</span> at the end of turn?",
    "a": "No, you will not. The triggered ability of Quintorius targets. If you don't have a noncreature nonland card in your graveyard, you won't be able to choose a legal target for the trigger, that trigger will be removed from the stack, and you will not end up creating the 3/2 Spirit."
  },
  {
    "imgs": [
      "Quintorius, Loremaster"
    ],
    "q": "Can I use the ability of <span class=\"autocard\">Quintorius, Loremaster</span> to cast a permanent spell on my opponent's turn?",
    "a": "Only if that permanent spell has flash. Since Quintorius gives you a time frame to cast the card in (\"this turn\"), it doesn't change when you can cast the spell. Unless you choose a card that has flash, activating the ability of Quintorius on your opponent's turn won't let you cast the spell on your opponent's turn."
  },
  {
    "imgs": [
      "Archpriest of Shadows"
    ],
    "q": "I control a 4/4 <span class=\"autocard\">Archpriest of Shadows</span>, which has gained trample. I attack with the Archpriest, and my opponent blocks with their 6/2, killing both creatures. Can I target and return the Archpriest with its own trigger?",
    "a": "You sure can. Since the Archpriest has trample, the Archpriest can deal combat damage to the opponent, even if it's taking lethal damage at the same time. After damage is dealt, we check state-based actions, and the Archpriest and the 6/2 will die. After that, we can put the Archpriest's trigger on the stack. The Archpriest itself is in the graveyard at this point, so you can target the Archpriest and use its combat damage trigger to return itself to the battlefield."
  },
  {
    "imgs": [
      "Hidetsugu and Kairi"
    ],
    "q": "I control <span class=\"autocard\">Hidetsugu and Kairi</span>, and I play a second <span class=\"autocard\">Hidetsugu and Kairi</span>. What happens?",
    "a": "You're going to get two triggers here - you'll get the enter the battlefield trigger from the second Hidetsugu and Kairi entering the battlefield, and you'll get the dies trigger from the Hidetsugu and Kairi that dies to the legend rule. Those triggers are both waiting to go on the stack once we check state-based actions and one of the Hidetsugu and Kairis dies to the legend rule. And since you control both of those triggers, you choose the order they're put on the stack, and can resolve the enter the battlefield trigger first and know what card you'll reveal to the dies trigger."
  },
  {
    "imgs": [
      "Tribute to the World Tree",
      "Birds of Paradise"
    ],
    "q": "If I have two copies of <span class=\"autocard\">Tribute to the World Tree</span> in play, what happens when I cast a creature?",
    "a": "When the creature enters, both Tributes will trigger. But each trigger will check the power of the creature only when the trigger resolves - it doesn't matter what the creature's power was when it entered the battlefield. \nIf the creature's power is 3 or greater when each trigger resolves, then both Tribute triggers will have you draw a card. If the creature's power is 1 or 2 as it entered, when the first trigger resolves, the creature gets two +1/+1 counters, and the second trigger will have you draw a card (since it now has a power of 3 or more). Finally, if the creature had a power of 0 or less — I'm looking at you, <span class=\"autocard\">Birds of Paradise</span> — it will end up getting a total of four +1/+1 counters, two from each trigger."
  },
  {
    "imgs": [
      "City on Fire"
    ],
    "q": "I control <span class=\"autocard\">City on Fire</span> and a 5/5 creature with trample. My opponent blocks with a 3/3 creature. What happens when we deal combat damage?",
    "a": "When we assign damage, we don't take effects that would increase or decrease the damage, like City on Fire, into account to determine if a creature has lethal damage assigned to it. When you assign damage, the 5/5 has to assign at least 3 damage to the 3/3 and can assign the remaining 2 damage to the defending player. You can't assign just 1 damage to the blocker, knowing the damage will be tripled later on, since we can't take its replacement effect into account when we're assigning damage. The net result is that the blocking 3/3 will take a total of 9 damage and the opponent will take 6 damage from your creature."
  },
  {
    "imgs": [
      "Omnath, Locus of Mana",
      "Omnath, Locus of All"
    ],
    "q": "If I control <span class=\"autocard\">Omnath, Locus of Mana</span> and <span class=\"autocard\">Omnath, Locus of All</span>, what happens to my green mana as steps and phases end? Will it become black mana?",
    "a": "Nope, it'll stay green. The Locus of All will only apply if the unspent mana would leave your mana pool. But the Locus of Mana will prevent you from losing your green mana as steps and phases end. Since you never lose the unspent green mana, the Locus of All won't do anything to that mana and the green mana will remain green mana."
  },
  {
    "imgs": [
      "Thassa's Oracle",
      "Demonic Consultation",
      "See Double"
    ],
    "q": "My opponent just cast and resolved a <span class=\"autocard\">Thassa's Oracle</span>, and in response to its enter the battlefield trigger, cast <span class=\"autocard\">Demonic Consultation</span>. Can I steal the win by casting <span class=\"autocard\">See Double</span> in response and copy the Oracle and Consultation and win the game before they can?",
    "a": "Sorry, that doesn't work - they're going to resolve in the wrong order. When we resolve See Double, we make the copy of the spell first, putting the copy of the spell on the stack, and then we make the copy of the target creature. Once See Double is done resolving, your copy of the Consultation is on the stack, but the trigger from your token Oracle goes on the stack above the Consultation. The trigger from your Oracle will resolve first, before your copy of the Consultation resolves, and you won't be able to use your copy of the Consultation to exile your library before your token Oracle's trigger resolves."
  },
  {
    "imgs": [
      "Path of the Animist"
    ],
    "q": "What happens if I cast <span class=\"autocard\">Path of the Animist</span> but we're not in a Planechase game?",
    "a": "Not much. If you're not in a Planechase game, you can't planeswalk or have chaos ensue, so the <i>Will of the Planeswalkers</i> part of the spell won't do anything. Technically, a vote will happen, but the result of that vote won't matter. You can still play the Path if you're interested in the first part of the effect, but you can effectively ignore the last half of the effect if you're not playing Planechase."
  },
  {
    "imgs": [
      "Conclave Sledge-Captain"
    ],
    "q": "I have a 2/2 creature in play. I cast <span class=\"autocard\">Conclave Sledge-Captain</span> and choose my 2/2 creature as the target for all three of the Sledge-Captain's backup triggers. If it attacks and isn't blocked, what happens?",
    "a": "Since your 2/2 was the target for all three Sledge-Captain triggers, it will get a total of three +1/+1 counters and it will have trample three times (which doesn't do much more than having it once) and three instances of the combat damage trigger. Each of those triggers will trigger when it deals combat damage. Since the creature dealt 5 damage in combat, each trigger will add five more +1/+1 counters to original creature, for a total of fifteen additional +1/+1 counters, bringing the creature up to a 20/20."
  },
  {
    "imgs": [
      "Laelia, the Blade Reforged",
      "Dance with Calamity"
    ],
    "q": "I have a <span class=\"autocard\">Laelia, the Blade Reforged</span> in play. If I cast <span class=\"autocard\">Dance with Calamity</span>, how many counters will Laelia get?",
    "a": "You get a Laelia trigger for each card you exile. You don't announce ahead of time how many cards you want to exile to the Dance - exile one card, then you have the option of either exiling another card or choosing not to exile and move on to the next part o the Dance resolving. Since we don't know ahead of time how many cards you'll exile, you exile the cards one at time, and Laelia triggers for each card you exiled to the Dance."
  },
  {
    "imgs": [
      "Chandra, Hope's Beacon"
    ],
    "q": "How does <span class=\"autocard\">Chandra, Hope's Beacon</span>'s -X work in Two-Headed Giant? Could I target both heads on the opposing team?",
    "a": "Yep, you can do that. While the players make up one team, they're still individual players, and each one can be targeted. For example, you could play Chandra, then immediately activate her last ability with X=5, and deal 5 damage to the two players on the opposing team, and their team's life total will go down by 10."
  },
  {
    "imgs": [
      "Invasion of Moag"
    ],
    "q": "Vaan and Penelo are teaming together in a game of Two-Headed Giant, going up against the team of Balthier and Fran. Vaan plays <span class=\"autocard\">Invasion of Moag</span> and chooses for Balthier to defend the battle. If Vaan attacks the Invasion of Moag, can Fran choose to block the creatures attacking the Invasion, or can only Balthier block it?",
    "a": "Both Balthier and Fran can block. Since Balthier and Fran are on a team, they block as a team. They can block anything that's attacking them, a planeswalker that either one of them controls, or a battle that either one of them is defending. So Fran will be able to block a creature that's attacking a battle being defended by Balthier, since they block as a team."
  }
]