[
  {
    "imgs": [
      "Niv-Mizzet, Supreme",
      "Fire // Ice"
    ],
    "q": "If I control <span class=\"autocard\">Niv-Mizzet, Supreme</span>, can I jump-start <span class=\"autocard\">Fire // Ice</span> from my graveyard?",
    "a": "Oddly enough, no. In your graveyard, Fire//Ice has the characteristics of both halves, so it is an instant card that's exactly two colors and Niv-Mizzet gives it jump-start. However, as you start to cast the card, you have to choose one half to cast, and only that half is evaluated to check if you can cast it. Since each half is mono-colored, it doesn't have jump-start after all, so you can't cast either half."
  },
  {
    "imgs": [
      "Ayara's Oathsworn"
    ],
    "q": "If <span class=\"autocard\">Ayara's Oathsworn</span> already has four +1/+1 counters on it when it deals combat damage, does the second part of its ability still happen?",
    "a": "No. Ayara's Oathsworn's ability has an intervening if clause that checks the condition at the moment the ability would trigger, and if the condition isn't true at that moment, the ability doesn't trigger at all. Since Ayara's Oathsworn has four +1/+1 counters on it, the condition is not true, so the ability doesn't trigger at all and none of its effects happen."
  },
  {
    "imgs": [
      "Ob Nixilis, Captive Kingpin",
      "Ad Nauseam"
    ],
    "q": "Does <span class=\"autocard\">Ob Nixilis, Captive Kingpin</span>'s ability trigger when my opponent resolves <span class=\"autocard\">Ad Nauseam</span>?",
    "a": "It can, as long as your opponent reveals at least one card with mana value 1. Your opponent reveals each card individually and loses life equal to each card's mana value in distinct events. Every time that amount is 1, Ob Nixilis's ability triggers. All those triggers go on the stack after Ad Nauseam is done resolving, and then the triggers resolve one by one."
  },
  {
    "imgs": [
      "Ob Nixilis, Captive Kingpin",
      "Rakdos Charm"
    ],
    "q": "If I control <span class=\"autocard\">Ob Nixilis, Captive Kingpin</span> and use the third mode of <span class=\"autocard\">Rakdos Charm</span>, does that trigger Ob Nixilis's ability?",
    "a": "Only if your opponent loses exactly 1 life as the result of the damage, for example if your opponent only controls one creature, or if they control multiple creatures but only one of them doesn't have infect. If they control multiple creatures that deal plain damage that results in loss of life, all that damage is dealt at the same time and causes the total loss of life in one event that's not exactly 1, so it doesn't trigger Ob Nix's ability."
  },
  {
    "imgs": [
      "Ob Nixilis, Captive Kingpin"
    ],
    "q": "I control <span class=\"autocard\">Ob Nixilis, Captive Kingpin</span> and deal combat damage to my opponent with ten 1/1 creatures. Does Ob Nixilis's ability trigger ten times?",
    "a": "I'm afraid not, and the reason is very similar to the previous question. Unless first strike or double strike are involved, all combat damage is dealt at the same time and all results of that damage happen in one combined event. While it's true that damage from multiple creatures with lifelink causes separate simultaneous life-gain events, no such rule exists for the life-loss part of the damage. If you can get one of the 1/1s to deal damage by itself, for example by giving it first strike, you'll get one trigger from Ob Nixilis, but that's still much less than the ten triggers you're hoping for."
  },
  {
    "imgs": [
      "Calix, Guided by Fate",
      "Strionic Resonator"
    ],
    "q": "<span class=\"autocard\">Calix, Guided by Fate</span> deals combat damage to my opponent, so its ability triggers. Can I copy the ability with <span class=\"autocard\">Strionic Resonator</span> and make two token copies of something?",
    "a": "No, that doesn't work. Strionic Resonator creates another instance of the same triggered ability with the same source, which is Calix. Once you choose to make a token with one instance of that ability, other instances of the same ability do nothing."
  },
  {
    "imgs": [
      "Calix, Guided by Fate",
      "Helm of the Host"
    ],
    "q": "What if I equip <span class=\"autocard\">Calix, Guided by Fate</span> with <span class=\"autocard\">Helm of the Host</span>, and both the original Calix and its non-legendary copy deal combat damage. Do I get to use both triggers?",
    "a": "Yes, that works. In that case, you have two very similar abilities on the stack, but they come from different sources, so they track their \"do this only once each turn\" restrictions separately."
  },
  {
    "imgs": [
      "Feast of the Victorious Dead"
    ],
    "q": "I control <span class=\"autocard\">Feast of the Victorious Dead</span> and no creatures have died yet this turn. Can I sacrifice a creature in my end step in response to its ability to enable its effect?",
    "a": "No, this is another example of a triggered ability with an intervening-if clause. Since the condition wasn't true at the time the ability would have triggered, it didn't trigger at all when your end step began, so there is no ability on the stack that you're responding to."
  },
  {
    "imgs": [
      "Inkmoth Nexus",
      "Jolrael, Voice of Zhalfir"
    ],
    "q": "If I control an animated <span class=\"autocard\">Inkmoth Nexus</span>, can I use <span class=\"autocard\">Jolrael, Voice of Zhalfir</span>'s first ability to turn it into an X/X that still has infect?",
    "a": "Yes, that works. The effect from Jolrael's triggered ability adds abilities, so Inkmoth Nexus won't lose infect. The part of the effect that sets the base power and toughness to X/X has the newer timestamp, so it overwrites the 1/1 from Inkmoth Nexus's own animation effect."
  },
  {
    "imgs": [
      "Narset, Enlightened Exile",
      "Secrets of the Dead"
    ],
    "q": "I use <span class=\"autocard\">Narset, Enlightened Exile</span>'s attack ability to cast a copy of some card in my graveyard. Does this trigger <span class=\"autocard\">Secrets of the Dead</span>?",
    "a": "No. Narset's ability instructs you to exile the card and copy it, and then you may cast the copy. This means that you're casting the copy from the exile zone, not from your graveyard."
  },
  {
    "imgs": [
      "Narset, Enlightened Exile",
      "Arcane Bombardment",
      "Grapeshot"
    ],
    "q": "Does <span class=\"autocard\">Narset, Enlightened Exile</span> trigger when I cast copies of exiled cards with <span class=\"autocard\">Arcane Bombardment</span>?",
    "a": "Absolutely. Prowess cares about the verb, <i>cast</i>, it doesn't care whether the spell you're casting is represented by a physical card, so casting a copy of a noncreature card works just fine for triggering prowess. On the other hand, copying a spell — for example with <span class=\"autocard\">Grapeshot</span> — does not trigger prowess, because the spell is copied directly on the stack without ever being cast."
  },
  {
    "imgs": [
      "Tranquil Frillback",
      "Fiery Confluence"
    ],
    "q": "<span class=\"autocard\">Tranquil Frillback</span>'s enter-the-battlefield ability is resolving and I pay <img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\">. Can I choose the first mode three times?",
    "a": "No, that doesn't work. A modal ability that allows you to choose the same mode more than once will say so explicitly, like <span class=\"autocard\">Fiery Confluence</span>. Tranquil Frillback's ability doesn't do that, so you can only choose each mode at most once."
  },
  {
    "imgs": [
      "Nahiri, Forged in Fury",
      "Krosan Grip"
    ],
    "q": "My opponent controls four Equipment and casts <span class=\"autocard\">Nahiri, Forged in Fury</span> for <img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/W.png\" class=\"mana\">. Can I counter Nahiri by destroying one of my opponent's Equipment with <span class=\"autocard\">Krosan Grip</span>?",
    "a": "No. By the time you get to respond to Nahiri, the cost to cast it has already been calculated, locked in, and paid, and Nahiri has been cast. The fact that Krosan Grip has split second doesn't help you, either, since that doesn't mean that you get to interrupt your opponent's spell-casting process. Even Krosan Grip has to wait until you have priority, and at that point it's too late to change how much your opponent has to pay to cast Nahiri."
  },
  {
    "imgs": [
      "Kiora, Sovereign of the Deep",
      "Gold-Forged Thopteryx",
      "Stifle"
    ],
    "q": "If I control <span class=\"autocard\">Kiora, Sovereign of the Deep</span> and <span class=\"autocard\">Gold-Forged Thopteryx</span>, does Kiora have ward <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">?",
    "a": "Almost, but not exactly. Kiora has ward <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"> <i>and</i> ward <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"> in this situation, which works very similarly to ward <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">, but there is a subtle difference. Each instance of ward triggers and resolves separately, and your opponent will have to pay a total of <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\"> if they want to get their spell or ability past both wards. If they have a <span class=\"autocard\">Stifle</span> in their hand, they can Stifle one of the ward triggers, but they'll still have to satisfy the other one. If Kiora had just one instance of ward <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">, your opponent could Stifle the whole thing."
  },
  {
    "imgs": [
      "Markov Baron"
    ],
    "q": "Can I use convoke to pay <span class=\"autocard\">Markov Baron</span>'s madness cost?",
    "a": "Absolutely. Convoke is not an alternative cost to cast the spell, it is an ability that allows you to pay for the mana symbols in the spell's total cost in a different way. It doesn't matter whether that total cost was based on the spell's normal mana cost or from an alternative cost such as madness."
  },
  {
    "imgs": [
      "Arni Metalbrow"
    ],
    "q": "If <span class=\"autocard\">Arni Metalbrow</span> attacks, can I pay <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"> multiple times to put that many creatures onto the battlefield tapped and attacking?",
    "a": "Kind of, but you have to be careful about how exactly you do this. Arni's attack triggers its triggered ability, and when it resolves, you choose whether to pay <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"> or not. If you choose to pay, you get to put a creature with mana value less than 3 onto the battlefield tapped and attacking. This triggers Arni's ability again, and again you choose whether to pay <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"> or not. If you choose to pay, you get to put another creature onto the battlefield tapped and attacking, but its mana value has to be less than that of the creature you put onto the battlefield with the first trigger. This process repeats with ever-decreasing mana values until you either stop paying or you get to mana value 0 and it's impossible to choose a creature with mana value less than 0."
  },
  {
    "imgs": [
      "Campus Renovation"
    ],
    "q": "Can I play a sorcery that was exiled with <span class=\"autocard\">Campus Renovation</span> on my opponent's turn?",
    "a": "No. Campus Renovation creates a continuous effect with a duration, \"until the end of your next turn\", that allows you to play the exiled cards from an unusual zone, namely from the exile zone, but it doesn't allow you to play those cards at an unusual time. You still have to follow all applicable timing rules when you play the exiled cards."
  },
  {
    "imgs": [
      "Tazri, Stalwart Survivor"
    ],
    "q": "Suppose I control <span class=\"autocard\">Tazri, Stalwart Survivor</span> and a non-legendary copy of it, and I control a vanilla 1/1 creature. Can I activate the 1/1 creature's ability to make mana of any color?",
    "a": "Absolutely. The creature has two distinct instances of the ability that each Tazri grants it, so each ability sees that the creature has another activated ability. The fact that the two abilities have exactly the same wording doesn't matter."
  },
  {
    "imgs": [],
    "q": "So, in which formats is <i>Aftermath</i> legal?",
    "a": "Although it's only a \"mini set\", it is an actual set release that is legal in all Constructed formats. It's legal in Standard until it rotates out, it's legal in the non-rotating formats such as Modern, and of course it's legal in eternal formats such as Legacy."
  },
  {
    "imgs": [],
    "q": "Can I run an <i>Aftermath</i> Draft tournament?",
    "a": "Most signs point to \"no.\" The set was not designed to be played in Limited tournaments, and the Magic Tournament Rules state that <i>March of the Machine: The Aftermath</i> should not be used for Premier Play or other competitive Limited tournaments. None of this actually stops you from running a casual or Regular REL <i>Aftermath</i> draft, but you'll need to think carefully about whether this would be a fun experience. Since the booster packs contain very few cards, you'd have to give each player more than three packs to get a decently sized card pool. Alternatively, you could run a draft with some number of <i>March of the Machine</i> and some number of <i>Aftermath</i> boosters. As far as I can tell, that would be legal, but I have no idea if it would be fun. If you're feeling adventurous and can get enough like-minded players together, maybe give it a try and let us know how it goes."
  }
]