[
  {
    "imgs": [
      "Banishing Light",
      "Elesh Norn, Mother of Machines"
    ],
    "q": "Can I use <span class=\"autocard\">Banishing Light</span> to exile my opponent's <span class=\"autocard\">Elesh Norn, Mother of Machines</span>?",
    "a": "No, that won't work. Banishing Light's exile effect happens due to its enter-the-battlefield ability, and your opponent's Elesh Norn shuts down all enter-the-battlefield abilities of your permanents. You can play Banishing Light, but it'll just sit uselessly on the battlefield."
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines",
      "Jailbreak"
    ],
    "q": "If I control <span class=\"autocard\">Elesh Norn, Mother of Machines</span> and cast <span class=\"autocard\">Jailbreak</span> to return a card from my opponent's graveyard to the battlefield, do I then get to return two cards from my graveyard?",
    "a": "No. While Jailbreak has a reflexive trigger that triggers when a permanent enters the battlefield, Elesh Norn only causes triggered abilities of permanents you control to trigger an additional time. The resolving Jailbreak is a sorcery on the stack, not a permanent on the battlefield, so its trigger is not affected by Elesh Norn's ability."
  },
  {
    "imgs": [
      "Aboroth",
      "All Will Be One"
    ],
    "q": "I control an <span class=\"autocard\">Aboroth</span> with one age counter on it, and I also control <span class=\"autocard\">All Will Be One</span>. Aboroth's cumulative upkeep triggers, and I know I get one trigger for 1 damage for putting on the age counter, but how many triggers do I get for putting the -1/-1 counters on Aboroth?",
    "a": "You pay the entire cumulative upkeep cost in one action, so you put two -1/-1 counters on Aboroth, which constitutes one event in which you put one or more counters on a permanent. This means you get one trigger that deals 2 damage, which is bad news for you if you were hoping to mow down two 1/1s."
  },
  {
    "imgs": [
      "Portal to Phyrexia",
      "Phyrexian Censor"
    ],
    "q": "I control <span class=\"autocard\">Portal to Phyrexia</span> and <span class=\"autocard\">Phyrexian Censor</span>. When the Portal's second ability resolves and I choose a creature that's not normally a Phyrexian, does it enter the battlefield tapped or untapped?",
    "a": "It'll enter untapped. The Portal's effect causes the creature to enter the battlefield as a Phyrexian, as opposed to putting it onto the battlefield first and then turning it into a Phyrexian. Since it enters the battlefield as a Phyrexian, Phyrexian Censor is not interested in making it enter the battlefield tapped."
  },
  {
    "imgs": [
      "Invasion of Tarkir",
      "Kolaghan's Command"
    ],
    "q": "I cast <span class=\"autocard\">Invasion of Tarkir</span> and I have one other card in my hand. The Invasion's enter-the-battlefield ability resolves and I reveal the last card in my hand, which is a Dragon card. My opponent responds to the damage trigger with <span class=\"autocard\">Kolaghan's Command</span> to make me discard that card. Does the damage trigger deal 2 or 3 damage?",
    "a": "It still deals 3 damage, since the reflexive trigger only cares about how many cards you chose to reveal. It doesn't care how many of those cards are still in your hand when the reflexive trigger resolves. In order to prevent you from revealing the card, your opponent would have to respond to the enter-the-battlefield ability itself, before they know for sure whether that last card in your hand is a Dragon card. We'll just assume that you gave your opponent the chance to do that and they chose not to. If you rushed things and revealed your Dragon card without giving your opponent the chance to respond to the enter-the-battlefield ability, a judge would most likely rewind the game to allow your opponent to respond to the enter-the-battlefield ability."
  },
  {
    "imgs": [
      "Hoarding Broodlord"
    ],
    "q": "If I control two <span class=\"autocard\">Hoarding Broodlord</span>s, do the spells I cast from exile have double convoke? If so, does that halve the number of creatures I have to tap to pay for those spells?",
    "a": "Yes and no. The spells you cast from exile will have two instances of convoke, but that doesn't do anything more than just having one instance of convoke. Convoke isn't a triggered ability that makes mana when you tap creatures. It's a static ability that allows you to pay for mana symbols in the spell's total cost by other means, and having two instances of that ability is redundant."
  },
  {
    "imgs": [
      "Rakdos, Lord of Riots",
      "Elder Brain",
      "Child of Alara",
      "Wastes"
    ],
    "q": "I control <span class=\"autocard\">Rakdos, Lord of Riots</span> and my opponents have lost life, so the cost reduction effect is active. If I cast a creature card that was exiled with <span class=\"autocard\">Elder Brain</span>, can I apply the cost reduction from Rakdos to the colored mana symbols in its mana cost?",
    "a": "No. Rakdos's cost reduction effect only applies to the generic part of the mana in the spell's cost. Elder Brain allows you to spend mana for that spell as though it were mana of any color, but it doesn't actually change the cost of the spell to generic mana. For example, if the spell you cast is <span class=\"autocard\">Child of Alara</span>, its cost is still <img src=\"/ci-reader/images/symbols/W.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/U.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/B.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/G.png\" class=\"mana\">, not <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">. Elder Brain's effect just means that you could tap five Mountains (or five <span class=\"autocard\">Wastes</span>, for that matter) and use the resulting mana to pay that cost."
  },
  {
    "imgs": [
      "Jinnie Fay, Jetmir's Second",
      "White Sun's Twilight"
    ],
    "q": "If I control <span class=\"autocard\">Jinnie Fay, Jetmir's Second</span> and make some tokens with <span class=\"autocard\">White Sun's Twilight</span>, do those tokens still have toxic 1?",
    "a": "I have good news and bad news for you. The bad news is that the tokens don't have toxic 1. The good news is that they don't have \"this creature can't block\", either. An effect that creates a token defines the token's base characteristics, and it might also set up additional effects or include additional instructions. Jinnie Fay replaces the base characteristics and leaves the additional effects and instructions alone. However, toxic 1 and the can't block ability are all part of the base characteristics that White Sun's Twilight defines, so Jinnie Fay replaces those with the characteristics of a hasty Cat or vigilant Dog."
  },
  {
    "imgs": [
      "Eyes of Gitaxias",
      "Jinnie Fay, Jetmir's Second"
    ],
    "q": "What about <span class=\"autocard\">Eyes of Gitaxias</span>? Do they still get +1/+1 counters if <span class=\"autocard\">Jinnie Fay, Jetmir's Second</span> causes them to be Cats or Dogs instead?",
    "a": "Yes. Incubate N means \"create an Incubator token that enters the battlefield with N +1/+1 counters on it.\" The part that makes the token enter the battlefield with +1/+1 counters is not an ability that's given to the token, it's an additional instruction to you that you carry out as you create the token. Jinnie Fay's replacement effect leaves that additional instruction alone, so you're getting a Cat or Dog with N +1/+1 counters on it."
  },
  {
    "imgs": [
      "Bell Borca, Spectral Sergeant"
    ],
    "q": "Does <span class=\"autocard\">Bell Borca, Spectral Sergeant</span>'s power reset to 0 when I pass the turn?",
    "a": "I'm afraid so. Once a new turn begins, \"this turn\" now refers to a turn in which no mana values have been noted yet. Therefore, \"the greatest number noted for it this turn\" is an undefined quantity, so the game uses 0 until a card gets exiled and its mana value gets noted during this new turn."
  },
  {
    "imgs": [
      "Bitter Ordeal"
    ],
    "q": "Does <span class=\"autocard\">Bitter Ordeal</span> count tokens that were put into a graveyard?",
    "a": "Absolutely. The gravestorm ability counts how many permanents were put into a graveyard this turn. Tokens are indeed permanents, and even though they cease to exist shortly after arriving in the graveyard, they do go to the graveyard before they cease to exist."
  },
  {
    "imgs": [
      "Vulturous Zombie"
    ],
    "q": "Does <span class=\"autocard\">Vulturous Zombie</span> trigger off of Treasure tokens or Clue tokens being sacrificed?",
    "a": "No. Unlike the gravestorm ability, Vulturous Zombie's ability triggers whenever a <i>card</i> is put into an opponent's graveyard from anywhere. Tokens are permanents, but they aren't cards."
  },
  {
    "imgs": [
      "Shu Yun, the Silent Tempest",
      "Murder",
      "Bolt Bend",
      "Stifle"
    ],
    "q": "I control a 3/2 <span class=\"autocard\">Shu Yun, the Silent Tempest</span> and an untapped Mountain. My opponent tries to <span class=\"autocard\">Murder</span> Shu Yun. If I cast <span class=\"autocard\">Bolt Bend</span> in response, does Shu Yun's prowess kick in early enough so that I can cast Bolt Bend for just <img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\">?",
    "a": "No. In order to cast Bolt Bend, you have to announce the spell, put it on the stack, announce its target, calculate its cost, and pay its cost, and only then does prowess trigger. And then players get to respond to prowess, and if they don't <span class=\"autocard\">Stifle</span> prowess, it'll resolve, and that's when Shu Yun grows to 4/3. At the time you calculate the cost for Bolt Bend, Shu Yun is only 3/2, so you have to pay the full price for Bolt Bend, which means that you can't cast Bolt Bend if you only have one <img src=\"/ci-reader/images/symbols/R.png\" class=\"mana\"> available."
  },
  {
    "imgs": [
      "Blessed Sanctuary",
      "Murder",
      "Lightning Bolt"
    ],
    "q": "Does <span class=\"autocard\">Blessed Sanctuary</span> stop <span class=\"autocard\">Murder</span>?",
    "a": "No. While it is possible to cause a creature to be destroyed by dealing enough damage to it, destroying a creature is not the same as dealing damage to it. In order to be prevented by Blessed Sanctuary, a spell has to use the phrase \"deal damage\", such as <span class=\"autocard\">Lightning Bolt</span>. Murder simply instructs its controller to destroy the creature, so it's not prevented by Blessed Sanctuary."
  },
  {
    "imgs": [
      "Liesa, Forgotten Archangel",
      "Murder"
    ],
    "q": "If I control <span class=\"autocard\">Liesa, Forgotten Archangel</span>, can I <span class=\"autocard\">Murder</span> a creature with indestructible by exiling it instead?",
    "a": "No. Liesa doesn't rewrite Murder from \"destroy target creature\" to \"exile target creature\". Its ability simply watches the game for any events in which a creature would die, and any such events get modified at the moment they're happening so that the creature is exiled instead. This means that Liesa's effect only kicks in if an effect would actually attempt to destroy a creature. If a creature is indestructible, destroying it is impossible, so the event that Liesa is supposed to replace is not happening in the first place. You can still target the creature with Murder, but Murder does nothing to it."
  },
  {
    "imgs": [
      "Ichormoon Gauntlet",
      "Cosima, God of the Voyage"
    ],
    "q": "Can I use <span class=\"autocard\">Ichormoon Gauntlet</span>'s triggered ability to give extra voyage counters to an exiled <span class=\"autocard\">Cosima, God of the Voyage</span>?",
    "a": "No, that won't work. Ichormoon Gauntlet's ability targets a permanent, and permanents only exist on the battlefield. Your exiled Cosima is a permanent card, but it's not a permanent."
  },
  {
    "imgs": [
      "Thousand Winds",
      "Flicker"
    ],
    "q": "If I control a face-down <span class=\"autocard\">Thousand Winds</span> and <span class=\"autocard\">Flicker</span> it, does that trigger Thousand Winds's turned-face-up ability?",
    "a": "No. Thousand Winds's ability only triggers if it goes from being face down to being face up while it's on the battlefield. With Flicker, Thousand Winds goes from being face-down on the battlefield to being face-up in the exile zone, and then it is returned to the battlefield as a new object that's a face-up Thousand Winds. This new object was not turned face up, it just arrived on the battlefield face-up."
  },
  {
    "imgs": [
      "Command the Dreadhorde",
      "Eternal Witness"
    ],
    "q": "If I use <span class=\"autocard\">Command the Dreadhorde</span> to return <span class=\"autocard\">Eternal Witness</span> from my graveyard to the battlefield, can I use Eternal Witness's ability to return the same Command the Dreadhorde to my hand?",
    "a": "Absolutely. Command the Dreadhorde resolves and puts Eternal Witness onto the battlefield. This triggers Eternal Witness's enter-the-battlefield ability, but that ability only goes on the stack after Command the Dreadhorde has finished resolving and has gone to the graveyard. When Eternal Witness's enter-the-battlefield ability goes on the stack, Command the Dreadhorde is in your graveyard, so it is a legal target for the ability."
  }
]