[
  {
    "imgs": [
      "Orcish Bowmasters"
    ],
    "q": "</b></span>  Let's say I control an <span class=\"autocard\">Orcish Bowmasters</span> and it somehow phases out. While it's phased out, I amass Orcs again, so I get a new Orc Army token. What happens if I amass Orcs again after the first Orc Army token phases back in?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: The first token ceased to exist when it phased out, so it doesn't phase back in, and you put additional counters on the second token.<br>\nB: When the first token phases back in, you have to choose one to keep and sacrifice the other, and you put additional counters on the token you keep.<br>\nC: You now have two Orc Army tokens, and you choose one of them to get the additional counters.<br>\nD: You now have two Orc Army tokens, and both of them get the additional counters.<br>\nE: The first token went through a phase, but it's feeling much better now.<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>C.</b><br>\n<br>\nOnce upon a time, phased out tokens ceased to exist, but that's no longer the case. The first token phases back in, and there's no reason why you can't control more than one Army token at the same time, so you now control two Orc Army tokens. When you amass Orcs the next time, you don't create another Orc Army token because you already control at least one, and then you choose an Army creature you control and put +1/+1 counters on it.<br>\n<br>\n"
  },
  {
    "imgs": [
      "Reanimate",
      "Dire Wolves",
      "Act of Treason"
    ],
    "q": "</b></span>  In a four-player Commander game, Arya <span class=\"autocard\">Reanimate</span>d Bran's <span class=\"autocard\">Dire Wolves</span>. Later, Bran steals his Wolves back with <span class=\"autocard\">Act of Treason</span> and kills Arya with it. What happens at the end of the turn when Act of Treason's effect wears off?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: Nothing happens, the Dire Wolves already left the game when Arya left the game.<br>\nB: Bran retains control of the Dire Wolves because he owns the card.<br>\nC: Bran retains control of the Dire Wolves because he was its most recent controller.<br>\nD: Dire Wolves is exiled because its default controller has left the game.<br>\nE: Hodor gains control of Dire Wolves because Hodor.<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>D.</b><br>\n<br>\nWhen a player leaves the game, all the cards they owned leave the game, too, but Arya did not own the Dire Wolves, Bran did. Arya was its default controller, though, because she put it onto the battlefield under her control with Reanimate. Once Act of Treason's effect wears off, there are no control-changing effects giving it to some other player, so the Dire Wolves should be controlled by its default controller, which is Arya. Since Arya has left the game, rule 800.4c kicks in and the Dire Wolves gets exiled.<br>\n"
  },
  {
    "imgs": [
      "Tayam, Luminous Enigma",
      "Phyrexian Tower",
      "Wastes"
    ],
    "q": "</b></span>  I control <span class=\"autocard\">Tayam, Luminous Enigma</span>, an untapped <span class=\"autocard\">Phyrexian Tower</span>, an untapped <span class=\"autocard\">Wastes</span>, and an Orc Army token with three +1/+1 counters on it. Can I activate Tayam's ability by removing the counters from the Orc Army, tapping the Wastes, and sacrificing the Orc Army to Phyrexian Tower for mana?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: Yes.<br>\nB: No.<br>\nE: Options C and D have gone to the beach to cool off.<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>B.</b><br>\n<br>\nYou might think that this is possible because the activation cost can be paid in any order, but there is a difference between activating a mana ability and paying mana. During the process of activating an ability, you eventually calculate the total cost, then you get a chance to activate mana abilities, and finally you pay the total cost. This order forces you to sacrifice your Orc Army for mana before you start to pay the activation cost, which means that you no longer control the Orc Army by the time you try to remove the three +1/+1 counters from it.<br>\n"
  },
  {
    "imgs": [
      "Elminster",
      "Sigiled Starfish",
      "Augury Owl"
    ],
    "q": "</b></span>  I control <span class=\"autocard\">Elminster</span>, and I use <span class=\"autocard\">Sigiled Starfish</span> to scry 1, then I cast <span class=\"autocard\">Augury Owl</span> to scry 3, and finally I activate Elminster's +2 ability to draw a card and scry 2. How much less does my next instant or sorcery cost to cast?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"><br>\nB: <img src=\"/ci-reader/images/symbols/2.png\" class=\"mana\"><br>\nC: <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"><br>\nD: <img src=\"/ci-reader/images/symbols/6.png\" class=\"mana\"><br>\nE: I'm sorry, Moko is singing \"Don't scry for me, Argentina\", and I can't focus on answering your question.<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>D.</b><br>\n<br>\nEach time you scry, Elminster's first ability triggers, and the resolution creates a cost-reducing effect that applies to the next instant or sorcery you cast this turn. Since you aren't casting an instant or sorcery spell in between any of those scry triggers, you end up creating three separate cost-reducing effects that all apply to the same spell. The effects are cumulative and add up to a total reduction by <img src=\"/ci-reader/images/symbols/6.png\" class=\"mana\">.<br>\n"
  },
  {
    "imgs": [
      "Mayhem Devil"
    ],
    "q": "</b></span>  Which of these can <span class=\"autocard\">Mayhem Devil</span> deal damage to?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: Players<br>\nB: Creatures<br>\nC: Planeswalkers<br>\nD: Battles<br>\nE: My self esteem<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>A, B, C, and D.</b><br>\n<br>\n\"Any target\" essentially means \"target creature, player, planeswalker, or battle,\" so any of those are fair game as long as there's no effect in place that prohibits them from being targeted, like hexproof. Battles weren't in the game when Mayhem Devil was printed, so at that time it wouldn't have been able to target a battle, but it got a free upgrade when battles were introduced and the definition of \"any target\" was expanded to include battles.<br>\n"
  },
  {
    "imgs": [
      "Bloodbraid Elf",
      "Fireball"
    ],
    "q": "</b></span>  I cast <span class=\"autocard\">Bloodbraid Elf</span> and I'm resolving its cascade ability. The first card I exile is <span class=\"autocard\">Fireball</span>. What do I do next?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: Exile the next card from the top of your library.<br>\nB: Cast Fireball for X=0.<br>\nC: Cast Fireball for X=2.<br>\nD: Cast Fireball for X=3.<br>\nE: Question your decision to include Fireball in a cascade deck.<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>B.</b><br>\n<br>\nThe mana value of Fireball is 1, since the <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> in the mana cost counts as 0 while the card is anywhere other than the stack. This is less than Bloodbraid Elf's mana value of 4, so you have exiled a nonland card that costs less and you stop exiling cards from your library. You could choose not to cast the Fireball at all, but if you do, the only legal choice for X is 0 since you're casting Fireball without paying its mana cost. The resulting Fireball is not very effective, but it might trigger some \"whenever you cast\" abilities.<br>\n"
  },
  {
    "imgs": [
      "Torment of Hailfire",
      "Teferi's Protection"
    ],
    "q": "</b></span>  I cast <span class=\"autocard\">Torment of Hailfire</span> for X=11 and my opponent responds with <span class=\"autocard\">Teferi's Protection</span>. What happens when Torment of Hailfire resolves?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: Torment of Hailfire fails to resolve.<br>\nb: Your opponent loses 33 life.<br>\n3: Your opponent must discard 11 cards.<br>\niv: Your opponent may discard up to 11 cards, or do nothing at all.<br>\n<img src=\"/ci-reader/images/symbols/E.png\" class=\"mana\">: <i>What is going on here?!?</i><br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>iv.</b><br>\n<br>\nYour opponent has protection from everything, but Torment of Hailfire doesn't target them, so it still resolves. It repeatedly offers your opponent to sacrifice a nonland permanent or discard a card, and if they don't, they lose 3 life. All their permanents have phased out, so they can't sacrifice anything even if they wanted to, but they could discard a card if they thought that was a good idea. If they don't discard a card, the game tries to make them lose 3 life, but that's impossible since their life total can't change, so nothing happens. This process repeats a total of eleven times, so your opponent may discard up to eleven cards, but there is no consequence for not discarding any cards.<br>\n"
  },
  {
    "imgs": [
      "Lambholt Elder",
      "Mirrorhall Mimic",
      "Quasiduplicate",
      "Silverpelt Werewolf",
      "Ghastly Mimicry"
    ],
    "q": "</b></span>  I control a <span class=\"autocard\">Lambholt Elder</span> and copy it with <span class=\"autocard\">Mirrorhall Mimic</span>. Then I make a <span class=\"autocard\">Quasiduplicate</span> of Mirrorhall Mimic, so the token looks like Lambholt Elder except that it's also a Spirit. Next turn, no spells are cast, so the turn after that all the Lambholt Elders want to transform. What happens to the token?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: It does not transform.<br>\nB: It transforms into <span class=\"autocard\">Silverpelt Werewolf</span>.<br>\nC: It transforms into <span class=\"autocard\">Ghastly Mimicry</span> and goes to the graveyard.<br>\nD: It transforms, but its back face is also a Lambholt Elder Spirit.<br>\nE: Call me when this actually happens in a game.<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>D.</b><br>\n<br>\nThe token is a copy of a transforming permanent, so by rule 707.8a it is a transforming token. The characteristics of its front face are the copiable characteristics of Mirrorhall Mimic's front face, and the characteristics of its back face are the copiable characteristics of Mirrorhall Mimic's back face. However, those copiable characteristics are modified by Mirrorhall Mimic's own copy effect which copied Lambholt Elder, and that copy effect makes both of its faces look like Lambholt Elder.<br>\n"
  },
  {
    "imgs": [
      "Timeless Lotus",
      "The First Sliver",
      "Teferi, Temporal Archmage",
      "Jaya Ballard, Task Mage",
      "Karn, Silver Golem",
      "Cheatyface"
    ],
    "q": "</b></span>  Which of these cards can be my commander if my deck contains <span class=\"autocard\">Timeless Lotus</span>?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: <span class=\"autocard\">The First Sliver</span><br>\nB: <span class=\"autocard\">Teferi, Temporal Archmage</span><br>\nC: <span class=\"autocard\">Jaya Ballard, Task Mage</span><br>\nD: <span class=\"autocard\">Karn, Silver Golem</span><br>\nE: <span class=\"autocard\">Cheatyface</span><br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>A.</b><br>\n<br>\nTimeless Lotus is a colorless card, but mana symbols in a card's rules text also contribute to the card's color identity. Since it has the mana symbols of all five colors in its rules text, Timeless Lotus's color identity is all five colors, so it can only be in a Commander deck where the commander's color identity is all five colors.<br>\n"
  },
  {
    "imgs": [],
    "q": "</b></span>  In a Legacy tournament at Competitive REL, a player picks up their graveyard to look at it and absentmindedly shuffles it. Assuming that the player does not have any cards in their deck that care about the order of the graveyard, what infraction has the player committed?\n<br>\n<b>A:</b>  The choices are...<br>\n<blockquote><br>\nA: No infraction, rearranging the graveyard is legal<br>\nB: Game Play Error — Failure to Maintain Game State<br>\nC: Game Play Error — Game Rule Violation<br>\nD: Unsporting Conduct — Minor<br>\nE: Unsporting Conduct — Cheating<br>\n</blockquote><br>\n<br>\n<p></p>",
    "a": "<b>C.</b><br>\n<br>\nThe tournament rules allow players to rearrange their graveyard in formats that don't include cards that care about the order of the graveyard. However, that rule considers all cards that are legal in the format rather than the cards in the player's deck. Since there are cards in Legacy that care about graveyard order, the player has broken the rules by shuffling their graveyard. However, they did not do this intentionally to gain an advantage, so we can rule out Cheating. Since the player broke a game rule and none of the specific Game Play Error infractions fit, the player has committed a Game Play Error — Game Rule Violation.<br>\n"
  }
]