[
  {
    "imgs": [
      "Curse of Clinging Webs",
      "Reassembling Skeleton"
    ],
    "q": "I've enchanted my opponent with <span class=\"autocard\">Curse of Clinging Webs</span> and their <span class=\"autocard\">Reassembling Skeleton</span> just died. Can they reanimate it before it gets exiled?",
    "a": "I'm afraid so. Curse of Clinging Webs has a perfectly normal triggered ability, which means it uses the stack and your opponent can respond to it. As long as they have the necessary mana to activate Reassembling Skeleton's ability, they can do so in response to the Curse's trigger. The Skeleton's ability resolves first and returns it to the battlefield, and then the Curse's ability won't exile the Skeleton because it only looks for the card in the graveyard. You'll still make a Spider token, though, since that part of the ability is not dependent on having exiled the Skeleton."
  },
  {
    "imgs": [
      "Mire Triton"
    ],
    "q": "If <span class=\"autocard\">Mire Triton</span> gets blocked by both a 1/1 and a 2/2 creature, can it kill both of them?",
    "a": "Absolutely. The attacking player chooses the damage assignment order for the two blockers, but since Mire Triton has deathtouch, the order doesn't matter a whole lot. The attacking player has to assign lethal damage to the first blocker in order before they can assign any damage to the second blocker, but thanks to deathtouch, just 1 damage is considered lethal. Even if they choose to put the 2/2 first in the damage assignment order, they can assign 1 damage to it and 1 damage to the 1/1, resulting in both blockers being destroyed."
  },
  {
    "imgs": [
      "Extinguish All Hope",
      "Courser of Kruphix"
    ],
    "q": "If I have a creature that's enchanted with an Aura, will it get destroyed by <span class=\"autocard\">Extinguish All Hope</span>?",
    "a": "Most likely yes. Extinguish All Hope destroys all creatures that aren't enchantments. Your creature is <i>enchanted</i>, but unless the creature itself also has the word \"enchantment\" in its type line, like <span class=\"autocard\">Courser of Kruphix</span> for example, it's not an <i>enchantment</i>."
  },
  {
    "imgs": [
      "Myriad Landscape",
      "Wastes"
    ],
    "q": "Can <span class=\"autocard\">Myriad Landscape</span> get two <span class=\"autocard\">Wastes</span>?",
    "a": "Nope. Wastes are basic lands, but Wastes is not a land type. Myriad Landscape doesn't care if the two lands have the same name, it checks whether the two lands have a land type in common. Wastes have no land types at all, so they can't have a land type in common with each other or with any other land. Note that a single Wastes doesn't even share a land type with itself, so Myriad Landscape can't even get a single Wastes."
  },
  {
    "imgs": [
      "Crypt Sliver"
    ],
    "q": "Can I activate <span class=\"autocard\">Crypt Sliver</span>'s ability on my opponent's turn?",
    "a": "Certainly, provided that the Sliver whose ability you're activating doesn't have summoning sickness. Crypt Sliver gives an activated ability to all Slivers, and the cost to activate that ability is <img src=\"/ci-reader/images/symbols/T.png\" class=\"mana\">, so it's subject to the summoning sickness rule. As long as you've controlled the Sliver you're tapping since your most recent turn began, you can activate this ability, since activated abilities follow the same timing rules as instants."
  },
  {
    "imgs": [
      "Spiteful Sliver",
      "Crypt Sliver"
    ],
    "q": "My opponent is attacking with a 4/4 creature, which I block with my <span class=\"autocard\">Spiteful Sliver</span> that is a 2/2. I also control <span class=\"autocard\">Crypt Sliver</span>, and I tap Spiteful Sliver to regenerate itself. Does its \"Whenever this creature is dealt damage\" ability still trigger?",
    "a": "Yup! Regenerating a creature doesn't prevent damage to it or remove it from combat right away. By regenerating your Spiteful Sliver you're simply setting up a replacement effect that will watch and wait for something to happen that would destroy Spiteful Sliver. The game proceeds as usual to the combat damage step where your Spiteful Sliver deals 2 damage to your opponent's 4/4, and your opponent's 4/4 thoroughly beats up your Sliver to the tune of 4 damage. After the damage is dealt, state-based actions take a look, notice that your Sliver has lethal damage marked on it, and attempt to destroy it. This is where the regeneration shield kicks in, and instead of getting destroyed your Sliver is removed from combat and the damage that's marked on it is removed. (It also gets tapped, but it's already tapped, so it doesn't care.) Then, triggered abilities go on the stack, and since Spiteful Sliver <i>was</i> in fact dealt 4 damage, its ability did indeed trigger and goes on the stack."
  },
  {
    "imgs": [
      "Spark Double"
    ],
    "q": "If <span class=\"autocard\">Spark Double</span> enters the battlefield while no planeswalker or other creature is on the battlefield, can it copy itself and get the +1/+1 counter?",
    "a": "No. You have to apply Spark Double's replacement effect as it's entering the battlefield. Since this effect changes how Spark Double enters the battlefield, it gets applied before Spark Double is on the battlefield. This means that you have to choose something that's already on the battlefield before Spark Double enters the battlefield itself. Since there's nothing to choose, you can't apply the replacement effect, so Spark Double just enters as a 0/0 and dies immediately."
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Endless One",
      "Everflowing Chalice"
    ],
    "q": "Does <span class=\"autocard\">Zhulodok, Void Gorger</span> give double-cascade to an <span class=\"autocard\">Endless One</span> with X=8, or an <span class=\"autocard\">Everflowing Chalice</span> kicked four times?",
    "a": "Yes to the Endless One, no to the Chalice. Zhulodok's ability looks at the mana value of the spell you're casting, which depends on the mana cost in the top-right corner of the card. The <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> in Endless One's mana cost counts as the value that was chosen for X, so your Endless One has a mana value of 8. On the other hand, Everflowing Chalice's mana cost is <img src=\"/ci-reader/images/symbols/0.png\" class=\"mana\">, so its mana value is always 0 regardless of how often you kick it."
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Abstruse Archaic"
    ],
    "q": "If <span class=\"autocard\">Zhulodok, Void Gorger</span> gives a spell I cast \"cascade, cascade\", can <span class=\"autocard\">Abstruse Archaic</span> copy that ability?",
    "a": "Not exactly, but partially kind of yes. Zhulodok gives your spell two instances of cascade, which will both trigger and go on the stack as separate abilities. Abstruse Archaic's ability can target one of those two cascade abilities that are on the stack, so you can copy one of them to get a third instance of the cascade ability."
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Artisan of Kozilek"
    ],
    "q": "If I control <span class=\"autocard\">Zhulodok, Void Gorger</span> and cast <span class=\"autocard\">Artisan of Kozilek</span>, in what order do the cascade triggers and Artisan's trigger go on the stack?",
    "a": "You choose! Casting Artisan of Kozilek triggers three separate abilities that all want to go on the stack at the same time. You control all three abilities, so you choose the order in which the three abilities go on the stack."
  },
  {
    "imgs": [
      "Agent of the Shadow Thieves",
      "Spark Double"
    ],
    "q": "I have <span class=\"autocard\">Agent of the Shadow Thieves</span> in play and I control my commander. If I use <span class=\"autocard\">Spark Double</span> to copy my commander, does the copy also have the ability that Agent of the Shadow Thieves gives to my commander?",
    "a": "No. Spark Double only copies the copiable characteristics of your commander. The ability that's granted to it by Agent of the Shadow Thieves is not copied, and \"commanderness\" isn't copied either, so the copy of your commander won't be granted the ability by Agent of the Shadow Thieves in its own right."
  },
  {
    "imgs": [
      "Everquill Phoenix",
      "Krenko, Mob Boss",
      "Spark Double"
    ],
    "q": "Let's say <span class=\"autocard\">Everquill Phoenix</span> has been mutated on top of <span class=\"autocard\">Krenko, Mob Boss</span>. What do I get if I copy this creature with <span class=\"autocard\">Spark Double</span>?",
    "a": "Unlike most other modifications, mutations do become part of the creature's copiable characteristics, so your Spark Double will be a copy of Everquill Phoenix that also has Krenko's Goblin-making ability. It'll also have a +1/+1 counter, of course, but that's probably not the part of this interaction that you were wondering about."
  },
  {
    "imgs": [
      "Ob Nixilis, Captive Kingpin",
      "Nekusar, the Mindrazer",
      "Wheel of Fortune"
    ],
    "q": "I control <span class=\"autocard\">Ob Nixilis, Captive Kingpin</span> and <span class=\"autocard\">Nekusar, the Mindrazer</span>, and I resolve <span class=\"autocard\">Wheel of Fortune</span> with three opponents. Does Ob Nixilis's ability trigger?",
    "a": "Yup, it triggers 21 times! Each individual card draw by each of your opponents triggers Nekusar's ability, so you'll get 21 separate Nekusar triggers that will each deal 1 damage to one of your opponents in packets of 1 damage at a time. This in turn causes Ob Nixilis's ability to trigger 21 separate times."
  },
  {
    "imgs": [
      "Doubling Season",
      "Vorinclex, Monstrous Raider",
      "The Eldest Reborn"
    ],
    "q": "My opponent controls <span class=\"autocard\">Doubling Season</span> and I control <span class=\"autocard\">Vorinclex, Monstrous Raider</span>. If my opponent plays <span class=\"autocard\">The Eldest Reborn</span>, with how many lore counters does it enter the battlefield?",
    "a": "The Saga has a replacement effect that wants to make it enter the battlefield with one counter. After your opponent applies this replacement effect, two more replacement effects point out that they would like to change this event further. Vorinclex's effect wants to halve the number of counters, and Doubling Season wants to double it. Since these effects want to change how your opponent's permanent is being affected by this event, your opponent chooses which one to apply first. If they choose Vorinclex's effect, \"one lore counter\" becomes \"no lore counters\" because Vorinclex's effect rounds down, and suddenly Doubling Season's effect is no longer applicable, and the modified event happens and the Saga enters without a lore counter. If your opponent chooses Doubling Season's effect first, \"one lore counter\" becomes \"two lore counters\", and then Vorinclex's effect applies and changes it back to \"one lore counter,\" and the Saga enters with one lore counter.\nIt's also worth noting that this doesn't apply to the turn-based action of putting on a lore counter later. Doubling Season only applies when an <i>effect</i> puts a counter on a permanent, and the result of a turn-based action is not an effect as far as the rules are concerned. In this situation, only Vorinclex's replacement effect applies and eats the counter."
  },
  {
    "imgs": [
      "Rise of the Eldrazi",
      "Skittering Cicada"
    ],
    "q": "How does the extra turn from <span class=\"autocard\">Rise of the Eldrazi</span> work in a multiplayer game if I cast it on another player's turn thanks to <span class=\"autocard\">Skittering Cicada</span>?",
    "a": "It works like any other effect that grants extra turns: An extra turn that will be taken by you gets inserted into the turn sequence between the current turn and the next turn. Let's say you're player A, the turn order is A-B-C-D-A-etc., and you're doing this on player B's turn. The next turn would be player C's turn, but Rise of the Eldrazi inserts an extra turn for you into the turn order. After player B finishes their turn, and assuming no additional turn order shenanigans ensue, you will take your extra turn, which is followed by player C's regular turn, then player D's regular turn, and so on."
  },
  {
    "imgs": [
      "Omen Machine",
      "Frantic Search"
    ],
    "q": "If <span class=\"autocard\">Omen Machine</span> is in play, does <span class=\"autocard\">Frantic Search</span> still make me discard cards?",
    "a": "I'm afraid so. Frantic Search resolves and you do as much of it as you can. The card draw is impossible, so you ignore it, but discarding cards is not contingent on you having drawn cards, so you still have to discard two cards."
  },
  {
    "imgs": [
      "Ezuri's Predation"
    ],
    "q": "I control a bunch of Slivers that all have hexproof, and my opponent casts <span class=\"autocard\">Ezuri's Predation</span>. What happens?",
    "a": "Your Slivers will have to fight. Ezuri's Predation creates one 4/4 Phyrexian Beast token for each of your Slivers, and each of those tokens will fight a different one of your Slivers. The ability does not target, which you can tell from the fact that it doesn't use the word \"target,\" so the fact that your Slivers have hexproof does not stop the fight from happening."
  },
  {
    "imgs": [
      "Commodore Guff",
      "Jace, Cunning Castaway"
    ],
    "q": "Let's say I control <span class=\"autocard\">Commodore Guff</span> and a number of <span class=\"autocard\">Jace, Cunning Castaway</span> tokens that exceeds my opponents' life totals and the number of cards I have left in my library. What happens if I activate Commodore Guff's -3 ability?",
    "a": "The game will end in a draw. During the resolution of Commodore Guff's ability, you attempt to draw from an empty library and your opponents get dealt damage that reduces their life totals to 0 or less. After the ability is done resolving, state-based actions are checked and applied simultaneously. Because of what happened during the resolution, you and your opponents all lose the game at the same time, which means that the game ends in a draw."
  }
]