[
  {
    "imgs": [
      "Everybody Lives!"
    ],
    "q": "Can Everybody Lives! prevent me from losing the game due to having 10 or more poison counters?",
    "a": "Not directly, but the Helm does help a little bit. When you cast the Chalice, you decide how many times to kick it, and then you calculate the total cost, taking into account that the total cost gets reduced by <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"> due to the Helm. For example, if you kick the Chalice twice, the total cost ends up being <img src=\"/ci-reader/images/symbols/4.png\" class=\"mana\"> minus <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\">, so you'll pay <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"> for a Chalice with two counters on it."
  },
  {
    "imgs": [
      "Gallifrey Falls // No More"
    ],
    "q": "I don't understand how Gallifrey Falls // No More works. If I cast it fused, won't my creatures die before they phase out?",
    "a": "Maybe, depending on how exactly they go about doing that. You do have protection from everything, which means that your opponent can't kill you just by attacking with a bunch of creatures that have infect, since the damage just gets prevented and you won't get any poison counters. However, if you already have at least one poison counter, your opponent could use <a href=\"http"
  },
  {
    "imgs": [
      "The Ninth Doctor"
    ],
    "q": "When does The Ninth Doctor's trigger go on the stack?",
    "a": "Yup! When a spell starts to resolve, it checks whether its targets are still legal. If all of its targets have become illegal, the spell fails to resolve and does nothing, but if at least one of its targets is still legal, it resolves and does as much as it can. Cut In still has a legal target, so it resolves and does as much as it can. It fails to deal damage to your opponent's creature, but it still gives your creature the Young Hero Role token."
  },
  {
    "imgs": [
      "Return the Past",
      "Karvanista, Loyal Lupari // Lupari Shield"
    ],
    "q": "Will Return the Past let me cast an adventure spell from my graveyard like Lupari Shield from my graveyard?",
    "a": "No, this interaction is not handled with timestamps. Timestamps are an aspect of the <a href=\"ooo\">layer system</a> that governs how continuous effects interact with each other. In this situation, we have a continuous effect that says players can't draw cards, and a one-shot effect instructing players to draw cards. Such an interaction is handled by one of the golden rules of <b>Magic</b>, which is usually summed up as \"can't\" beats \"can\". Maralen's \"can't\" effect overrides the draw instruction from Windfall, so each player just discards their hand and they don't draw any cards."
  },
  {
    "imgs": [
      "Alistair, the Brigadier"
    ],
    "q": "I control Alistair, the Brigadier, four lands, and four Treasures. When I attack with Alistair, if I sacrifice those Treasures to pay for his triggered ability, will those Treasures count for the bonus that Alistair gives my creatures?",
    "a": "No. An effect needs to be able to happen before the game considers what replacement effects can apply to it. Since Maralen says that the draw can't happen, Asmodeus's replacement effect has no event to apply to."
  },
  {
    "imgs": [
      "RMS Titanic",
      "Assault Suit"
    ],
    "q": "If I crew RMS Titanic and equip it with Assault Suit, what happens if it deals combat damage to a player?",
    "a": "No, you'll only create one token. Doubling Season's ability creates a replacement effect which watches the game for a particular event (in this case the creation of some number of tokens) and replaces it partially or completely with another event (in this case doubling the number of tokens being created). In order to do this, a replacement effect has to exist before the event it is replacing happens. A replacement effect can't turn back time or change an event that has already happened. Since the Doubling Season token doesn't exist yet while you're creating it, it can't change the event of its own creation."
  },
  {
    "imgs": [
      "Blink"
    ],
    "q": "How exactly does Blink work?",
    "a": "Yes, it's perfectly legal to play with different printings of the same card as long as you stick to the limit of at most four copies of the card. Regardless of the rules text that's printed on the card, each card functions according to its Oracle text in <a href=\"http"
  },
  {
    "imgs": [
      "Weeping Angel",
      "Thijarian Witness"
    ],
    "q": "I attack my opponent with Weeping Angel. After attackers are declared, my opponent casts Thijarian Witness. What happens to my Angel?",
    "a": "If the spell resolves and ends up dealing damage to the creature, sure. Imodane's ability doesn't care that the spell could have targeted three creatures. What matters is that it targets only one creature and that it deals damage to it. As long as that condition is met, Imodane's ability triggers."
  },
  {
    "imgs": [
      "Amy Pond",
      "Rory Williams"
    ],
    "q": "Since Amy Pond has both Partner With Rory Williams and Doctor's Companion, does that mean I'm allowed to have three commanders?",
    "a": "No. When the <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> ability resolves a second time, Likeness Looter becomes a copy of the second creature, except it also has flying and the <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> ability. As such, it only copies the abilities (and other characteristics) of the second creature, so it forgets the abilities of the first creature."
  },
  {
    "imgs": [
      "The War Doctor",
      "Ryan Sinclair"
    ],
    "q": "I have The War Doctor in play. I attack with Ryan Sinclair, and I exile four lands and a nonland card to his trigger. How many counters does The War Doctor get?",
    "a": "Essentially yes. The creature gets two separate abilities that are identical to each other, but each ability tracks its activation restriction separately, and activating each ability once is practically indistinguishable from activating one ability twice."
  },
  {
    "imgs": [
      "Auton Soldier",
      "Clara Oswald",
      "The Seventh Doctor"
    ],
    "q": "I have an Auton Soldier in play that's a copy of an opponent's Clara Oswald. If I attack with the copy Clara Oswald and The Seventh Doctor, do I get the myriad tokens in time to give me more Seventh Doctor triggers?",
    "a": "Yes, provided that there is only one creature card in your graveyard at the time you get to the second half of resolving Lich-Knights' Conquest. You perform the steps in order and you do as much as possible. If there are at least two creature cards in your graveyard when you get to the \"return\" instruction, you have to choose two of them since the spell doesn't say \"up to that many\". However, if there is only one creature card in your graveyard, you simply return that one card to the battlefield and there is no penalty for failing to return a second card."
  },
  {
    "imgs": [
      "Clara Oswald",
      "The Sixth Doctor"
    ],
    "q": "If I have Clara Oswald in play, will that let The Sixth Doctor's ability trigger twice when I cast a historic spell?",
    "a": "They'll cost <img src=\"/ci-reader/images/symbols/10.png\" class=\"mana\"> less to cast. Each resolution of Rowan's ability creates its own cost-reduction by <img src=\"/ci-reader/images/symbols/5.png\" class=\"mana\">. When you cast a black and/or red spell later that turn, both reductions are applied, for a total discount of <img src=\"/ci-reader/images/symbols/10.png\" class=\"mana\">."
  },
  {
    "imgs": [
      "Atraxi Warden",
      "Cyber Conversion"
    ],
    "q": "I attack my opponent with Atraxi Warden. In response, my opponent casts Cyber Conversion targeting my Warden. What happens to my Warden? Is it still attacking?",
    "a": "No. The mana value of a spell is derived only from the mana cost printed on the card and has very little to do with how much you paid for it. Johann's Stopgap's mana cost is <img src=\"/ci-reader/images/symbols/3.png\" class=\"mana\"><img src=\"/ci-reader/images/symbols/U.png\" class=\"mana\">, so its mana value is 4, which means you have not cast a spell with mana value 3 or less yet."
  },
  {
    "imgs": [
      "Cybership",
      "Krosan Colossus"
    ],
    "q": "I attacked my opponent with a Cybership, and one of the creatures I put onto the battlefield face down is a creature with morph - a Krosan Colossus. Can I turn it face-up?",
    "a": "It doesn't. A card that's exiled face-down has no characteristics, which means it doesn't have a mana cost, which means that its mana value is 0."
  },
  {
    "imgs": [
      "Dan Lewis",
      "Hijack",
      "Sol Ring"
    ],
    "q": "I have a Dan Lewis in play. I cast Hijack on my opponent's Sol Ring, then use the equip ability from Dan Lewis to attach the Sol Ring to a creature I control. What happens when the turn ends?",
    "a": "Let's look at Havoc Festival first. It has a triggered ability that triggers at the beginning of each player's upkeep. The team plays a shared turn, so two instances of this ability go on the stack, one for each player. Let's say the team is at 30 life when this happens. The first trigger resolves and asks the game what the player's life total is. The game uses the team's life total, which is 30. The effect halves that to 15, so the player loses 15 life, which reduces their team's life total to 15. Now, the second trigger resolves, and it asks the game for the second player's life total. This trigger sees a life total of 15 and halves that, rounding up, so the second player loses 8 life and the team is left with 7 life."
  },
  {
    "imgs": [
      "Ancestral Vision",
      "The Eleventh Doctor",
      "Wibbly-wobbly, Timey-wimey"
    ],
    "q": "Last week, you wrote about how exiling Ancestral Vision to The Eleventh Doctor won't let you cast it. But since the Vision is in exile, could I cast Wibbly-wobbly, Timey-wimey to time travel and add a time counter to it, letting me cast it on my next turn?",
    "a": "It becomes 1/1. Cruel Somnophage's characteristic-defining ability is applied in layer 7a, while the effect from the Cursed Role token is applied in layer 7b, so the Cursed Role wins."
  },
  {
    "imgs": [
      "The Master, Multiplied",
      "Dreadfeast Demon"
    ],
    "q": "The only creatures I control are token copies of The Master, Multiplied and a Dreadfeast Demon. During my end step, do I just get a free Dreadfeast Demon token?",
    "a": "No. At each point in time, you only get to see the one card that is the top card of your opponent's library. While your opponent is looking at the top three cards of their library, those cards are still considered to be in the library in their original order even though your opponent is physically holding them in their hand and looking at them. The card that was on top of their library at the time Ponder started to resolve is still the top card of their library, and that's the one card that's known to you. You have no reason to see any of the cards that are in the library below it."
  },
  {
    "imgs": [
      "The Twelfth Doctor",
      "Vislor Turlough"
    ],
    "q": "My commanders are The Twelfth Doctor and Vislor Turlough. If I demonstrate Vislor Turlough, do I get the chance to give the token copy of Vislor to an opponent before the original enters the battlefield?",
    "a": "Absolutely! They are tokens, so Jaheira gives them the ability to be tapped for green mana. The fact that they're Auras doesn't matter to Jaheira even a little bit. However, since Auras don't usually get tapped, I want to point out a couple of things that might not be obvious. For one, you tap the Aura itself for mana, not the creature it's attached to. Also, you can even tap a Cursed Role token that you have attached to your opponent's creature, since you control the Role even if you don't control the creature it's attached to."
  },
  {
    "imgs": [
      "Start the TARDIS"
    ],
    "q": "What happens if I cast Start the TARDIS but we're not playing planechase?",
    "a": "Only a single token. Davros is just looking to see if an opponent has lost three or more life this turn. Davros doesn't care if multiple opponents have lost three or more life. So while all three of your opponents have lost at least three life this turn, this doesn't result in multiple Dalek tokens from Davros - you still only make one token."
  },
  {
    "imgs": [
      "River Song",
      "The Stone Brain"
    ],
    "q": "I control River Song. If I search my opponent's library with The Stone Brain, will River Song's last ability trigger?",
    "a": "It's a bit harder to make it night, and probably a bit easier to make it day."
  },
  {
    "imgs": [
      "Carpet of Flowers"
    ],
    "q": "If I cast Carpet of Flowers during my first main phase, can I get mana from it during my second main phase?",
    "a": "You can! Carpet of Flowers will trigger during each of your main phases until you've added mana with its ability that turn. If you play it during your first main phase, when you get to your second main phase, because the Carpet hasn't added mana that turn, the Carpet will trigger and you can get mana from its triggered ability."
  },
  {
    "imgs": [
      "Aquatic Alchemist // Bubble Up"
    ],
    "q": "I know you've told this tale before, but can you go over how Adventure cards work?"
  },
  {
    "imgs": [
      "Decadent Dragon // Expensive Taste"
    ],
    "q": "Could I play a Decadent Dragon in my mono-red Commander deck?"
  },
  {
    "imgs": [
      "Embereth Veteran"
    ],
    "q": "What is a Role token?"
  },
  {
    "imgs": [
      "Faunsbane Troll",
      "Twisted Fealty"
    ],
    "q": "Can I just pile up a bunch of Role tokens on one creature? For example, if my Faunsbane Troll has the Monstrous Role token attached to it, and I cast Twisted Fealty and give the Troll the Wicked Role token, will it benefit from both Role tokens?"
  },
  {
    "imgs": [],
    "q": "Does that mean if my opponent puts the Cursed Role token on one of my creatures, I can get rid of it by putting another Role on it?"
  },
  {
    "imgs": [
      "Ashiok's Reaper"
    ],
    "q": "Will a Role token going to the graveyard trigger my Ashiok's Reaper?"
  },
  {
    "imgs": [
      "Rowan, Scion of War"
    ],
    "q": "I activate Rowan, Scion of War's ability after I've lost 3 life. After the ability has resolved, I lose 2 more life. Does that increase the discount of my black and red spells to , or is it stuck at ?"
  },
  {
    "imgs": [
      "Will, Scion of Peace",
      "Intruder Alarm"
    ],
    "q": "I control Will, Scion of Peace, and I've gained 2 life this turn. I activate Will's ability, then cast a creature, which causes Intruder Alarm to trigger and untap Will. If I activate Will's ability again, are my white and/or blue spells discounted by  or ?"
  },
  {
    "imgs": [
      "Three Blind Mice"
    ],
    "q": "If I made a token copy of Three Blind Mice, could it copy itself with its own chapter II or III trigger?"
  },
  {
    "imgs": [
      "Ingenious Prodigy"
    ],
    "q": "My Ingenious Prodigy has five +1/+1 counters on. Can I remove all five counters from it during my upkeep and draw five cards?"
  },
  {
    "imgs": [
      "The Irencrag"
    ],
    "q": "When I turn The Irencrag into Everflame, Heroes' Legacy with its triggered ability, does equipping it to a creature mean that the equipped creature loses all abilities?"
  },
  {
    "imgs": [
      "Lich-Knights' Conquest"
    ],
    "q": "When I resolve Lich-Knights' Conquest, could I sacrifice my artifact creatures and enchantment creatures and return them to the battlefield?"
  },
  {
    "imgs": [
      "Discerning Financier"
    ],
    "q": "I control a Discerning Financier and a Treasure token. Can I activate the Financier's ability, then sacrifice the Treasure token in response and still draw a card?"
  },
  {
    "imgs": [
      "Discerning Financier"
    ],
    "q": "If I was in a game of Two-Headed Giant, could I give my Treasure to my teammate with Discerning Financier and still draw a card?"
  },
  {
    "imgs": [
      "Panharmonicon",
      "Talion, the Kindly Lord"
    ],
    "q": "If I have a Panharmonicon in play, will that let me choose two numbers when Talion, the Kindly Lord enters the battlefield?"
  },
  {
    "imgs": [
      "Nyxborn Courser",
      "A Tale for the Ages"
    ],
    "q": "Does my Nyxborn Courser count as an \"enchanted creature\" and get +2/+2 from A Tale for the Ages?"
  },
  {
    "imgs": [
      "Agatha's Soul Cauldron",
      "Grist, the Hunger Tide"
    ],
    "q": "If I activate Agatha's Soul Cauldron exiling Grist, the Hunger Tide, will my creatures with +1/+1 counters on them have Grist's loyalty abilities?"
  },
  {
    "imgs": [
      "Kellan, the Fae-Blooded // Birthright Boon",
      "Kellan, the Fae-Blooded // Birthright Boon"
    ],
    "q": "My commander is Kellan, the Fae-Blooded. Can I dodge the commander tax by casting Birthright Boon from the command zone and ignoring the commander tax?"
  },
  {
    "imgs": [
      "Land Tax"
    ],
    "q": "I just opened a Land Tax in my Wilds of Eldraine booster pack. Can I play it in Standard?"
  },
  {
    "imgs": [],
    "q": "So once Wilds of Eldraine is Standard-legal, that means Standard rotates and I won't be able to play my cards from Innistrad: Midnight Hunt and Streets of New Capenna anymore, right?"
  },
  {
    "imgs": [
      "Curse of Clinging Webs",
      "Reassembling Skeleton"
    ],
    "q": "I've enchanted my opponent with Curse of Clinging Webs and their Reassembling Skeleton just died. Can they reanimate it before it gets exiled?"
  },
  {
    "imgs": [
      "Mire Triton"
    ],
    "q": "If Mire Triton gets blocked by both a 1/1 and a 2/2 creature, can it kill both of them?"
  },
  {
    "imgs": [
      "Extinguish All Hope"
    ],
    "q": "If I have a creature that's enchanted with an Aura, will it get destroyed by Extinguish All Hope?"
  },
  {
    "imgs": [
      "Myriad Landscape",
      "Wastes"
    ],
    "q": "Can Myriad Landscape get two Wastes?"
  },
  {
    "imgs": [
      "Crypt Sliver"
    ],
    "q": "Can I activate Crypt Sliver's ability on my opponent's turn?"
  },
  {
    "imgs": [
      "Spiteful Sliver",
      "Crypt Sliver"
    ],
    "q": "My opponent is attacking with a 4/4 creature, which I block with my Spiteful Sliver that is a 2/2. I also control Crypt Sliver, and I tap Spiteful Sliver to regenerate itself. Does its \"Whenever this creature is dealt damage\" ability still trigger?"
  },
  {
    "imgs": [
      "Spark Double"
    ],
    "q": "If Spark Double enters the battlefield while no planeswalker or other creature is on the battlefield, can it copy itself and get the +1/+1 counter?"
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Endless One",
      "Everflowing Chalice"
    ],
    "q": "Does Zhulodok, Void Gorger give double-cascade to an Endless One with X=8, or an Everflowing Chalice kicked four times?"
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Abstruse Archaic"
    ],
    "q": "If Zhulodok, Void Gorger gives a spell I cast \"cascade, cascade\", can Abstruse Archaic copy that ability?"
  },
  {
    "imgs": [
      "Zhulodok, Void Gorger",
      "Artisan of Kozilek"
    ],
    "q": "If I control Zhulodok, Void Gorger and cast Artisan of Kozilek, in what order do the cascade triggers and Artisan's trigger go on the stack?"
  },
  {
    "imgs": [
      "Agent of the Shadow Thieves",
      "Spark Double"
    ],
    "q": "I have Agent of the Shadow Thieves in play and I control my commander. If I use Spark Double to copy my commander, does the copy also have the ability that Agent of the Shadow Thieves gives to my commander?"
  },
  {
    "imgs": [
      "Everquill Phoenix",
      "Krenko, Mob Boss",
      "Spark Double"
    ],
    "q": "Let's say Everquill Phoenix has been mutated on top of Krenko, Mob Boss. What do I get if I copy this creature with Spark Double?"
  },
  {
    "imgs": [
      "Ob Nixilis, Captive Kingpin",
      "Nekusar, the Mindrazer",
      "Wheel of Fortune"
    ],
    "q": "I control Ob Nixilis, Captive Kingpin and Nekusar, the Mindrazer, and I resolve Wheel of Fortune with three opponents. Does Ob Nixilis's ability trigger?"
  },
  {
    "imgs": [
      "Doubling Season",
      "Vorinclex, Monstrous Raider",
      "The Eldest Reborn"
    ],
    "q": "My opponent controls Doubling Season and I control Vorinclex, Monstrous Raider. If my opponent plays The Eldest Reborn, with how many lore counters does it enter the battlefield?"
  },
  {
    "imgs": [
      "Rise of the Eldrazi",
      "Skittering Cicada"
    ],
    "q": "How does the extra turn from Rise of the Eldrazi work in a multiplayer game if I cast it on another player's turn thanks to Skittering Cicada?"
  },
  {
    "imgs": [
      "Omen Machine",
      "Frantic Search"
    ],
    "q": "If Omen Machine is in play, does Frantic Search still make me discard cards?"
  },
  {
    "imgs": [
      "Ezuri's Predation"
    ],
    "q": "I control a bunch of Slivers that all have hexproof, and my opponent casts Ezuri's Predation. What happens?"
  },
  {
    "imgs": [
      "Commodore Guff",
      "Jace, Cunning Castaway"
    ],
    "q": "Let's say I control Commodore Guff and a number of Jace, Cunning Castaway tokens that exceeds my opponents' life totals and the number of cards I have left in my library. What happens if I activate Commodore Guff's -3 ability?"
  },
  {
    "imgs": [],
    "q": "So what is Oathbreaker?"
  },
  {
    "imgs": [],
    "q": "You just mentioned a \"signature spell\". What's that?"
  },
  {
    "imgs": [],
    "q": "So I can just cast my signature spell from the command zone whenever I want?"
  },
  {
    "imgs": [
      "Capsize"
    ],
    "q": "If my signature spell is Capsize, can I pay the buyback cost so it goes back to my hand instead of back to the command zone?"
  },
  {
    "imgs": [
      "Search for Tomorrow"
    ],
    "q": "What if my signature spell is a card with suspend? Could I suspend Search for Tomorrow from the command zone?"
  },
  {
    "imgs": [
      "Approach of the Second Sun"
    ],
    "q": "I suppose having Approach of the Second Sun as my signature spell won't really work either, right?"
  },
  {
    "imgs": [],
    "q": "How does partner work in Oathbreaker?"
  },
  {
    "imgs": [
      "Will Kenrith",
      "Rowan Kenrith",
      "Lightning Bolt"
    ],
    "q": "So if I have Will Kenrith and Rowan Kenrith as my Oathbreakers, and Lightning Bolt as one of my signature spells, can I cast the Bolt if I control Will Kenrith?"
  },
  {
    "imgs": [
      "Valki, God of Lies",
      "Tibalt, Cosmic Impostor"
    ],
    "q": "Since the back face of Valki, God of Lies is Tibalt, Cosmic Impostor, can Valki be my Oathbreaker?"
  },
  {
    "imgs": [],
    "q": "Is there a commander tax?"
  },
  {
    "imgs": [
      "Gideon Jura"
    ],
    "q": "What about commander damage? If my Oathbreaker is Gideon Jura, can I deal enough combat damage with Gideon to make an opponent lose the game?"
  },
  {
    "imgs": [
      "Karn, The Great Creator"
    ],
    "q": "I know \"wish\" effects don't work in commander, but do they work in Oathbreaker? Can I use Karn, The Great Creator's -2 to get cards from outside the game?"
  },
  {
    "imgs": [
      "Command Tower"
    ],
    "q": "Does a card like Command Tower work in Oathbreaker?"
  },
  {
    "imgs": [
      "Shorikai, Genesis Engine"
    ],
    "q": "Does that mean Shorikai, Genesis Engine can be my Oathbreaker?"
  },
  {
    "imgs": [
      "Tyvar, Jubilant Brawler",
      "Emrakul, the Aeons Torn"
    ],
    "q": "I activate the -2 ability of Tyvar, Jubilant Brawler, and one of the cards I milled was Emrakul, the Aeons Torn. Do I still get to return a creature card from my graveyard to my hand, or does my graveyard get shuffled into my library before I can return something?"
  },
  {
    "imgs": [
      "Gideon of the Trials",
      "Luxior, Giada's Gift"
    ],
    "q": "If I control a Gideon of the Trials equipped with Luxior, Giada's Gift, as well as the emblem from Gideon's last +0 ability, will the emblem still prevent me from losing the game?"
  },
  {
    "imgs": [
      "Saheeli, Sublime Artificer",
      "Grafted Wargear"
    ],
    "q": "I activate Saheeli, Sublime Artificer's -2, turning my Servo token into a Grafted Wargear. I attach that Wargear to one of my creatures and attack. At the end of turn, when the Wargear turns back into a Servo, will that cause the Wargear's ability to trigger and force me to sacrifice the creature it was attached to?"
  },
  {
    "imgs": [
      "Tamiyo, Field Researcher"
    ],
    "q": "Can I target my opponent's creatures when I activate the +1 ability of Tamiyo, Field Researcher?"
  },
  {
    "imgs": [
      "Tamiyo, Collector of Tales",
      "Wheel of Fortune"
    ],
    "q": "What happens if I have a Tamiyo, Collector of Tales in play when my opponent casts Wheel of Fortune?"
  },
  {
    "imgs": [
      "Dihada, Binder of Wills",
      "Vexilus Praetor"
    ],
    "q": "If I have my Oathbreaker Dihada, Binder of Wills in play, along with Vexilus Praetor, will Dihada have protection from everything?"
  },
  {
    "imgs": [
      "Banishing Light",
      "Elesh Norn, Mother of Machines"
    ],
    "q": "Can I use Banishing Light to exile my opponent's Elesh Norn, Mother of Machines?"
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines",
      "Jailbreak"
    ],
    "q": "If I control Elesh Norn, Mother of Machines and cast Jailbreak to return a card from my opponent's graveyard to the battlefield, do I then get to return two cards from my graveyard?"
  },
  {
    "imgs": [
      "Aboroth",
      "All Will Be One"
    ],
    "q": "I control an Aboroth with one age counter on it, and I also control All Will Be One. Aboroth's cumulative upkeep triggers, and I know I get one trigger for 1 damage for putting on the age counter, but how many triggers do I get for putting the -1/-1 counters on Aboroth?"
  },
  {
    "imgs": [
      "Portal to Phyrexia",
      "Phyrexian Censor"
    ],
    "q": "I control Portal to Phyrexia and Phyrexian Censor. When the Portal's second ability resolves and I choose a creature that's not normally a Phyrexian, does it enter the battlefield tapped or untapped?"
  },
  {
    "imgs": [
      "Invasion of Tarkir",
      "Kolaghan's Command"
    ],
    "q": "I cast Invasion of Tarkir and I have one other card in my hand. The Invasion's enter-the-battlefield ability resolves and I reveal the last card in my hand, which is a Dragon card. My opponent responds to the damage trigger with Kolaghan's Command to make me discard that card. Does the damage trigger deal 2 or 3 damage?"
  },
  {
    "imgs": [
      "Hoarding Broodlord"
    ],
    "q": "If I control two Hoarding Broodlords, do the spells I cast from exile have double convoke? If so, does that halve the number of creatures I have to tap to pay for those spells?"
  },
  {
    "imgs": [
      "Rakdos, Lord of Riots",
      "Elder Brain"
    ],
    "q": "I control Rakdos, Lord of Riots and my opponents have lost life, so the cost reduction effect is active. If I cast a creature card that was exiled with Elder Brain, can I apply the cost reduction from Rakdos to the colored mana symbols in its mana cost?"
  },
  {
    "imgs": [
      "Jinnie Fay, Jetmir's Second",
      "White Sun's Twilight"
    ],
    "q": "If I control Jinnie Fay, Jetmir's Second and make some tokens with White Sun's Twilight, do those tokens still have toxic 1?"
  },
  {
    "imgs": [
      "Eyes of Gitaxias",
      "Jinnie Fay, Jetmir's Second"
    ],
    "q": "What about Incubator tokens? Do they still get +1/+1 counters if Jinnie Fay, Jetmir's Second causes them to be Cats or Dogs instead?"
  },
  {
    "imgs": [
      "Bell Borca, Spectral Sergeant"
    ],
    "q": "Does Bell Borca, Spectral Sergeant's power reset to 0 when I pass the turn?"
  },
  {
    "imgs": [
      "Bitter Ordeal"
    ],
    "q": "Does Bitter Ordeal count tokens that were put into a graveyard?"
  },
  {
    "imgs": [
      "Vulturous Zombie"
    ],
    "q": "Does Vulturous Zombie trigger off of Treasure tokens or Clue tokens being sacrificed?"
  },
  {
    "imgs": [
      "Shu Yun, the Silent Tempest",
      "Murder",
      "Bolt Bend"
    ],
    "q": "I control a 3/2 Shu Yun, the Silent Tempest and an untapped Mountain. My opponent tries to Murder Shu Yun. If I cast Bolt Bend in response, does Shu Yun's prowess kick in early enough so that I can cast Bolt Bend for just ?"
  },
  {
    "imgs": [
      "Blessed Sanctuary",
      "Murder"
    ],
    "q": "Does Blessed Sanctuary stop Murder?"
  },
  {
    "imgs": [
      "Liesa, Forgotten Archangel",
      "Murder"
    ],
    "q": "If I control Liesa, Forgotten Archangel, can I Murder a creature with indestructible by exiling it instead?"
  },
  {
    "imgs": [
      "Ichormoon Gauntlet",
      "Cosima, God of the Voyage"
    ],
    "q": "Can I use Ichormoon Gauntlet's triggered ability to give extra voyage counters to an exiled Cosima, God of the Voyage?"
  },
  {
    "imgs": [
      "Thousand Winds",
      "Flicker"
    ],
    "q": "If I control a face-down Thousand Winds and Flicker it, does that trigger Thousand Winds's turned-face-up ability?"
  },
  {
    "imgs": [
      "Command the Dreadhorde",
      "Eternal Witness"
    ],
    "q": "If I use Command the Dreadhorde to return Eternal Witness from my graveyard to the battlefield, can I use Eternal Witness's ability to return the same Command the Dreadhorde to my hand?"
  },
  {
    "imgs": [
      "The One Ring",
      "The Mycosynth Gardens"
    ],
    "q": "I control The One Ring with four burden counters on it, and my upkeep just started. Can I activate the Ring to draw five cards, and then copy the Ring with The Mycosynth Gardens to get rid of it and avoid losing life?"
  },
  {
    "imgs": [
      "The Ninth Doctor",
      "Freed from the Real"
    ],
    "q": "If I control The Ninth Doctor that's enchanted with Freed from the Real, can I repeatedly tap and untap it to get a bunch of additional upkeep steps?"
  },
  {
    "imgs": [
      "Soulless Jailer",
      "Goblin Welder"
    ],
    "q": "If my opponent controls Soulless Jailer, can I still use Goblin Welder's ability to echange an artifact on the battlefield with one in my graveyard?"
  },
  {
    "imgs": [
      "The One Ring",
      "Braids, Arisen Nightmare"
    ],
    "q": "If I have protection from everything due to The One Ring, can my opponent's Braids, Arisen Nightmare still harm me?"
  },
  {
    "imgs": [
      "Skyfisher Spider",
      "Humble"
    ],
    "q": "The Oracle ruling for Skyfisher Spider says that the enter-the-battlefield ability doesn't have a target, but it has a \"reflexive trigger\" that goes on the stack separately and that players can respond to. If I respond to the enter-the-battlefield ability with Humble, does that reflexive trigger still happen?"
  },
  {
    "imgs": [
      "Mirage Mirror",
      "Talion, the Kindly Lord"
    ],
    "q": "If I use Mirage Mirror to copy my opponent's Talion, the Kindly Lord, do I get to choose my own number between 1 and 10 or does it copy the chosen number from the original?"
  },
  {
    "imgs": [
      "Contaminant Grafter"
    ],
    "q": "I have three opponents that each have three poison counters. How many times does Contaminant Grafter's corrupted ability trigger?"
  },
  {
    "imgs": [
      "Evelyn, the Covetous"
    ],
    "q": "Can I use Evelyn, the Covetous's third ability to play a land that was exiled with a collection counter by her second ability?"
  },
  {
    "imgs": [
      "Clone",
      "Enchanted Carriage"
    ],
    "q": "If I Clone a Vehicle that has been crewed, is the Clone an artifact creature forever?"
  },
  {
    "imgs": [
      "Mistbind Clique",
      "Ashnod's Altar",
      "Stifle"
    ],
    "q": "In a game of Commander, my opponent casts Mistbind Clique and champions their commander. They choose to leave it in exile, and then they sacrifice Mistbind Clique to Ashnod's Altar. If I Stifle the return part of the champion ability, does their commander get stuck in exile?"
  },
  {
    "imgs": [
      "Mystic Forge",
      "Out of the Tombs"
    ],
    "q": "I control Mystic Forge and I'm resolving Out of the Tombs's mill ability. Does Mystic Forge allow me to cast an artifact from the top of my library instead of milling it?"
  },
  {
    "imgs": [
      "Explosive Entry"
    ],
    "q": "Can I cast Explosive Entry just to put a +1/+1 counter on a creature if there's no artifact on the battlefield?"
  },
  {
    "imgs": [
      "Doomsday Confluence",
      "Syr Konrad, the Grim"
    ],
    "q": "I cast Doomsday Confluence, choosing the first and third modes. If my opponent sacrifices their Syr Konrad, the Grim and discards a creature card, does Syr Konrad's ability still trigger?"
  },
  {
    "imgs": [
      "Jaya's Phoenix"
    ],
    "q": "If I give Jaya's Phoenix double strike and it deals damage to my opponent, do I copy the next planeswalker activation twice, or the next two activations once each?"
  },
  {
    "imgs": [
      "Bear Cub",
      "Giant Growth",
      "Cyber Conversion"
    ],
    "q": "My opponent attacks me with a Bear Cub, and I don't block it. Before damage, they pump it with Giant Growth. Can I shrink it back to 2/2 with Cyber Conversion?"
  },
  {
    "imgs": [
      "Candlekeep Inspiration",
      "Ixidron"
    ],
    "q": "Candlekeep Inspiration has made my creatures 30/30. If my opponent flashes in Ixidron, do my creatures become 2/2 or stay 30/30?"
  },
  {
    "imgs": [
      "The Cyber-Controller"
    ],
    "q": "Are the Cyberman artifact creatures from The Cyber-Controller token creatures or nontoken creatures?"
  },
  {
    "imgs": [
      "Ixidron"
    ],
    "q": "So if they're nontoken creatures, would Ixidron turn them face-up?"
  },
  {
    "imgs": [
      "Vial Smasher the Fierce",
      "Isochron Scepter"
    ],
    "q": "If I control Vial Smasher the Fierce and activate Isochron Scepter to cast the imprinted card, does Vial Smasher's ability trigger?"
  },
  {
    "imgs": [],
    "q": "Are these cards going to be legal in Standard or Modern?"
  },
  {
    "imgs": [
      "Missy",
      "TARDIS"
    ],
    "q": "So, since Missy and TARDIS are legal in Legacy, does that mean I can have a planar deck in a Legacy tournament?"
  },
  {
    "imgs": [
      "Rose Tyler",
      "The Tenth Doctor"
    ],
    "q": "Can I partner Rose Tyler with The Tenth Doctor even though there is no white in The Tenth Doctor's color identity?"
  },
  {
    "imgs": [
      "K-9, Mark I",
      "Morophon, the Boundless"
    ],
    "q": "Can I team up K-9, Mark I with Morophon, the Boundless because Morophon is a Doctor?"
  },
  {
    "imgs": [
      "The Thirteenth Doctor",
      "Embiggen"
    ],
    "q": "Speaking of Time Lord Doctors, how many creature types does the Doctor have? Embiggen wants to know."
  },
  {
    "imgs": [
      "Avian Changeling",
      "Gallifrey Stands"
    ],
    "q": "Do changelings count for the win condition of Gallifrey Stands?"
  },
  {
    "imgs": [
      "Gallifrey Stands"
    ],
    "q": "What happens if I already control thirteen Doctors and don't put another Doctor card onto the battlefield when Gallifrey Stands's ability resolves? Do I still win the game?"
  },
  {
    "imgs": [
      "The Eleventh Doctor",
      "Ancestral Vision"
    ],
    "q": "If I use The Eleventh Doctor's first ability to exile Ancestral Vision from my hand, when do I end up casting Ancestral Vision?"
  },
  {
    "imgs": [
      "Wibbly-wobbly, Timey-wimey",
      "The Eleventh Hour"
    ],
    "q": "How does time travel interact with Sagas?"
  },
  {
    "imgs": [
      "Wibbly-wobbly, Timey-wimey",
      "Doubling Season"
    ],
    "q": "How does time travel interact with Doubling Season?"
  },
  {
    "imgs": [
      "Clara Oswald",
      "The Twelfth Doctor"
    ],
    "q": "If I control Clara Oswald and The Twelfth Doctor, does the first spell I cast from somewhere other than my hand have demonstrate twice?"
  },
  {
    "imgs": [
      "Yasmin Khan"
    ],
    "q": "If I use Yasmin Khan's ability to exile the top card of my library, do I get to cast it for free and/or at a time when I couldn't normally cast it?"
  },
  {
    "imgs": [
      "The Thirteenth Doctor",
      "Time Lord Regeneration"
    ],
    "q": "I control The Thirteenth Doctor while Time Lord Regeneration \"regenerates\" another Time Lord. Does the Paradox ability trigger?"
  },
  {
    "imgs": [
      "Into the Time Vortex",
      "The Thirteenth Doctor"
    ],
    "q": "Does cascade trigger The Thirteenth Doctor's Paradox ability?"
  },
  {
    "imgs": [
      "The Foretold Soldier"
    ],
    "q": "If The Foretold Soldier gets blocked by something that can kill it, does it still become foretold?"
  },
  {
    "imgs": [
      "The Valeyard"
    ],
    "q": "What on Earth is a villainous choice?"
  },
  {
    "imgs": [
      "Mirror Box",
      "Death in Heaven"
    ],
    "q": "Does Mirror Box give the Cyberman creatures from Death in Heaven a big power/toughness boost?"
  },
  {
    "imgs": [
      "From the Ashes",
      "River Song"
    ],
    "q": "How many times does From the Ashes trigger River Song's ability if multiple lands get destroyed?"
  },
  {
    "imgs": [
      "The War Doctor",
      "Teferi's Protection"
    ],
    "q": "If I control The War Doctor and phase out all my permanents with Teferi's Protection, does The War Doctor still get a time counter for the other permanents that phase out at the same time as it?"
  },
  {
    "imgs": [
      "Isshin, Two Heavens as One",
      "Cybermat"
    ],
    "q": "If I control Isshin, Two Heavens as One, does Cybermat's attack trigger get doubled?"
  },
  {
    "imgs": [
      "Deep-Cavern Bat",
      "Breeches, Eager Pillager",
      "Eaten by Piranhas"
    ],
    "q": "My opponent cast Deep-Cavern Bat and exiled Breeches, Eager Pillager from my hand. Later on, I cast Eaten by Piranhas on the Bat. Do I get my exiled card back?"
  },
  {
    "imgs": [
      "Council of Echoes",
      "Council of Echoes"
    ],
    "q": "If my opponent controls a Council of Echoes, can I play my own copy of Council of Echoes with descend active and bounce my opponent's Council of Echoes?"
  },
  {
    "imgs": [
      "Hulking Raptor"
    ],
    "q": "If I cast Hulking Raptor during my first main phase, do I immediately get two green mana from its triggered ability?"
  },
  {
    "imgs": [
      "Pirate Hat",
      "Eaten by Piranhas"
    ],
    "q": "My opponent controls a creature equipped with Pirate Hat. If I enchant it with Eaten by Piranhas, what happens to their creature?"
  },
  {
    "imgs": [
      "The Ozolith"
    ],
    "q": "If The Ozolith ends up with a finality counter on it, and then The Ozolith is destroyed, what happens?"
  },
  {
    "imgs": [
      "Geological Appraiser"
    ],
    "q": "What happens if I resolve Geological Appraiser's discover 3 trigger but I don't have any cards with a mana value of 3 or less left in my library?"
  },
  {
    "imgs": [
      "Ojer Pakpatiq, Deepest Epoch",
      "Virtue of Loyalty // Ardenvale Fealty"
    ],
    "q": "I control Ojer Pakpatiq, Deepest Epoch. If I cast Ardenvale Fealty from my hand (the adventure part of Virtue of Loyalty), what happens when it resolves?"
  },
  {
    "imgs": [
      "The Enigma Jewel",
      "The Eternal Wanderer",
      "Quintorius Kand",
      "Locus of Enlightenment"
    ],
    "q": "I activate the craft ability of The Enigma Jewel, choosing to exile The Eternal Wanderer and Quintorius Kand, among other cards. Can I activate two loyalty abilities of Locus of Enlightenment, one ability given to it by The Eternal Wanderer, and a second ability given to it by Quintorius Kand?"
  },
  {
    "imgs": [
      "The Mightstone and Weakstone",
      "The Golden-Gear Colossus"
    ],
    "q": "What happens if I target The Mightstone and Weakstone with the triggered ability from The Golden-Gear Colossus?"
  },
  {
    "imgs": [
      "Roaming Throne",
      "Pantlaza, Sun-Favored"
    ],
    "q": "I control Roaming Throne with \"Dinosaur\" as the chosen type. If I cast Pantlaza, Sun-Favored, does that mean I get two of Pantlaza's enter the battlefield triggers?"
  },
  {
    "imgs": [
      "Geological Appraiser",
      "Ephemerate"
    ],
    "q": "I cast Geological Appraiser, and with its discover trigger, I exile and cast Ephemerate. Do I get to cast Ephemerate off of rebound on my next upkeep?"
  },
  {
    "imgs": [
      "Sandswirl Wanderglyph"
    ],
    "q": "If I remove my opponent's Sandswirl Wanderglyph, am I free to cast spells and attack like normal?"
  },
  {
    "imgs": [
      "Sandswirl Wanderglyph"
    ],
    "q": "How does Sandswirl Wanderglyph work in a game of Two-Headed Giant?"
  },
  {
    "imgs": [
      "Topography Tracker",
      "River Herald Guide"
    ],
    "q": "If I have two Topography Trackers in play, and I cast River Herald Guide, how many times will I explore?"
  },
  {
    "imgs": [
      "Knight of Malice",
      "Indominus Rex, Alpha"
    ],
    "q": "If I discard Knight of Malice to Indominus Rex, Alpha, what kind of counters does Indominus Rex get?"
  },
  {
    "imgs": [
      "Ad Nauseam",
      "Permission Denied",
      "Counterspell"
    ],
    "q": "My opponent just cast Ad Nauseam, so I responded with Permission Denied to counter it. But in response to Permission Denied, another opponent cast Counterspell targeting Ad Nauseam. What happens when Permission Denied resolves?"
  },
  {
    "imgs": [
      "Anhelo, the Painter",
      "Molten Collapse",
      "Hulking Goblin"
    ],
    "q": "It's my turn, and I have Anhelo, the Painter in play and Molten Collapse in my hand, and I haven't had any permanent cards go to my graveyard yet. Can I cast Molten Collapse, use casualty from Anhelo and sacrifice a Hulking Goblin and be able to choose both modes of Molten Collapse?"
  },
  {
    "imgs": [
      "Hakbal of the Surging Soul",
      "Benthic Biomancer"
    ],
    "q": "I have three Merfolk in play, including a Hakbal of the Surging Soul and a Benthic Biomancer. Hakbal's beginning of combat trigger resolves, and my Merfolk explore, starting with Benthic Biomancer. If I reveal a nonland card for the Biomancer's trigger, do I resolve the Biomancer's trigger before my next Merfolk explores?"
  },
  {
    "imgs": [
      "Soulcoil Viper"
    ],
    "q": "If my commander gets a finality counter, what happens to my commander if it would die?"
  },
  {
    "imgs": [
      "Slicer, Hired Muscle",
      "Hunter's Blowgun"
    ],
    "q": "I control Slicer, Hired Muscle which is equipped with my Hunter's Blowgun. If I give control of Slicer to my opponent during their upkeep, which ability will Slicer gain, deathtouch or reach?"
  },
  {
    "imgs": [
      "Agatha of the Vile Cauldron",
      "Granitic Titan"
    ],
    "q": "I control Agatha of the Vile Cauldron and have a Granitic Titan in my hand. Does Agatha reduce the cost to cycle the Titan out of my hand?"
  },
  {
    "imgs": [
      "Aquatic Alchemist // Bubble Up",
      "Aquatic Alchemist // Bubble Up"
    ],
    "q": "I have an Aquatic Alchemist in my graveyard and a second copy of Aquatic Alchemist in my hand. Can I use the Adventure side of the one in my hand (Bubble Up) to put the Aquatic Alchemist in my graveyard on top of my library?"
  },
  {
    "imgs": [
      "Ashiok's Reaper",
      "Conceited Witch // Price of Beauty",
      "Murder"
    ],
    "q": "I control a Ashiok's Reaper and a 2/2 Zombie token enchanted with a Wicked Role (from the spell Price of Beauty). If my opponent Murders the Zombie, does the Wicked Role go to the graveyard and cause Ashiok's Reaper to draw me a card?"
  },
  {
    "imgs": [
      "Ashiok's Reaper",
      "Murder"
    ],
    "q": "Cool. If the Wicked Role was enchanting my Ashiok's Reaper instead and then it got Murdered, would I still draw a card?"
  },
  {
    "imgs": [
      "Leyline of the Void",
      "Bear Cub",
      "Knightly Valor",
      "Break the Spell"
    ],
    "q": "My opponent controls Leyline of the Void and I control a Bear Cub enchanted with my Knightly Valor. If I target my own Valor with Break the Spell, will I draw a card? Or will Leyline exiling it prevent the card draw?"
  },
  {
    "imgs": [
      "Callous Sell-Sword // Burn Together",
      "Bear Cub",
      "Dark Confidant",
      "Corrupted Conviction"
    ],
    "q": "I cast Burn Together to have my Bear Cub deal damage to my opponent's Dark Confidant. My opponent responded by sacrificing the Dark Confidant to Corrupted Conviction. Do I still have to sacrifice my Bear Cub even though there is no creature for it to deal its damage to?"
  },
  {
    "imgs": [
      "Faerie Fencing",
      "Hill Giant",
      "Disdainful Stroke"
    ],
    "q": "My opponent casts Faerie Fencing targeting my Hill Giant. The  for Faerie Fencing was 3, so it would kill my Giant. Can I counter the Faerie Fencing with Disdainful Stroke?"
  },
  {
    "imgs": [
      "The End",
      "Savage Packmate",
      "Child of the Pack"
    ],
    "q": "I used The End to exile my opponent's Savage Packmate. When I search the opponent's graveyard, library, and hand, do I exile cards named Savage Packmate or Child of the Pack?"
  },
  {
    "imgs": [
      "Expel the Interlopers"
    ],
    "q": "Expel the Interlopers says choose a number between 0 and 10. Can I choose 0? Or must I only choose numbers that appear between 0 and 10?"
  },
  {
    "imgs": [
      "Glass Casket",
      "Disenchant"
    ],
    "q": "I cast Glass Casket and have its enter-the-battlefield trigger target my opponent's 1/1 Soldier token. If my opponent responds to the trigger by Disenchanting my Glass Casket, do I still get to exile the Soldier token?"
  },
  {
    "imgs": [
      "Mishra, Lost to Phyrexia",
      "Horned Loch-Whale // Lagoon Breach"
    ],
    "q": "If my opponent controls an attacking Mishra, Lost to Phyrexia and I target it with Lagoon Breach, what happens?"
  },
  {
    "imgs": [
      "Murder",
      "Mishra, Lost to Phyrexia",
      "Not Dead After All"
    ],
    "q": "If my opponent tries to Murder my Mishra, Lost to Phyrexia and I respond with Not Dead After All, what happens?"
  },
  {
    "imgs": [
      "Niv-Mizzet, Supreme",
      "Questing Druid // Seek the Beast"
    ],
    "q": "If I cast Niv-Mizzet, Supreme while I control Questing Druid, does the Druid get four +1/+1 counters?"
  },
  {
    "imgs": [
      "Rankle's Prank"
    ],
    "q": "My opponent casts Rankle's Prank choosing all three modes. Do I get to see what cards my opponent discards before I have to decide what I will discard? Do I get to know what creatures my opponent will sacrifice before I choose what creatures I sacrifice?"
  },
  {
    "imgs": [
      "Regal Bunnicorn",
      "Imperial Recruiter"
    ],
    "q": "Can I find Regal Bunnicorn with the enter-the-battlefield trigger of Imperial Recruiter?"
  },
  {
    "imgs": [
      "Restless Bivouac"
    ],
    "q": "If I attack with an animated Restless Bivouac and place the +1/+1 counter it makes on itself, does the counter fall off at the end of turn when it stops being a creature?"
  },
  {
    "imgs": [
      "Sharae of Numbing Depths",
      "Likeness Looter"
    ],
    "q": "Sharae of Numbing Depths is in my graveyard and is currently being copied by Likeness Looter. I've already drawn one card from the copied Sharae's ability by tapping down an opponent's creature. If I have Sharae activate its X ability to become a copy of Sharae again, can I trigger the draw a card ability a second time this turn if I tap down another creature?"
  },
  {
    "imgs": [
      "Skewer Slinger"
    ],
    "q": "My attacking Skewer Slinger was blocked by a single 1/1 Soldier token. The Soldier died to Slinger's triggered ability before combat damage. Does my Slinger deal its combat damage to my opponent now?"
  },
  {
    "imgs": [
      "Skewer Slinger"
    ],
    "q": "What happens if we have the same question as that last one, but this time my Skewer Slinger has a Monster Role attached to it?"
  },
  {
    "imgs": [
      "Court of Garenbrig",
      "Bear Cub",
      "Hill Giant",
      "Murder"
    ],
    "q": "I control Court of Garenbrig and I'm not currently the monarch. As my upkeep began, I put Court of Garenbrig's trigger on the stack targeting my Bear Cub and my Hill Giant, wanting to put a +1/+1 counter on each. Before the trigger resolved, my opponent Murdered my Hill Giant. When Garenbrig's trigger resolves, I'm convinced I get to put two +1/+1 counters on my Bear Cub, but my opponent thinks it only gets one +1/+1 counter. Who is correct?"
  },
  {
    "imgs": [
      "Orcish Bowmasters"
    ],
    "q": "Let's say I control an Orc Army and it somehow phases out. While it's phased out, I amass Orcs again, so I get a new Orc Army token. What happens if I amass Orcs again after the first Orc Army token phases back in?"
  },
  {
    "imgs": [
      "Reanimate",
      "Dire Wolves",
      "Act of Treason"
    ],
    "q": "In a four-player Commander game, Arya Reanimated Bran's Dire Wolves. Later, Bran steals his Wolves back with Act of Treason and kills Arya with it. What happens at the end of the turn when Act of Treason's effect wears off?"
  },
  {
    "imgs": [
      "Tayam, Luminous Enigma",
      "Phyrexian Tower",
      "Wastes"
    ],
    "q": "I control Tayam, Luminous Enigma, an untapped Phyrexian Tower, an untapped Wastes, and an Orc Army token with three +1/+1 counters on it. Can I activate Tayam's ability by removing the counters from the Orc Army, tapping the Wastes, and sacrificing the Orc Army to Phyrexian Tower for mana?"
  },
  {
    "imgs": [
      "Elminster",
      "Sigiled Starfish",
      "Augury Owl"
    ],
    "q": "I control Elminster, and I use Sigiled Starfish to scry 1, then I cast Augury Owl to scry 3, and finally I activate Elminster's +2 ability to draw a card and scry 2. How much less does my next instant or sorcery cost to cast?"
  },
  {
    "imgs": [
      "Mayhem Devil"
    ],
    "q": "Which of these can Mayhem Devil deal damage to?"
  },
  {
    "imgs": [
      "Bloodbraid Elf",
      "Fireball"
    ],
    "q": "I cast Bloodbraid Elf and I'm resolving its cascade ability. The first card I exile is Fireball. What do I do next?"
  },
  {
    "imgs": [
      "Torment of Hailfire",
      "Teferi's Protection"
    ],
    "q": "I cast Torment of Hailfire for X=11 and my opponent responds with Teferi's Protection. What happens when Torment of Hailfire resolves?"
  },
  {
    "imgs": [
      "Lambholt Elder",
      "Mirrorhall Mimic",
      "Quasiduplicate"
    ],
    "q": "I control a Lambholt Elder and copy it with Mirrorhall Mimic. Then I make a token copy of Mirrorhall Mimic, so the token looks like Lambholt Elder except that it's also a Spirit. Next turn, no spells are cast, so the turn after that all the Lambholt Elders want to transform. What happens to the token?"
  },
  {
    "imgs": [
      "Timeless Lotus"
    ],
    "q": "Which of these cards can be my commander if my deck contains Timeless Lotus?"
  },
  {
    "imgs": [],
    "q": "In a Legacy tournament at Competitive REL, a player picks up their graveyard to look at it and absentmindedly shuffles it. Assuming that the player does not have any cards in their deck that care about the order of the graveyard, what infraction has the player committed?"
  },
  {
    "imgs": [
      "Bilious Skulldweller",
      "Virulent Sliver"
    ],
    "q": "Why did they decide to use toxic and not bring back poisonous?"
  },
  {
    "imgs": [
      "Nimraiser Paladin",
      "Prosthetic Injector"
    ],
    "q": "If I equip my Nimraiser Paladin  with a Prosthetic Injector and attack my opponent with it, how many poison counters will they get?"
  },
  {
    "imgs": [
      "Anoint with Affliction"
    ],
    "q": "What does it mean to be \"corrupted\"?"
  },
  {
    "imgs": [
      "Watchful Blisterzoa"
    ],
    "q": "What does an oil counter do?"
  },
  {
    "imgs": [
      "Branchblight Stalker",
      "Impede Momentum"
    ],
    "q": "If my Branchblight Stalker has both a +1/+1 counter and a stun counter from Impede Momentum on it, and I proliferate, can I choose to just proliferate just the +1/+1 counter and not the stun counter?"
  },
  {
    "imgs": [
      "All Will Be One",
      "Kaya, Intangible Slayer"
    ],
    "q": "I have All Will Be One in play. If I cast a planeswalker like Kaya, Intangible Slayer, will All Will Be One trigger and let me deal 6 damage?"
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines"
    ],
    "q": "If my opponent and I both control an Elesh Norn, Mother of Machines, what happens to our triggered abilities?"
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines",
      "Koth, Fire of Resistance"
    ],
    "q": "If my opponent controls Elesh Norn, Mother of Machines, does that mean planeswalkers I cast (like Koth, Fire of Resistance) won't enter with any loyalty counters on it?"
  },
  {
    "imgs": [
      "Elesh Norn, Mother of Machines",
      "Dress Down"
    ],
    "q": "My opponent controls Elesh Norn, Mother of Machines. If I cast Dress Down, will I draw a card when Dress Down enters, or will Elesh Norn stop it from triggering?"
  },
  {
    "imgs": [
      "Geth, Thane of Contracts",
      "Fleshbag Marauder"
    ],
    "q": "I control Geth, Thane of Contracts. If I return a Fleshbag Marauder, can I sacrifice the Marauder to its enter the battlefield trigger before it dies due to having a toughness of 0?"
  },
  {
    "imgs": [
      "Capricious Hellraiser"
    ],
    "q": "What happens if I only have two cards in my graveyard when Capricious Hellraiser enters the battlefield?"
  },
  {
    "imgs": [
      "Armored Scrapgorger"
    ],
    "q": "All graveyards are empty, and I tap and attack with an Armored Scrapgorger. Do I still get to put an oil counter on the Scrapgorger?"
  },
  {
    "imgs": [
      "White Sun's Twilight"
    ],
    "q": "If I cast White Sun's Twilight with X=5, whose creatures are destroyed?"
  },
  {
    "imgs": [
      "Thrun, Breaker of Silence",
      "Assassin's Trophy"
    ],
    "q": "Can my opponent target and destroy my Thrun, Breaker of Silence with an Assassin's Trophy?"
  },
  {
    "imgs": [
      "Graaz, Unstoppable Juggernaut",
      "Ovinize"
    ],
    "q": "I have a Graaz, Unstoppable Juggernaut and some other creatures in play. My opponent casts Ovinize targeting Graaz. What happens to my other creatures?"
  },
  {
    "imgs": [
      "Nahiri, the Unforgiving"
    ],
    "q": "If I activate Nahiri, the Unforgiving's first +1 targeting an opponent's creature in a multiplayer game, do I also get to choose which player that creature attacks?"
  },
  {
    "imgs": [
      "Synthesis Pod"
    ],
    "q": "Can I activate the ability of Synthesis Pod and exile a card from my graveyard to activate the ability?"
  },
  {
    "imgs": [
      "Synthesis Pod",
      "Bring the Ending"
    ],
    "q": "Could my opponent respond to Synthesis Pod's ability by countering the spell I want to exile with Bring the Ending?"
  },
  {
    "imgs": [
      "Phyrexian Obliterator"
    ],
    "q": "Can I use the New Phyrexia version of Phyrexian Obliterator in a Standard tournament?"
  },
  {
    "imgs": [],
    "q": "I heard something about how cards from Phyrexia: All Will Be One will be legal earlier than other sets. Is that true?"
  },
  {
    "imgs": [
      "Death's Shadow"
    ],
    "q": "My opponent is currently at 10 life. If I attack my opponent with two 3/3 Beast tokens and my opponent blocks one of them with his Death's Shadow, does the Shadow get big enough to survive the combat damage in time?"
  },
  {
    "imgs": [
      "Shardless Agent",
      "Living End",
      "Containment Priest"
    ],
    "q": "My opponent has cascaded into Living End and I have a Containment Priest in my hand. My opponent claims there is no point I can cast the Priest to prevent Living End from reanimating creatures. Is this true?"
  },
  {
    "imgs": [
      "Uncivil Unrest",
      "Jeska, Thrice Reborn",
      "Bear Cub"
    ],
    "q": "I control Uncivil Unrest, Jeska, Thrice Reborn, and an attacking Bear Cub with a +1/+1 counter on it. Before attacking with the Bear Cub, I used Jeska's +0 ability to triple the Bear's damage. If my opponent doesn't block the Bear Cub, how much damage will it deal?"
  },
  {
    "imgs": [
      "Gisa, Glorious Resurrector",
      "Hill Giant",
      "Asphyxiate",
      "Momentary Blink"
    ],
    "q": "My Gisa, Glorious Resurrector exiled my opponent's Bear Cub because it died blocking my Hill Giant. During my opponent's turn, they target Gisa with Asphyxiate. I respond by Momentary Blinking her. As my turn begins will I get a decayed Bear Cub?"
  },
  {
    "imgs": [
      "Puresteel Paladin",
      "Lucille",
      "Sword of Light and Shadow"
    ],
    "q": "I control Puresteel Paladin which is currently wielding Lucille. I then equip Sword of Light and Shadow onto the Paladin. When I attack with the Paladin, how much damage does it deal if it goes unblocked?"
  },
  {
    "imgs": [
      "Anikthea, Hand of Erebos",
      "Necromancy"
    ],
    "q": "My commander is Anikthea, Hand of Erebos. If I have her make a copy of Necromancy from my graveyard, what happens to the Necromancy token?"
  },
  {
    "imgs": [
      "Evolved Sleeper",
      "Vantress Transmuter // Croaking Curse"
    ],
    "q": "On my last turn, I upgraded my Evolved Sleeper into a 2/2 Human Cleric. After this, my opponent placed a Cursed Role on it during their turn, using Croaking Curse. It's now my turn again. Can I activate Evolved Sleeper's first ability? And if so, what will it look like?"
  },
  {
    "imgs": [],
    "q": "Same set up as the last question. Can I activate the Evolved Sleeper's second ability? And if so, what will it look like?"
  },
  {
    "imgs": [
      "Tribute to the World Tree",
      "Branching Evolution",
      "Bear Cub"
    ],
    "q": "I control two copies of Tribute to the World Tree and two copies of Branching Evolution. If I cast Bear Cub, how many +1/+1 counters will it end up with and will I draw any cards?"
  },
  {
    "imgs": [
      "Kaalia of the Vast",
      "Baneslayer Angel",
      "Horn of the Mark"
    ],
    "q": "If I attack with only Kaalia of the Vast putting a Baneslayer Angel onto the battlefield attacking with Kaalia's trigger, will this trigger my Horn of the Mark?"
  },
  {
    "imgs": [
      "Horn of the Mark"
    ],
    "q": "In a game of Commander I have three opponents. I attack each of them in the same turn with three 1/1 Saproling tokens. Does this trigger my Horn of the Mark once or three times?"
  },
  {
    "imgs": [
      "Damping Sphere",
      "Nyxbloom Ancient",
      "Ancient Tomb"
    ],
    "q": "My opponent controls Damping Sphere and I control Nyxbloom Ancient. If I tap my Ancient Tomb for mana, how much mana does it make?"
  },
  {
    "imgs": [],
    "q": "I'm not sure why, but I've always played with my lands on the left side of my battlefield. I had an opponent tell me that it's against the rules, and that I have to play with my lands in the back. Is this true?"
  },
  {
    "imgs": [
      "Farewell",
      "Teferi's Protection"
    ],
    "q": "My opponent casts Farewell so I respond by phasing myself out with Teferi's Protection. My opponent chooses all modes for Farewell and claims they still exile my graveyard. Is this true?"
  },
  {
    "imgs": [
      "Precursor Golem",
      "Sublime Epiphany"
    ],
    "q": "I control Precursor Golem and its two 3/3 Golem tokens. If I target Precursor Golem with Sublime Epiphany choosing the copy target creature mode and the draw a card mode, can I choose different modes with the two copies of Sublime Epiphany?"
  },
  {
    "imgs": [
      "Brenard, Ginger Sculptor",
      "Bear Cub",
      "Day of Judgment"
    ],
    "q": "I control Brenard, Ginger Sculptor and three Bear Cubs. My opponent casts Day of Judgment. Does Brenard still make three gingerbread Bear Cubs, even though he is dying along with them?"
  },
  {
    "imgs": [
      "Mortuary",
      "Clone",
      "Gyruda, Doom of Depths"
    ],
    "q": "If I control Mortuary and cast Clone choosing to copy my Gyruda, Doom of Depths, can I infinitely mill all other players?"
  },
  {
    "imgs": [
      "Bear Cub",
      "Emberwilde Captain",
      "Aetherize"
    ],
    "q": "My opponent attacks me with three Bear Cubs while I'm the monarch and I control an Emberwilde Captain. The opponent currently has four cards in their hand. Is it possible for me to use the Aetherize in my hand to increase the damage Emberwilde does to greater than 4?"
  },
  {
    "imgs": [
      "Parallel Thoughts",
      "glimpse the unthinkable"
    ],
    "q": "I control Parallel Thoughts and my library has been entirely milled out by my opponent. If there are no more cards exiled by Parallel Thoughts, can I still have it replace my draw so I don't lose the game for drawing from an empty library?"
  },
  {
    "imgs": [
      "Breathkeeper Seraph",
      "Uro, Titan of Nature's Wrath"
    ],
    "q": "I control Breathkeeper Seraph and cast Uro, Titan of Nature's Wrath from my hand. Can I soulbond Uro to Breathkeeper before Uro gets sacrificed to its own ability? And if I can, can I now get as many Uro triggers as I want?"
  },
  {
    "imgs": [
      "Ego Drain"
    ],
    "q": "Am I allowed to cast Ego Drain even if my hand is empty?"
  },
  {
    "imgs": [
      "Gruff Triplets"
    ],
    "q": "I control Gruff Triplets and its two token copies. I attack with all three, and my opponent blocks each one with a 3/3 of their own. Is there a way to stack the triggers so one Triplets dies first, pumping the other two to save them?"
  },
  {
    "imgs": [
      "Greater Auramancy",
      "Cooped Up"
    ],
    "q": "I control a 4/4 creature and a Greater Auramancy. My opponent enchants my 4/4 with Cooped Up. Can they still use Cooped Up's activated ability to exile my creature?"
  },
  {
    "imgs": [
      "Talion, the Kindly Lord",
      "Smuggler's Copter"
    ],
    "q": "I have Talion, the Kindly Lord in play, with the number \"3\" chosen. If my opponent casts a Smuggler's Copter, will Talion trigger?"
  },
  {
    "imgs": [
      "Elvish Vatkeeper",
      "Doubling Season"
    ],
    "q": "I control an Elvish Vatkeeper, a Doubling Season, and an Incubator token with four +1/+1 counters on it. I activate the Vatkeeper's ability, targeting my Incubator tokens. How many +1/+1 counters does it end up with?"
  },
  {
    "imgs": [
      "Imodane, the Pyrohammer",
      "Fear, Fire, Foes!"
    ],
    "q": "I have Imodane, the Pyrohammer in play. If I cast Fear, Fire, Foes! with X=4 targeting my opponent's 4/4 while they have three 1/1s in play, will I get an Imodan trigger? If so, how much damage will be dealt?"
  },
  {
    "imgs": [
      "Breach the Multiverse",
      "Archangel of Wrath",
      "Jace, the Perfected Mind",
      "Leyline Binding"
    ],
    "q": "My opponent just cast Breach the Multiverse, putting an Archangel of Wrath and a Jace, the Perfected Mind in play. Even though it wasn't kicked, will the Archangel's triggers still go on the stack, giving me a chance to cast Leyline Binding to exile Jace before they can activate one of Jace's loyalty abilities?"
  },
  {
    "imgs": [
      "Ohabi Caleria",
      "Arbalest Elite"
    ],
    "q": "I control Ohabi Caleria and an Arbalest Elite. I had to activate the Elite's ability during combat on my turn. Will the Elite untap during my opponent's untap step?"
  },
  {
    "imgs": [
      "Aquatic Alchemist // Bubble Up",
      "Eye of the Storm"
    ],
    "q": "What happens if I cast Bubble Up with an Eye of the Storm in play? Do I get to cast a copy of Aquatic Alchemist?"
  },
  {
    "imgs": [
      "Worldspine Wurm",
      "Undying Evil"
    ],
    "q": "If I target Worldspine Wurm with Undying Evil, what happens when my Wurm dies?"
  },
  {
    "imgs": [
      "Onakke Oathkeeper",
      "Gideon Jura"
    ],
    "q": "My opponent controls an Onakke Oathkeeper and a Gideon Jura. My opponent activated the +2 ability of Gideon, targeting me. What happens on my next turn? Am I forced to pay to attack Gideon?"
  },
  {
    "imgs": [
      "Bladegriff Prototype"
    ],
    "q": "I'm in a multiplayer game, and I have two Bladegriff Prototypes in play. If I attack the same player with both and they both deal damage, are they forced to destroy two permanents?"
  },
  {
    "imgs": [
      "Trial of a Time Lord"
    ],
    "q": "What happens if the vote that happens during chapter IV of Trial of a Time Lord is tied?"
  },
  {
    "imgs": [
      "Vislor Turlough"
    ],
    "q": "I'm in a multiplayer game, and I cast Vislor Turlough, and I gave it to one of my opponents. But then that opponent lost the game. What happens with Vislor Turlough?"
  },
  {
    "imgs": [
      "Psychic Paper"
    ],
    "q": "If I attach Psychic Paper to a creature, can I choose \"changeling\" as its creature type so it has all creature types?"
  },
  {
    "imgs": [
      "All Will Be One",
      "Dinosaurs on a Spaceship"
    ],
    "q": "If I have an All Will Be One in play, will suspending Dinosaurs on a Spaceship let me deal 4 damage to a target?"
  },
  {
    "imgs": [
      "Rassilon, the War President"
    ],
    "q": "How does Rassilon, the War President work with casting a colorless spell from exile? Am I allowed to tap two colorless creatures to conspire the spell?"
  },
  {
    "imgs": [
      "Everybody Lives!",
      "Ad Nauseam"
    ],
    "q": "If Everybody Lives! has resolved, what happens if I cast Ad Nauseam?"
  },
  {
    "imgs": [
      "Davros, Dalek Creator",
      "Sizzle"
    ],
    "q": "I'm in a four player game, and I have Davros, Dalek Creator. During my main phase, I cast Sizzle to deal three damage to each opponent. During my end step, how many Dalek tokens do I create?"
  },
  {
    "imgs": [
      "Harvesttide Infiltrator"
    ],
    "q": "How does day/night work in a game of Two-Headed giant?"
  },
  {
    "imgs": [
      "Helm of Awakening",
      "Everflowing Chalice"
    ],
    "q": "Does Helm of Awakening reduce the kicker cost of Everflowing Chalice?"
  },
  {
    "imgs": [
      "Teferi's Protection"
    ],
    "q": "If I use Teferi's Protection, can my opponent still kill me with poison counters?"
  },
  {
    "imgs": [
      "Cut In"
    ],
    "q": "I cast Cut In targeting an opponent's creature for the damage and my creature for the Role token. In response, my opponent feeds their creature to some sacrifice outlet. Does my creature stil get the Role token?"
  },
  {
    "imgs": [
      "Maralen of the Mornsong",
      "Windfall"
    ],
    "q": "I control Maralen of the Mornsong and my opponent plays Windfall. Do we still draw cards because Windfall has the later timestamp?"
  },
  {
    "imgs": [
      "Asmodeus the Archfiend",
      "Maralen of the Mornsong"
    ],
    "q": "What about Asmodeus the Archfiend? If I control Maralen of the Mornsong, can my opponent's Asmodeus still replace their card draws?"
  },
  {
    "imgs": [
      "Anikthea, Hand of Erebos",
      "Doubling Season"
    ],
    "q": "If I use Anikthea, Hand of Erebos to make a token copy of a Doubling Season in my graveyard, does Doubling Season token double itself as it enters the battlefield?"
  },
  {
    "imgs": [
      "Lava Spike",
      "Lava Spike"
    ],
    "q": "I have three Lava Spikes from Modern Masters that say \"target player\" and one Lava Spike from Time Spiral Remastered that says \"target player or planeswalker.\" Can I play all four cards in the same deck, and if so, which wording is correct?"
  },
  {
    "imgs": [
      "Jaya's Immolating Inferno",
      "Imodane, the Pyrohammer"
    ],
    "q": "If I cast Jaya's Immolating Inferno targeting one of my opponent's creatures, does it trigger Imodane, the Pyrohammer's ability?"
  },
  {
    "imgs": [
      "Likeness Looter"
    ],
    "q": "If Likeness Looter copies a creature and later on copies another creature, does it have the abilities from both creatures?"
  },
  {
    "imgs": [
      "Wall of Roots",
      "Agatha's Soul Cauldron"
    ],
    "q": "If I've exiled two Wall of Roots with Agatha's Soul Cauldron, can a creature with a +1/+1 counter on it activate the Wall's ability twice?"
  },
  {
    "imgs": [
      "Lich-Knights' Conquest"
    ],
    "q": "I cast Lich-Knights' Conquest, and for some reason I want to sacrifice two things but only return one creature card from my graveyard. Can I do that?"
  },
  {
    "imgs": [
      "Rowan, Scion of War"
    ],
    "q": "I've lost 5 life this turn and I activate Rowan, Scion of War's ability, then untap her somehow and activate her ability again. Do my black/red spells cost  or  less to cast?"
  },
  {
    "imgs": [
      "Gadwick's First Duel",
      "Johann's Stopgap"
    ],
    "q": "Gadwick's First Duel's chapter III just resolved, and I cast Johann's Stopgap with its bargain cost. Does it get copied?"
  },
  {
    "imgs": [
      "Ashiok, Wicked Manipulator",
      "Asmodeus the Archfiend"
    ],
    "q": "How does Ashiok, Wicked Manipulator's -7 ability count the mana value of cards that were exiled face-down, for example with Asmodeus the Archfiend?"
  },
  {
    "imgs": [
      "Heartless Hidetsugu",
      "Havoc Festival"
    ],
    "q": "I've heard that Heartless Hidetsugu can kill a Two-Headed Giant team with one activation, but Havoc Festival doesn't. What's the difference?"
  },
  {
    "imgs": [
      "Spiteful Hexmage",
      "Cruel Somnophage // Can't Wake Up"
    ],
    "q": "If I put a Cursed Role token on my opponent's Cruel Somnophage, is its power/toughness still */* or does it become 1/1?"
  },
  {
    "imgs": [
      "Field of Dreams",
      "Ponder"
    ],
    "q": "I control Field of Dreams and my opponent plays Ponder. Do I get to see the three cards that my opponent is looking at, and maybe even the fourth card?"
  },
  {
    "imgs": [
      "Jaheira, Friend of the Forest"
    ],
    "q": "If I control Jaheira, Friend of the Forest and I have a bunch of creatures with Role tokens on them, can I tap the Role tokens for ?"
  }
]