[
  {
    "imgs": [
      "Deep-Cavern Bat",
      "Breeches, Eager Pillager",
      "Eaten by Piranhas"
    ],
    "q": "My opponent cast <span class=\"autocard\">Deep-Cavern Bat</span> and exiled <span class=\"autocard\">Breeches, Eager Pillager</span> from my hand. Later on, I cast <span class=\"autocard\">Eaten by Piranhas</span> on the Bat. Do I get my exiled card back?",
    "a": "Nope, you don't get it back yet. The condition to return the card is the Bat leaving the battlefield, not losing its abilities. Since the Bat is still on the battlefield, Breeches is still sitting in exile. But since the one-shot effect to return the card was set up by the enter the battlefield trigger of the Bat resolving, if the Bat leaves play later on (even if it has no abilities at the time), you'll still get Breeches back.<br>"
  },
  {
    "imgs": [
      "Council of Echoes"
    ],
    "q": "If my opponent controls a <span class=\"autocard\">Council of Echoes</span>, can I play my own copy of <span class=\"autocard\">Council of Echoes</span> with descend active and bounce my opponent's Council of Echoes?",
    "a": "You sure can. Council of Echoes can't bounce itself, but can bounce a different Council of Echoes, so you're free to bounce the opponent's  Council of Echoes when your Council enters the battlefield.<br>"
  },
  {
    "imgs": [
      "Hulking Raptor"
    ],
    "q": "If I cast <span class=\"autocard\">Hulking Raptor</span> during my first main phase, do I immediately get two green mana from its triggered ability?",
    "a": "No, you don't get any mana yet. The Raptor has to be on the battlefield and under your control when the precombat main phase begins in order to trigger. It won't trigger if it enters during your precombat main phase, so you'll have to wait for the precombat main phase on your next turn to get the mana.<br>"
  },
  {
    "imgs": [
      "Pirate Hat",
      "Eaten by Piranhas"
    ],
    "q": "My opponent controls a creature equipped with <span class=\"autocard\">Pirate Hat</span>. If I enchant it with <span class=\"autocard\">Eaten by Piranhas</span>, what happens to their creature?",
    "a": "It becomes a 2/2 without any abilities, including the trigger from Pirate Hat. The effect from Eaten by Piranhas has a later timestamp than Pirate Hat, so the creature loses the triggered ability from the Hat. However, there is a solution for your opponent - if they move the Hat to a different creature, then reattach it to the first creature, that will reset the timestamp for the Hat, and their creature will once again have the triggered ability from the Hat.<br>"
  },
  {
    "imgs": [
      "The Ozolith"
    ],
    "q": "If <span class=\"autocard\">The Ozolith</span> ends up with a finality counter on it, and then The Ozolith is destroyed, what happens?",
    "a": "The Ozolith is exiled. While the only way to naturally get a finality counter in <i>The Lost Caverns of Ixalan</i> is to put one onto a creature, there's nothing preventing a noncreature permanent from ending up with a finality counter on it. If a noncreature permanent ends up with a finality counter on it and it would go to the graveyard, the effect from the counter will still apply to it and it will end up exiled instead of in the graveyard.<br>"
  },
  {
    "imgs": [
      "Geological Appraiser"
    ],
    "q": "What happens if I resolve <span class=\"autocard\">Geological Appraiser</span>'s discover 3 trigger but I don't have any cards with a mana value of 3 or less left in my library?",
    "a": "Eventually, the discover trigger will have exiled all of the cards in your library. Once you're out of cards in your library, we can't exile any more cards, so we move on to the next step of resolving the trigger. You didn't exile anything castable with the discover trigger, so you won't cast a spell or put anything into your hand. Then all of those cards you just exiled will be put onto the library in a random order.<br>\nIn short - you don't get to cast anything with the trigger, and you effectively \"shuffled\" your library.<br>"
  },
  {
    "imgs": [
      "Ojer Pakpatiq, Deepest Epoch",
      "Virtue of Loyalty // Ardenvale Fealty"
    ],
    "q": "I control <span class=\"autocard\">Ojer Pakpatiq, Deepest Epoch</span>. If I cast <span class=\"autocard\">Virtue of Loyalty // Ardenvale Fealty</span> from my hand (the adventure part of Virtue of Loyalty), what happens when it resolves?",
    "a": "Since the Fealty was cast from your hand, it will have rebound from Ojer Pakpatiq's effect. What happens when it resolves depends on which effect you let exile the Fealty when it resolves. The less exciting answer is letting adventure exile the spell. You won't be able to use rebound on your next upkeep, since it wasn't exiled to rebound, but you will be able to cast Virtue of Loyalty from exile later on.<br>\nThe more interesting answer is letting rebound exile the spell. During your next upkeep, when the rebound trigger resolves, you can cast either Ardenvale Fealty again (in which case you'll exile it to adventure when it resolves), or you can cast it normally and cast Virtue of Loyalty. Rebound just says to cast the exiled card, there's nothing that says you have to cast an instant or sorcery with the rebound trigger, so you're free to cast it normally and cast the Virtue itself. <br>"
  },
  {
    "imgs": [
      "The Enigma Jewel",
      "The Eternal Wanderer",
      "Quintorius Kand",
      "Locus of Enlightenment"
    ],
    "q": "I activate the craft ability of <span class=\"autocard\">The Enigma Jewel</span>, choosing to exile <span class=\"autocard\">The Eternal Wanderer</span> and <span class=\"autocard\">Quintorius Kand</span>, among other cards. Can I activate two loyalty abilities of <span class=\"autocard\">Locus of Enlightenment</span>, one ability given to it by The Eternal Wanderer, and a second ability given to it by Quintorius Kand?",
    "a": "Nope, that won't work. While the Jewel will have the loyalty abilities from both planeswalkers, there's restrictions built into the rules for loyalty abilities. One of those restrictions is that a permanent can only activate one loyalty ability each turn. The Locus will end up with loyalty abilities from both planeswalkers that were exiled to it, but the Locus can only activate one loyalty ability per turn, not a loyalty ability from each planeswalker that was exiled to it.<br>"
  },
  {
    "imgs": [
      "The Mightstone and Weakstone",
      "The Golden-Gear Colossus"
    ],
    "q": "What happens if I target <span class=\"autocard\">The Mightstone and Weakstone</span> with the triggered ability from <span class=\"autocard\">The Golden-Gear Colossus</span>?",
    "a": "Not much. The Mightstone and Weakstone are a meld card, but they aren't a transforming double-faced card, so they can't transform. You could target it with the Colossus's trigger, but that part of the trigger will do nothing when it resolves, since it can't transform (but you will still get the tokens).<br>"
  },
  {
    "imgs": [
      "Roaming Throne",
      "Pantlaza, Sun-Favored"
    ],
    "q": "I control <span class=\"autocard\">Roaming Throne</span> with \"Dinosaur\" as the chosen type. If I cast <span class=\"autocard\">Pantlaza, Sun-Favored</span>, does that mean I get two of Pantlaza's enter the battlefield triggers?",
    "a": "Technically, yes, but you can only use one of the triggers. You do get two triggers when Pantlaza enters the battlefield because of Roaming Throne. However, Pantlaza only lets you discover X once each turn. Once you've chosen to use the ability, it won't trigger for the rest of the turn, and any other triggers from Pantlaza won't do anything when the trigger resolves. You do get two triggers, but if you use the first trigger, you can't use the second trigger, so you'll still only get to discover X once each turn.<br>"
  },
  {
    "imgs": [
      "Geological Appraiser",
      "Ephemerate"
    ],
    "q": "I cast <span class=\"autocard\">Geological Appraiser</span>, and with its discover trigger, I exile and cast <span class=\"autocard\">Ephemerate</span>. Do I get to cast Ephemerate off of rebound on my next upkeep?",
    "a": "Sadly, you do not. For rebound to work, you have to cast the spell from your hand. Rebound won't do anything if you cast the spell from anywhere except your hand. With discover, you're casting it from exile, so if you cast Ephemerate off of the discover trigger, it will not rebound on your next upkeep.<br>"
  },
  {
    "imgs": [
      "Sandswirl Wanderglyph"
    ],
    "q": "If I remove my opponent's <span class=\"autocard\">Sandswirl Wanderglyph</span>, am I free to cast spells and attack like normal?",
    "a": "That depends on what you've done this turn. The Wanderglyph has two abilities - the first ability is a triggered ability that triggers when you cast a spell and will prevent you from attacking that turn. That effect will continue to apply, even if the Wanderglyph leaves play. But the last ability is a static ability, and that static ability only works for as long as the Wanderglyph is on the battlefield.<br>\nIf you cast a spell to remove the Wanderglyph, you still won't be able to attack that turn since you're still affected by the effect of the triggered ability. But if you attack, then the Wanderglyph leaves play, the static ability preventing you from casting spells doesn't exist anymore, so you're free to cast spells.<br>"
  },
  {
    "imgs": [
      "Sandswirl Wanderglyph"
    ],
    "q": "How does <span class=\"autocard\">Sandswirl Wanderglyph</span> work in a game of Two-Headed Giant?",
    "a": "The Wanderglyph will apply to each opponent on the opposing team separately. If one teammate casts a spell, that player can't attack your team, but their teammate can still attack that turn. Likewise, if one teammate attacks the player who controls the Wanderglyph, but the other does not, the player that attacked can't cast spells for the turn, but their teammate can still cast spells that turn. (Note that only applies if the player attacks the player who controls the Wanderglyph - if they attack the teammate that doesn't control the Wanderglyph, they'll be able to cast a spell after attacking).<br>"
  },
  {
    "imgs": [
      "Topography Tracker",
      "River Herald Guide"
    ],
    "q": "If I have two <span class=\"autocard\">Topography Tracker</span>s in play, and I cast <span class=\"autocard\">River Herald Guide</span>, how many times will I explore?",
    "a": "You will explore a total of four times. The Tracker has a replacement effect. When the Guide's triggered ability resolves, you would explore once, but we have two replacement effects that need to apply, so we apply one Tracker and now the Guide will explore and explore again. Then we apply the other Tracker, and it will add two more explores (the second Tracker adds one more to each explore the Guide would make), and now the Guide will explore and explore and explore and explore again, for a total of four explores.<br>"
  },
  {
    "imgs": [
      "Knight of Malice",
      "Indominus Rex, Alpha"
    ],
    "q": "If I discard <span class=\"autocard\">Knight of Malice</span> to <span class=\"autocard\">Indominus Rex, Alpha</span>, what kind of counters does Indominus Rex get?",
    "a": "It gets a first strike counter and a hexproof from white counter. Indominus Rex also cares about variants of the listed abilities, and can gain an ability counter of that variant. Hexproof from white is a variant on hexproof, so Indonimus Rex will get a hexproof from white counter from discarding Knight of Malice.<br>"
  },
  {
    "imgs": [
      "Ad Nauseam",
      "Permission Denied",
      "Counterspell"
    ],
    "q": "My opponent just cast <span class=\"autocard\">Ad Nauseam</span>, so I responded with <span class=\"autocard\">Permission Denied</span> to counter it. But in response to Permission Denied, another opponent cast <span class=\"autocard\">Counterspell</span> targeting Ad Nauseam. What happens when Permission Denied resolves?",
    "a": "The other opponent's Counterspell will counter Ad Nauseam. When Permission Denied goes to resolve, it sees its only target is illegal, so Permission Denied does nothing. Your opponents will still be able to cast noncreature spells like normal for the rest of the turn.<br>"
  },
  {
    "imgs": [
      "Anhelo, the Painter",
      "Molten Collapse",
      "Hulking Goblin"
    ],
    "q": "It's my turn, and I have <span class=\"autocard\">Anhelo, the Painter</span> in play and <span class=\"autocard\">Molten Collapse</span> in my hand, and I haven't had any permanent cards go to my graveyard yet. Can I cast Molten Collapse, use casualty from Anhelo and sacrifice a <span class=\"autocard\">Hulking Goblin</span> and be able to choose both modes of Molten Collapse?",
    "a": "Nope, the timing of that won't work. When we're announcing the spell, we have to figure out which mode or modes you're casting it with before we can pay any costs to cast the spell. When you're choosing the mode for Molten Collapse, you haven't descended yet that turn, so you're only allowed to choose one mode. It doesn't matter that you'll be sacrificing the Goblin later on during announcement, since you haven't descended yet, you'll only be able to choose one of the modes for Molten Collapse, not both modes.<br>"
  },
  {
    "imgs": [
      "Hakbal of the Surging Soul",
      "Benthic Biomancer"
    ],
    "q": "I have three Merfolk in play, including a <span class=\"autocard\">Hakbal of the Surging Soul</span> and a <span class=\"autocard\">Benthic Biomancer</span>. Hakbal's beginning of combat trigger resolves, and my Merfolk explore, starting with Benthic Biomancer. If I reveal a nonland card for the Biomancer's trigger, do I resolve the Biomancer's trigger before my next Merfolk explores?",
    "a": "Nope, all of your Merfolk will explore first. Hakbal has a single trigger that has your Merfolk explore (in the order you choose) when the trigger resolves. It's not a separate trigger for each of your Merfolk. All of your Merfolk will explore first, before you put the trigger from the Biomancer on the stack.<br>"
  },
  {
    "imgs": [
      "Soulcoil Viper"
    ],
    "q": "If my commander gets a <span class=\"autocard\">Soulcoil Viper</span>, what happens to my commander if it would die?",
    "a": "Because of the finality counter, instead of going to the graveyard, your commander goes to exile instead. But since your commander went to exile, you'll be able to move your commander out of exile to the command zone as a state-based action. Your commander won't be lost, it'll just be put into exile instead of your graveyard and can be moved to the command zone like normal.<br>"
  },
  {
    "imgs": [
      "Slicer, Hired Muscle",
      "Hunter's Blowgun"
    ],
    "q": "I control <span class=\"autocard\">Slicer, Hired Muscle</span> which is equipped with my <span class=\"autocard\">Hunter's Blowgun</span>. If I give control of Slicer to my opponent during their upkeep, which ability will Slicer gain, deathtouch or reach?",
    "a": "Slicer will have reach from the Blowgun. You still control the Blowgun, even if it ends up attached to an opponent's creature, so what ability the equipped creature will have will be determined by if it's your turn or not. Since it's not your turn, Slicer will have reach from your Blowgun, not deathtouch.<br>"
  }
]