[
  {
    "imgs": [
      "Converter Beast",
      "Shalai and Hallar"
    ],
    "q": "If I transform an Incubator token, does that trigger my Shalai and Hallar?",
    "a": "It does not. Transforming a permanent does not normally cause it to \"re-enter\" the battlefield, it merely changes status (similar to becoming tapped). There are a few cards that exile themselves, then enter the battlefield transformed (<a href=\"http"
  },
  {
    "imgs": [
      "Disciple of Caelus Nin",
      "Privileged Position",
      "Bear Cub"
    ],
    "q": "My opponent cast Disciple of Caelus Nin while I control Privileged Position and twenty Bear Cubs. Can I choose Privileged Position as one of my five safe non-land permanents keeping all my Bears safe from phasing as they have hexproof?",
    "a": "You can choose Privileged Position and up to four Bear Cubs, but the other Bears will be phased out as the Disciple's ability doesn't target."
  },
  {
    "imgs": [
      "Myrkul, Lord of Bones",
      "Murder",
      "Forest",
      "Animate Land"
    ],
    "q": "I control Myrkul, Lord of Bones and my opponent Murders my Forest that was animated into a creature by Animate Land. Can I still exile it to make a copy of it? Will it still be able to make mana?",
    "a": "Yes and no. Yes you can exile the land to make a copy that is an enchantment with no other types. The game looks back and sees that the last time it was on the battlefield it was a creature. However, it can't make mana as the only mana ability it had was granted by its land subtype Forest, which was removed when it lost its card type land."
  },
  {
    "imgs": [
      "No Way Out"
    ],
    "q": "I cast No Way Out targeting my opponent who already has an empty hand. Do I still create the decayed Zombie?",
    "a": "You do! No Way Out doesn't care if the opponent discards two, one, or zero cards, it will still make a Zombie."
  },
  {
    "imgs": [
      "No Way Out",
      "Blossoming Calm"
    ],
    "q": "I cast No Way Out targeting my opponent. They respond by casting Blossoming Calm. Do I still create the decayed Zombie?",
    "a": "You do not. No Way Out's only target just became illegal, so instead of resolving, it gets placed in the graveyard and completes none of its actions."
  },
  {
    "imgs": [
      "Balthor the Defiled",
      "Arvad the Cursed"
    ],
    "q": "Is Balthor the Defiled playable in my Arvad the Cursed Commander deck?",
    "a": "Yes, you can include Balthor in your Arvad deck. Balthor's color identity is only black. The word \"red\" in his text box doesn't add red to his color identity."
  },
  {
    "imgs": [
      "Roaming Throne",
      "Pantlaza, Sun-Favored",
      "Clone"
    ],
    "q": "Last week you answered a question about Roaming Throne with \"Dinosaur\" as the chosen type and then casting Pantlaza, Sun-Favored. In the answer you said, a player will effectively only get to discover once. Is this also true if I just Clone Pantlaza?",
    "a": "So long as the Clone is the first Dinosaur to enter the battlefield this turn, you will get to discover once for the original Pantlaza and once for the Clone. Before either discover trigger is put on the stack, you will have to put one Pantlaza into your graveyard to the legend rule."
  },
  {
    "imgs": [
      "Ghalta, Primal Hunger",
      "Mogg Fanatic"
    ],
    "q": "I attack my opponent with Ghalta, Primal Hunger and they block it with Mogg Fanatic. If they sacrifice the Fanatic to deal one damage to me before combat damage is dealt, will my opponent take 11 trample damage or 12?",
    "a": "They will take 12 trample damage. When a trample creature deals combat damage, it must assign at least lethal damage to each creature blocking it, then any remaining damage may be assigned to the defending player (or planeswalker). In this case there are no creatures to assign damage to, so all of it tramples over."
  },
  {
    "imgs": [
      "Éomer, King of Rohan",
      "Shock"
    ],
    "q": "My opponent currently controls five Human creatures and is casting Éomer, King of Rohan. Is there a point where I can Shock him before he gets his +1/+1 counters?",
    "a": "There is not. Éomer's +1/+1 counter ability is a replacement effect, not a triggered ability. He is never on the battlefield without those counters."
  },
  {
    "imgs": [
      "Dauthi Voidwalker",
      "Lightning Bolt",
      "Wrath of God"
    ],
    "q": "I was told by a friend that if you destroy Dauthi Voidwalker with a Lightning Bolt, the Lightning Bolt will get exiled by the Voidwalker. But if you destroy the Voidwalker with a Wrath of God, the Wrath will go to the graveyard. Is this true? And if so, why?",
    "a": "Your friend is correct on both accounts. When a sorcery or instant resolves you complete all actions in the text box in the order they appear. Then after all actions are completed, as the final step the sorcery or instant gets placed in the graveyard. So why do these two kill spells end up in different places? The short answer is what is actually killing the Voidwalker."
  },
  {
    "imgs": [
      "Unexpected Fangs",
      "Mutavault"
    ],
    "q": "I cast Unexpected Fangs targeting my animated Mutavault. At end of turn, do the counters fall off?",
    "a": "They do not. A non-creature permanent can have and keep counters such as +1/+1 counters and lifelink counters."
  },
  {
    "imgs": [
      "Lord Xander, the Collector",
      "Rite of Replication"
    ],
    "q": "Lord Xander, the Collector is my commander and he has been on the battlefield for a few turns. If I copy him five times with a kicked Rite of Replication, what happens?",
    "a": "You will go from having one Xander to six Xanders. Before you choose targets for the Xanders' enter the battlefield (ETB) triggers, you will have to place five of the Xanders in your graveyard to the legend rule. This will trigger five Xander death triggers. The five death triggers and the five ETB triggers will be put on the stack at the same time and you may place them in any order (5x Death followed by 5 ETB, or 5 ETB followed by 5x Death, or alternate between Death and ETB, or any other combination you can imagine)."
  },
  {
    "imgs": [
      "Trinisphere",
      "Bear Cub",
      "Swamp",
      "Dismember"
    ],
    "q": "My opponent controls a Trinisphere and a Bear Cub and the only mana source I have available is an untapped Swamp. Can I Dismember the Bear by paying 4 life?",
    "a": "Trinisphere will prevent you from being able to cast the Dismember this way. When you pay life for a Phyrexian Mana, it's not considered to be paying mana, therefore you will still need to pay <img src=\"/ci-reader/images/symbols/1.png\" class=\"mana\"> for each <img src=\"/ci-reader/images/symbols/BP.png\" class=\"mana\"> you paid life for."
  },
  {
    "imgs": [
      "Murderous Cut",
      "Swamp",
      "Trinisphere"
    ],
    "q": "Similar to the last question, if I want to Murderous Cut the Bear but only have one untapped Swamp but five cards in my graveyard with the opponent having a Trinisphere, can I do so?",
    "a": "Yes, you can. Delve, <a href=\"http"
  },
  {
    "imgs": [
      "Chord of Calling",
      "Trinisphere"
    ],
    "q": "Wait a minute, I could have sworn back in the day if you paid all of Chord of Calling's costs by tapping creatures, you still had to pay  for Trinisphere. What gives?",
    "a": "You are correct, this is a change from how delve and convoke used to work with Trinisphere. Around the time the core set M15 brought back convoke, both convoke and delve changed from abilities that reduced the cost of a spell (which didn't get around Trinisphere), to giving an alternative way to pay mana (which now does get around Trinisphere)."
  },
  {
    "imgs": [
      "Charismatic Conqueror"
    ],
    "q": "What happens if I cast Charismatic Conqueror while my opponent already controls one?",
    "a": "You and your opponent have an optional infinite combo for which either of you can end it as soon as either likes."
  },
  {
    "imgs": [
      "Bear Cub",
      "Charismatic Conqueror"
    ],
    "q": "If I cast a Bear Cub while my opponent controls a two Charismatic Conqueror, can I tap it twice to prevent my opponent from getting Vampire tokens?",
    "a": "You can not. You can't pay the cost of tapping if it is already tapped. So your options are give the opponent two Vampire tokens and keep the Bear Cub untapped through both triggers, or give the opponent one Vampire token, but your Bear Cub becomes tapped."
  },
  {
    "imgs": [
      "Charismatic Conqueror"
    ],
    "q": "So I asked you that last question so that I could ask you this question. What happens if during a three-player game, each player controls a Charismatic Conqueror?",
    "a": "So the first time a creature enters the battlefield untapped (most likely when the third Conqueror comes in), that creature will at minimum create one token for one opponent (because that player is stuck making one of the two options explained in the last question). The player or players who just created a Vampire will now trigger the Conquerors of each of their opponents. This will again make at least one Vampire, triggering yet again. This will go on ad infinitum, unless one player has a way to break the infinite chain (say they can sacrifice their own Conqueror or can destroy a Conqueror at instant speed). If there is no way to break the chain, then the game ends in draw."
  },
  {
    "imgs": [],
    "q": "In the last question, you said the combo can be broken. What happens if each player decides to give only one Vampire token each time as they are forced to, and then the combo gets broken?",
    "a": "So because triggers are put on the stack in player turn order (APNAP order), if all three players choose to tap their creature on the first trigger to resolve, and are then forced to give an opponent a Vampire token on the second trigger to resolve, two players create tons of tokens, while the third player gets no tokens."
  },
  {
    "imgs": [],
    "q": "What if the combo is broken after all players decide to give both opponents tokens?",
    "a": "Let's again say the active player is Amy, and the next player in turn order is Becky, and then the last player in turn order is Carl."
  }
]