[
  {
    "imgs": [
      "Lord of Shatterskull Pass",
      "Roaming Throne",
      "Diviner's Wand",
      "Grasp of the Hieromancer",
      "Flash Conscription"
    ],
    "q": "My <span class=\"autocard\">Lord of Shatterskull Pass</span> is leveled up to level 6 and I control a <span class=\"autocard\">Roaming Throne</span> naming Shaman. If I attack with the Lord of Shatterskull Pass, will it trigger twice?",
    "a": "Yes, it will. That's 12 damage to each creature defending player controls. Roaming Throne can double-trigger triggered abilities even if the creature doesn't innately have those abilities and gains them through other means (such as <span class=\"autocard\">Diviner's Wand</span>, <span class=\"autocard\">Grasp of the Hieromancer</span>, and <span class=\"autocard\">Flash Conscription</span>)."
  },
  {
    "imgs": [
      "Roaming Throne",
      "Bear Cub",
      "Umezawa's Jitte"
    ],
    "q": "Similar to the last question, if I have <span class=\"autocard\">Roaming Throne</span> naming Bear and have a <span class=\"autocard\">Bear Cub</span> wielding <span class=\"autocard\">Umezawa's Jitte</span>, do I gain double counters when my Bear deals damage?",
    "a": "You will not. The trigger for putting counters on Jitte is on Jitte, it is not a trigger Jitte grants to the Bear Cub. For Roaming Throne to be relevant, the creature has to be given the trigger, this is usually indicated by being put in between quotation marks. See the examples I used in the answer of the last question."
  },
  {
    "imgs": [
      "Bear Cub",
      "Grizzly Bears",
      "Runeclaw Bear",
      "Atla Palani, Nest Tender",
      "Lucille",
      "Gisa's Favorite Shovel"
    ],
    "q": "I have two cards I want to run in my commander deck that have the same abilities but different names, can I do this?",
    "a": "You can, sometimes. <span class=\"autocard\">Bear Cub</span>, <span class=\"autocard\">Grizzly Bears</span> and <span class=\"autocard\">Runeclaw Bear</span> are all different cards and you can run one of each in your Bear-themed Commander deck. \nThere are two kinds of these \"same card different names\" that you can't double up on.\nThe first type is an overlay card. <span class=\"autocard\">Atla Palani, Nest Tender</span> is for all intents and purposes the same card as <span class=\"autocard\">Atla Palani, Nest Tender</span>. You can tell it's the overlay type, because Atla Palani appears as a subtitle under Ian Malcolm's name.\nThe second type is the <i>Universes Within</i> cards. <span class=\"autocard\">Lucille</span> is a <i>Universes Beyond</i> card for the Walking Dead. It has a <i>Universes Within</i> version called <span class=\"autocard\">Gisa's Favorite Shovel</span>. These two are the same card and you can't run both in your Commander deck. These are slightly harder to tell than the overlay type. The <i>Universes Within</i> card has a second card number. As you can see on the Shovel, it's written as \"0019 =SLD 581\", the Shovel is card 19 of its set, but is equal to Secret Lair card #581. Secret Lair card #581 is Lucille. If a card has a \"=SLD ###\" it is a <i>Universes Within</i> card and you can't run it with its equivalent in the same Commander deck. <br>"
  },
  {
    "imgs": [
      "Imodane, the Pyrohammer",
      "Mishra's Command",
      "Bear Cub"
    ],
    "q": "I control <span class=\"autocard\">Imodane, the Pyrohammer</span> and cast <span class=\"autocard\">Mishra's Command</span> with an <img src=\"/ci-reader/images/symbols/X.png\" class=\"mana\"> equal to 5. I choose mode one targeting myself and mode two targeting my opponent's <span class=\"autocard\">Bear Cub</span>. Does Imodane trigger to punch my opponents for 5 damage each?",
    "a": "She does not. Imodane requires that the only target of the spell be a single creature. In the example you give, the Command targets both you and a creature. The Command has four modes, and each mode has a target, so any two modes you choose will lead to more than one target creature, with one exception. If you choose mode two and four and have both target the same enemy creature, then and only then would Imodane trigger from a Mishra's Command. (I suppose in a super rare situation its also possible for her to trigger if the opponent's planeswalker was also a creature and you choose it for the targets of both modes two and three)."
  },
  {
    "imgs": [
      "Slicer, Hired Muscle",
      "Kitesail Larcenist"
    ],
    "q": "At the beginning of my turn my opponent gave me their <span class=\"autocard\">Slicer, Hired Muscle</span> with its trigger. Then during my main phase it turned it into a Treasure with <span class=\"autocard\">Kitesail Larcenist</span>. As my turn ends, does the Treasure (aka, Slicer) return to its owner's control?",
    "a": "Although Slicer's abilities and types have changed, what granted you control of it is unaffected, and you will still have to give it back to its last controller."
  },
  {
    "imgs": [],
    "q": "Same set up as the last question. Can I sacrifice the Treasure (aka, Slicer) before giving it back to my opponent at end of turn?",
    "a": "You can not. It's true that Slicer lost all of its abilities, but the \"can't be sacrificed\" clause is not an ability on Slicer, but is part of the until end turn effect granted by the trigger that already resolved."
  },
  {
    "imgs": [
      "Nekusar, the Mindrazer",
      "Teferi's Puzzle Box",
      "Howling Mine"
    ],
    "q": "I control <span class=\"autocard\">Nekusar, the Mindrazer</span>, <span class=\"autocard\">Teferi's Puzzle Box</span>, and <span class=\"autocard\">Howling Mine</span>, I just passed the turn to my opponent, and we as a table have no idea in what way to resolve these three triggers. Help?",
    "a": "So all three triggers are controlled by the same player (you, the Nekusar player). This means you get to put them on the stack in the order of your choosing. They resolve in the reverse order you put them on the stack (last in first out). You have six options as how to stack them.\n   Top -&gt; Middle -&gt; Bottom<br>\n1) Nekusar, Puzzle Box, Mine<br>\n2) Nekusar, Mine, Puzzle Box<br>\n3) Puzzle Box, Nekusar, Mine<br>\n4) Puzzle Box, Mine, Nekusar<br>\n5) Mine, Puzzle Box, Nekusar<br>\n6) Mine, Nekusar, Puzzle Box\nIf we assume your opponent has three cards in hand as the turn began, then each choice leads to the corresponding result:\n1) Opponent draws for turn, takes 1 damage, opponent draws for Nekusar, takes 1 more,  opponent tucks five cards to bottom of library then draws five, takes 5 more, then opponent draws for Mine, takes 1 more damage for a total of 8 damage this turn.\n2) Opponent draws for turn, takes 1 damage, opponent draws for Nekusar, takes 1 more,  then opponent draws for Mine, takes 1 damage, then opponent tucks six cards to bottom of library then draws six, takes 6 more for a total of 9 damage this turn.\n3) Opponent draws for turn, takes 1 damage, then opponent tucks four cards to bottom of library and draws four cards, takes 4 damage, then draws for Nekusar, takes 1 damage, then draws for Mine, and takes 1 more damage for a total of 7 damage.\n4) Ends up with same damage as #3.\n5) Ends up with same damage as #1.\n6) Ends up with same damage as #2.\nIn all six cases your opponent will end up with six cards in hand, but your choice of taking 7, 8, or 9 damage.\nYou will notice the draw for the turn always happens first. This is not a trigger and it happens without using the stack as the draw step begins, then the triggers for the beginning of the draw step are put on the stack."
  },
  {
    "imgs": [
      "Doors of Durin",
      "Bear Cub",
      "Xenagos, God of Revels"
    ],
    "q": "I control <span class=\"autocard\">Doors of Durin</span> and attack with a <span class=\"autocard\">Bear Cub</span>. When the Doors trigger resolves I reveal <span class=\"autocard\">Xenagos, God of Revels</span>. Even with Xenagos on the battlefield I would only have a devotion of five. Does Xenagos still enter the battlefield even though it won't be a creature? If so, is it tapped? If so, is it attacking?",
    "a": "Yes, yes, and no. Xenagos is always a creature in every zone other than the battlefield. The Doors only care if Xenagos is a creature in the library, and it is, so it gets placed on the battlefield. The instructions say to put it onto the battlefield tapped, enchantments can be tapped, so it will be placed tapped. However, only creatures can attack or be attacking, so it won't be attacking."
  },
  {
    "imgs": [
      "Apprentice Necromancer",
      "Bear Cub",
      "Conjurer's Closet"
    ],
    "q": "During my turn, if I use <span class=\"autocard\">Apprentice Necromancer</span> to reanimate a <span class=\"autocard\">Bear Cub</span>, can I use <span class=\"autocard\">Conjurer's Closet</span> to prevent the Bear from getting sacrificed at end of turn?",
    "a": "If you choose your trigger order correctly, yes you can. Both Closet and the sacrifice trigger trigger at the same time and you control both triggers, so you can put them on the stack in the order of your choosing. If the Closet trigger resolves before the sacrifice, then the Bear will be a new object with no relation to its previous form and so won't get sacrificed to the trigger set up by the Necromancer."
  },
  {
    "imgs": [
      "Miirym, Sentinel Wyrm",
      "Shivan Dragon",
      "Carnelian Orb of Dragonkind",
      "Clone",
      "Bear Cub",
      "Sword of Vengeance"
    ],
    "q": "I control <span class=\"autocard\">Miirym, Sentinel Wyrm</span> and cast <span class=\"autocard\">Shivan Dragon</span> using mana from <span class=\"autocard\">Carnelian Orb of Dragonkind</span>. Will the token copy made by Miirym have haste, too?",
    "a": "The haste gained by Shivan Dragon is not a copiable characteristic, so the token won't have haste. If it helps, you can think of a how <span class=\"autocard\">Clone</span> won't copy the keyword abilities of the <span class=\"autocard\">Bear Cub</span> it copies if that Bear Cub is wielding a <span class=\"autocard\">Sword of Vengeance</span>."
  },
  {
    "imgs": [
      "Karn, the Great Creator",
      "Mana Crypt",
      "Glorious Anthem"
    ],
    "q": "My opponent uses <span class=\"autocard\">Karn, the Great Creator</span>'s +1 ability on my <span class=\"autocard\">Mana Crypt</span>. My opponent claims this kills my Crypt, is this true?",
    "a": "They are correct. Karn turns your Crypt into a 0/0 artifact creature, which immediately gets placed in the graveyard for having toughness zero or less. If you happen to have <span class=\"autocard\">Glorious Anthem</span> or similar effect, it would survive though!"
  },
  {
    "imgs": [
      "Unnatural Growth",
      "Scion of Calamity"
    ],
    "q": "In a four player Commander game, I control <span class=\"autocard\">Unnatural Growth</span> and attack with <span class=\"autocard\">Scion of Calamity</span>. I know the original Calamity will be a 10/10, but what about the token copies?",
    "a": "The tokens created by the myriad trigger will only be 5/5s. Unnatural Growth doubles the p/t of your creatures at the beginning of combat before attacks are declared (this is before the tokens are made). And similar to the Miirym question earlier, boosts to a creature's p/t are not copiable values, so the copies will be unaltered versions of Calamity."
  },
  {
    "imgs": [
      "Academic Dispute"
    ],
    "q": "I have <span class=\"autocard\">Academic Dispute</span> in my Commander deck. How does \"learn\" work in Commander?",
    "a": "So when playing with normal Commander rules, there is no outside the game zone to choose cards from, so you can really only discard and draw a card with the learn ability. However, Commander has variants that include sideboards, if your play group wants to allow them, then you can pull from the sideboard. Or if your group wants to go crazy, they can just let you pull from any cards you have with you, just understand you need permission beforehand, and it's not allowed in the normal Commander rules."
  },
  {
    "imgs": [
      "Serra's Emissary",
      "Tishana's Tidebinder",
      "Angel of Mercy",
      "Ajani's Welcome",
      "Ajani's Mantra",
      "Rummaging Goblin"
    ],
    "q": "I cast <span class=\"autocard\">Serra's Emissary</span> and my opponent tries to counter the Angel's ability with <span class=\"autocard\">Tishana's Tidebinder</span>'s trigger. Does this work?",
    "a": "No, it does not. Tidebinder's trigger can only counter triggered abilities (usually including the words <span class=\"autocard\">Angel of Mercy</span>, <span class=\"autocard\">Ajani's Welcome</span>, or <span class=\"autocard\">Ajani's Mantra</span>) or activated abilities (written in the form <span class=\"autocard\">Rummaging Goblin</span>). Serra's Emissary doesn't have either a triggered or activated ability. It has flying (static ability), choose a type (replacement ability), and granting protection (another static ability)."
  },
  {
    "imgs": [
      "Ojer Axonil, Deepest Might",
      "Temple of Power",
      "Jeska's Will"
    ],
    "q": "<span class=\"autocard\">Ojer Axonil, Deepest Might</span> is my commander and is currently  on its backside <span class=\"autocard\">Temple of Power</span>. If I cast <span class=\"autocard\">Jeska's Will</span> can I still choose both modes?",
    "a": "You can choose both modes. The \"commanderness\" of your commander is always present, no matter if it loses abilities, becomes a copy of a different card, is face-down, mutated, merged, or transformed."
  },
  {
    "imgs": [
      "Entreat the Angels",
      "Vendilion Clique"
    ],
    "q": "During my draw step I drew and revealed <span class=\"autocard\">Entreat the Angels</span>. My opponent claims they can cast <span class=\"autocard\">Vendilion Clique</span> and put the Entreat on the bottom of my library preventing me from casting it. Is this true?",
    "a": "They are correct. It's hard to tell why by just reading the reminder text next to miracle. So let's read the comprehensive rules on Miracle, shown below:\n702.94. Miracle\n702.94a Miracle is a static ability linked to a triggered ability. (See rule 603.11.) \"Miracle [cost]\" means \"You may reveal this card from your hand as you draw it if it's the first card you've drawn this turn. When you reveal this card this way, you may cast it by paying [cost] rather than its mana cost.\"\n702.94b If a player chooses to reveal a card using its miracle ability, they play with that card revealed until that card leaves their hand, that ability resolves, or that ability otherwise leaves the stack.\nSo between 702.94a and 702.94b, we can see you reveal the card as a replacement effect to drawing the card. This creates a trigger (when you reveal this card this way, you may cast it ....), the card remains revealed until it leaves your hand, the ability resolves, or that ability leaves the stack. This leaves a short window where an opponent can do something at instant speed to affect if the Entreat the Angels is still in your hand. If it's no longer in your hand when the trigger goes to resolve, you can't cast the Entreat as it's no longer in your hand."
  },
  {
    "imgs": [
      "Temporal Mastery",
      "Opt"
    ],
    "q": "In the last question you talked about the ability miracle. Do I have to following the time restriction of casting a spell when I miracle? So if I drew and revealed <span class=\"autocard\">Temporal Mastery</span> during my opponent's turn by casting <span class=\"autocard\">Opt</span>, can I Miracle it even though it's a sorcery and it's my opponent's turn?",
    "a": "You don't have to following timing restrictions and you can miracle sorceries, creatures, artifacts, and other non-instants drawn during an opponent's turn. In fact, you are ignoring timing restrictions when you miracle them during your own turn as you are casting them during your draw step, and not during your main phase with an empty stack."
  },
  {
    "imgs": [
      "Stone of Erech",
      "Glimpse the Unthinkable",
      "Kozilek, Butcher of Truth"
    ],
    "q": "I control <span class=\"autocard\">Stone of Erech</span> and cast <span class=\"autocard\">Glimpse the Unthinkable</span> milling my opponent ten cards. One of those ten cards was <span class=\"autocard\">Kozilek, Butcher of Truth</span>. Can I respond to Kozi's shuffle ability with my Stone of Erech to prevent Kozi or any other cards from getting shuffled back into my opponent's library?",
    "a": "Yes, you can. Kozi's shuffle ability is a triggered ability that goes on the stack, and before it can resolve each player gets at least one priority pass to use activated abilities and/or instants. Stone of Erech is an activated ability that isn't limited to sorcery speed so you're golden to exile Kozi and the rest of your opponent's graveyard."
  },
  {
    "imgs": [
      "Belligerent Yearling",
      "Colossal Dreadmaw",
      "Go for the Throat"
    ],
    "q": "My opponent controls <span class=\"autocard\">Belligerent Yearling</span> and casts <span class=\"autocard\">Colossal Dreadmaw</span>. After the Dreadmaw enters the battlefield, but before Yearling's trigger resolves, I <span class=\"autocard\">Go for the Throat</span> the Dreadmaw. Will the Yearling still get to change its power to 6 this turn?",
    "a": "It will. When the Yearling's trigger resolves, it will see the Dreadmaw is dead, and so will use last known information to determine its size. The last time Dreadmaw was on the battlefield it had 6 power, so the Yearling can have its power changed to 6 this turn."
  },
  {
    "imgs": [
      "Anhelo, the Painter",
      "Malicious Affliction"
    ],
    "q": "I contol <span class=\"autocard\">Anhelo, the Painter</span> and cast <span class=\"autocard\">Malicious Affliction</span> choosing to pay the casualty cost by sacrificing a 2/2 Zombie token. Will this trigger the morbid ability?",
    "a": "Abilities that trigger from a spell being cast don't trigger until the spell is fully cast. Paying costs, including additional costs like casualty, are paid for earlier in the process of casting a spell. Therefore, casualty will trigger morbid even if both are on the same spell.\nI have an article where I go over the steps to casting a spell in greater detail <a href=\"article/3750\">here.</a>)"
  }
]